// SPDX-License-Identifier: Apache-2.0
// Copyright (c) 2026 Witold Kaminski

/* automatically generated by rust-bindgen 0.72.1 */

#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(C)]
pub struct __BindgenComplex<T> {
    pub re: T,
    pub im: T,
}
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2Y: u32 = 0;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 202405;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_XOPEN2K24: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;

pub const WINT_MAX: u32 = 4294967295;
pub const CUDA_VERSION: u32 = 13020;
pub const CU_IPC_HANDLE_SIZE: u32 = 64;
pub const CU_COMPUTE_ACCELERATED_TARGET_BASE: u32 = 65536;
pub const CU_COMPUTE_FAMILY_TARGET_BASE: u32 = 131072;
pub const CU_GRAPH_COND_ASSIGN_DEFAULT: u32 = 1;
pub const CU_GRAPH_KERNEL_NODE_PORT_DEFAULT: u32 = 0;
pub const CU_GRAPH_KERNEL_NODE_PORT_PROGRAMMATIC: u32 = 1;
pub const CU_GRAPH_KERNEL_NODE_PORT_LAUNCH_ORDER: u32 = 2;
pub const CU_MEMHOSTALLOC_PORTABLE: u32 = 1;
pub const CU_MEMHOSTALLOC_DEVICEMAP: u32 = 2;
pub const CU_MEMHOSTALLOC_WRITECOMBINED: u32 = 4;
pub const CU_MEMHOSTREGISTER_PORTABLE: u32 = 1;
pub const CU_MEMHOSTREGISTER_DEVICEMAP: u32 = 2;
pub const CU_MEMHOSTREGISTER_IOMEMORY: u32 = 4;
pub const CU_MEMHOSTREGISTER_READ_ONLY: u32 = 8;
pub const CU_ARRAY_SPARSE_PROPERTIES_SINGLE_MIPTAIL: u32 = 1;
pub const CU_TENSOR_MAP_NUM_QWORDS: u32 = 16;
pub const CUDA_EXTERNAL_MEMORY_DEDICATED: u32 = 1;
pub const CUDA_EXTERNAL_SEMAPHORE_SIGNAL_SKIP_NVSCIBUF_MEMSYNC: u32 = 1;
pub const CUDA_EXTERNAL_SEMAPHORE_WAIT_SKIP_NVSCIBUF_MEMSYNC: u32 = 2;
pub const CUDA_NVSCISYNC_ATTR_SIGNAL: u32 = 1;
pub const CUDA_NVSCISYNC_ATTR_WAIT: u32 = 2;
pub const CU_MEM_CREATE_USAGE_TILE_POOL: u32 = 1;
pub const CU_MEM_CREATE_USAGE_HW_DECOMPRESS: u32 = 2;
pub const CU_MEM_POOL_CREATE_USAGE_HW_DECOMPRESS: u32 = 2;
pub const CUDA_COOPERATIVE_LAUNCH_MULTI_DEVICE_NO_PRE_LAUNCH_SYNC: u32 = 1;
pub const CUDA_COOPERATIVE_LAUNCH_MULTI_DEVICE_NO_POST_LAUNCH_SYNC: u32 = 2;
pub const CUDA_ARRAY3D_LAYERED: u32 = 1;
pub const CUDA_ARRAY3D_2DARRAY: u32 = 1;
pub const CUDA_ARRAY3D_SURFACE_LDST: u32 = 2;
pub const CUDA_ARRAY3D_CUBEMAP: u32 = 4;
pub const CUDA_ARRAY3D_TEXTURE_GATHER: u32 = 8;
pub const CUDA_ARRAY3D_DEPTH_TEXTURE: u32 = 16;
pub const CUDA_ARRAY3D_COLOR_ATTACHMENT: u32 = 32;
pub const CUDA_ARRAY3D_SPARSE: u32 = 64;
pub const CUDA_ARRAY3D_DEFERRED_MAPPING: u32 = 128;
pub const CUDA_ARRAY3D_VIDEO_ENCODE_DECODE: u32 = 256;
pub const CU_TRSA_OVERRIDE_FORMAT: u32 = 1;
pub const CU_TRSF_READ_AS_INTEGER: u32 = 1;
pub const CU_TRSF_NORMALIZED_COORDINATES: u32 = 2;
pub const CU_TRSF_SRGB: u32 = 16;
pub const CU_TRSF_DISABLE_TRILINEAR_OPTIMIZATION: u32 = 32;
pub const CU_TRSF_SEAMLESS_CUBEMAP: u32 = 64;
pub const CU_LAUNCH_KERNEL_REQUIRED_BLOCK_DIM: u32 = 1;
pub const CU_LAUNCH_PARAM_END_AS_INT: u32 = 0;
pub const CU_LAUNCH_PARAM_BUFFER_POINTER_AS_INT: u32 = 1;
pub const CU_LAUNCH_PARAM_BUFFER_SIZE_AS_INT: u32 = 2;
pub const CU_PARAM_TR_DEFAULT: i32 = -1;
pub const RESOURCE_ABI_VERSION: u32 = 1;
pub const RESOURCE_ABI_BYTES: u32 = 40;
pub type wchar_t = ::std::os::raw::c_int;
pub type __cfloat128 = __BindgenComplex<u128>;
pub type _Float128 = u128;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
unsafe extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
unsafe extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __unused: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__unused"]
        [::std::mem::offset_of!(__pthread_mutex_s, __unused) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __pad1: ::std::os::raw::c_ulong,
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
    pub __unused_initialized_1: ::std::os::raw::c_uint,
    pub __unused_initialized_2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 16usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 28usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 32usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_1"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_1) - 40usize];
    ["Offset of field: __pthread_cond_s::__unused_initialized_2"]
        [::std::mem::offset_of!(__pthread_cond_s, __unused_initialized_2) - 44usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
unsafe extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
unsafe extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn drand48() -> f64;
}
unsafe extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
unsafe extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
unsafe extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
unsafe extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn arc4random() -> __uint32_t;
}
unsafe extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
unsafe extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
unsafe extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
unsafe extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
unsafe extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
    -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type cuuint32_t = u32;
pub type cuuint64_t = u64;
pub type CUdeviceptr_v2 = ::std::os::raw::c_ulonglong;
pub type CUdeviceptr = CUdeviceptr_v2;
pub type CUdevice_v1 = ::std::os::raw::c_int;
pub type CUdevice = CUdevice_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUctx_st {
    _unused: [u8; 0],
}
pub type CUcontext = *mut CUctx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmod_st {
    _unused: [u8; 0],
}
pub type CUmodule = *mut CUmod_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUfunc_st {
    _unused: [u8; 0],
}
pub type CUfunction = *mut CUfunc_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlib_st {
    _unused: [u8; 0],
}
pub type CUlibrary = *mut CUlib_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUkern_st {
    _unused: [u8; 0],
}
pub type CUkernel = *mut CUkern_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUarray_st {
    _unused: [u8; 0],
}
pub type CUarray = *mut CUarray_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmipmappedArray_st {
    _unused: [u8; 0],
}
pub type CUmipmappedArray = *mut CUmipmappedArray_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUtexref_st {
    _unused: [u8; 0],
}
pub type CUtexref = *mut CUtexref_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUsurfref_st {
    _unused: [u8; 0],
}
pub type CUsurfref = *mut CUsurfref_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUevent_st {
    _unused: [u8; 0],
}
pub type CUevent = *mut CUevent_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstream_st {
    _unused: [u8; 0],
}
pub type CUstream = *mut CUstream_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphicsResource_st {
    _unused: [u8; 0],
}
pub type CUgraphicsResource = *mut CUgraphicsResource_st;
pub type CUtexObject_v1 = ::std::os::raw::c_ulonglong;
pub type CUtexObject = CUtexObject_v1;
pub type CUsurfObject_v1 = ::std::os::raw::c_ulonglong;
pub type CUsurfObject = CUsurfObject_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUextMemory_st {
    _unused: [u8; 0],
}
pub type CUexternalMemory = *mut CUextMemory_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUextSemaphore_st {
    _unused: [u8; 0],
}
pub type CUexternalSemaphore = *mut CUextSemaphore_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraph_st {
    _unused: [u8; 0],
}
pub type CUgraph = *mut CUgraph_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphNode_st {
    _unused: [u8; 0],
}
pub type CUgraphNode = *mut CUgraphNode_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphExec_st {
    _unused: [u8; 0],
}
pub type CUgraphExec = *mut CUgraphExec_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmemPoolHandle_st {
    _unused: [u8; 0],
}
pub type CUmemoryPool = *mut CUmemPoolHandle_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUuserObject_st {
    _unused: [u8; 0],
}
pub type CUuserObject = *mut CUuserObject_st;
pub type CUgraphConditionalHandle = cuuint64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphDeviceUpdatableNode_st {
    _unused: [u8; 0],
}
pub type CUgraphDeviceNode = *mut CUgraphDeviceUpdatableNode_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUasyncCallbackEntry_st {
    _unused: [u8; 0],
}
pub type CUasyncCallbackHandle = *mut CUasyncCallbackEntry_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgreenCtx_st {
    _unused: [u8; 0],
}
#[doc = " \\typedef typedef struct CUgreenCtx_st* CUgreenCtx\n A green context handle. This handle can be used safely from only one CPU thread at a time.\n Created via ::cuGreenCtxCreate"]
pub type CUgreenCtx = *mut CUgreenCtx_st;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUuuid_st {
    pub bytes: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUuuid_st"][::std::mem::size_of::<CUuuid_st>() - 16usize];
    ["Alignment of CUuuid_st"][::std::mem::align_of::<CUuuid_st>() - 1usize];
    ["Offset of field: CUuuid_st::bytes"][::std::mem::offset_of!(CUuuid_st, bytes) - 0usize];
};
pub type CUuuid = CUuuid_st;
#[doc = " Fabric handle - An opaque handle representing a memory allocation\n that can be exported to processes in same or different nodes. For IPC\n between processes on different nodes they must be connected via the\n NVSwitch fabric."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUmemFabricHandle_st {
    pub data: [::std::os::raw::c_uchar; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUmemFabricHandle_st"][::std::mem::size_of::<CUmemFabricHandle_st>() - 64usize];
    ["Alignment of CUmemFabricHandle_st"][::std::mem::align_of::<CUmemFabricHandle_st>() - 1usize];
    ["Offset of field: CUmemFabricHandle_st::data"]
        [::std::mem::offset_of!(CUmemFabricHandle_st, data) - 0usize];
};
#[doc = " Fabric handle - An opaque handle representing a memory allocation\n that can be exported to processes in same or different nodes. For IPC\n between processes on different nodes they must be connected via the\n NVSwitch fabric."]
pub type CUmemFabricHandle_v1 = CUmemFabricHandle_st;
#[doc = " Fabric handle - An opaque handle representing a memory allocation\n that can be exported to processes in same or different nodes. For IPC\n between processes on different nodes they must be connected via the\n NVSwitch fabric."]
pub type CUmemFabricHandle = CUmemFabricHandle_v1;
#[doc = " CUDA IPC event handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUipcEventHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUipcEventHandle_st"][::std::mem::size_of::<CUipcEventHandle_st>() - 64usize];
    ["Alignment of CUipcEventHandle_st"][::std::mem::align_of::<CUipcEventHandle_st>() - 1usize];
    ["Offset of field: CUipcEventHandle_st::reserved"]
        [::std::mem::offset_of!(CUipcEventHandle_st, reserved) - 0usize];
};
#[doc = " CUDA IPC event handle"]
pub type CUipcEventHandle_v1 = CUipcEventHandle_st;
#[doc = " CUDA IPC event handle"]
pub type CUipcEventHandle = CUipcEventHandle_v1;
#[doc = " CUDA IPC mem handle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUipcMemHandle_st {
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUipcMemHandle_st"][::std::mem::size_of::<CUipcMemHandle_st>() - 64usize];
    ["Alignment of CUipcMemHandle_st"][::std::mem::align_of::<CUipcMemHandle_st>() - 1usize];
    ["Offset of field: CUipcMemHandle_st::reserved"]
        [::std::mem::offset_of!(CUipcMemHandle_st, reserved) - 0usize];
};
#[doc = " CUDA IPC mem handle"]
pub type CUipcMemHandle_v1 = CUipcMemHandle_st;
#[doc = " CUDA IPC mem handle"]
pub type CUipcMemHandle = CUipcMemHandle_v1;
#[doc = "< Automatically enable peer access between remote devices as needed"]
pub const CUipcMem_flags_enum_CU_IPC_MEM_LAZY_ENABLE_PEER_ACCESS: CUipcMem_flags_enum = 1;
#[doc = " CUDA Ipc Mem Flags"]
pub type CUipcMem_flags_enum = ::std::os::raw::c_uint;
#[doc = " CUDA Ipc Mem Flags"]
pub use self::CUipcMem_flags_enum as CUipcMem_flags;
#[doc = "< Memory can be accessed by any stream on any device"]
pub const CUmemAttach_flags_enum_CU_MEM_ATTACH_GLOBAL: CUmemAttach_flags_enum = 1;
#[doc = "< Memory cannot be accessed by any stream on any device"]
pub const CUmemAttach_flags_enum_CU_MEM_ATTACH_HOST: CUmemAttach_flags_enum = 2;
#[doc = "< Memory can only be accessed by a single stream on the associated device"]
pub const CUmemAttach_flags_enum_CU_MEM_ATTACH_SINGLE: CUmemAttach_flags_enum = 4;
#[doc = " CUDA Mem Attach Flags"]
pub type CUmemAttach_flags_enum = ::std::os::raw::c_uint;
#[doc = " CUDA Mem Attach Flags"]
pub use self::CUmemAttach_flags_enum as CUmemAttach_flags;
#[doc = "< Automatic scheduling"]
pub const CUctx_flags_enum_CU_CTX_SCHED_AUTO: CUctx_flags_enum = 0;
#[doc = "< Set spin as default scheduling"]
pub const CUctx_flags_enum_CU_CTX_SCHED_SPIN: CUctx_flags_enum = 1;
#[doc = "< Set yield as default scheduling"]
pub const CUctx_flags_enum_CU_CTX_SCHED_YIELD: CUctx_flags_enum = 2;
#[doc = "< Set blocking synchronization as default scheduling"]
pub const CUctx_flags_enum_CU_CTX_SCHED_BLOCKING_SYNC: CUctx_flags_enum = 4;
#[doc = "< Set blocking synchronization as default scheduling\n  \\deprecated This flag was deprecated as of CUDA 4.0\n  and was replaced with ::CU_CTX_SCHED_BLOCKING_SYNC."]
pub const CUctx_flags_enum_CU_CTX_BLOCKING_SYNC: CUctx_flags_enum = 4;
pub const CUctx_flags_enum_CU_CTX_SCHED_MASK: CUctx_flags_enum = 7;
#[doc = "< \\deprecated This flag was deprecated as of CUDA 11.0\n  and it no longer has any effect. All contexts\n  as of CUDA 3.2 behave as though the flag is enabled."]
pub const CUctx_flags_enum_CU_CTX_MAP_HOST: CUctx_flags_enum = 8;
#[doc = "< Keep local memory allocation after launch"]
pub const CUctx_flags_enum_CU_CTX_LMEM_RESIZE_TO_MAX: CUctx_flags_enum = 16;
#[doc = "< Trigger coredumps from exceptions in this context"]
pub const CUctx_flags_enum_CU_CTX_COREDUMP_ENABLE: CUctx_flags_enum = 32;
#[doc = "< Enable user pipe to trigger coredumps in this context"]
pub const CUctx_flags_enum_CU_CTX_USER_COREDUMP_ENABLE: CUctx_flags_enum = 64;
#[doc = "< Ensure synchronous memory operations on this context will synchronize"]
pub const CUctx_flags_enum_CU_CTX_SYNC_MEMOPS: CUctx_flags_enum = 128;
pub const CUctx_flags_enum_CU_CTX_FLAGS_MASK: CUctx_flags_enum = 255;
#[doc = " Context creation flags"]
pub type CUctx_flags_enum = ::std::os::raw::c_uint;
#[doc = " Context creation flags"]
pub use self::CUctx_flags_enum as CUctx_flags;
#[doc = "< Automatic scheduling"]
pub const CUevent_sched_flags_enum_CU_EVENT_SCHED_AUTO: CUevent_sched_flags_enum = 0;
#[doc = "< Set spin as default scheduling"]
pub const CUevent_sched_flags_enum_CU_EVENT_SCHED_SPIN: CUevent_sched_flags_enum = 1;
#[doc = "< Set yield as default scheduling"]
pub const CUevent_sched_flags_enum_CU_EVENT_SCHED_YIELD: CUevent_sched_flags_enum = 2;
#[doc = "< Set blocking synchronization as default scheduling"]
pub const CUevent_sched_flags_enum_CU_EVENT_SCHED_BLOCKING_SYNC: CUevent_sched_flags_enum = 4;
#[doc = " Event sched flags"]
pub type CUevent_sched_flags_enum = ::std::os::raw::c_uint;
#[doc = " Event sched flags"]
pub use self::CUevent_sched_flags_enum as CUevent_sched_flags;
#[doc = "< Automatic scheduling"]
pub const cl_event_flags_enum_NVCL_EVENT_SCHED_AUTO: cl_event_flags_enum = 0;
#[doc = "< Set spin as default scheduling"]
pub const cl_event_flags_enum_NVCL_EVENT_SCHED_SPIN: cl_event_flags_enum = 1;
#[doc = "< Set yield as default scheduling"]
pub const cl_event_flags_enum_NVCL_EVENT_SCHED_YIELD: cl_event_flags_enum = 2;
#[doc = "< Set blocking synchronization as default scheduling"]
pub const cl_event_flags_enum_NVCL_EVENT_SCHED_BLOCKING_SYNC: cl_event_flags_enum = 4;
#[doc = " NVCL event scheduling flags"]
pub type cl_event_flags_enum = ::std::os::raw::c_uint;
#[doc = " NVCL event scheduling flags"]
pub use self::cl_event_flags_enum as cl_event_flags;
#[doc = "< Automatic scheduling"]
pub const cl_context_flags_enum_NVCL_CTX_SCHED_AUTO: cl_context_flags_enum = 0;
#[doc = "< Set spin as default scheduling"]
pub const cl_context_flags_enum_NVCL_CTX_SCHED_SPIN: cl_context_flags_enum = 1;
#[doc = "< Set yield as default scheduling"]
pub const cl_context_flags_enum_NVCL_CTX_SCHED_YIELD: cl_context_flags_enum = 2;
#[doc = "< Set blocking synchronization as default scheduling"]
pub const cl_context_flags_enum_NVCL_CTX_SCHED_BLOCKING_SYNC: cl_context_flags_enum = 4;
#[doc = " NVCL context scheduling flags"]
pub type cl_context_flags_enum = ::std::os::raw::c_uint;
#[doc = " NVCL context scheduling flags"]
pub use self::cl_context_flags_enum as cl_context_flags;
#[doc = "< The execution thread will block until new host tasks are ready to run"]
pub const CUhostTaskSyncMode_enum_CU_HOST_TASK_BLOCKING: CUhostTaskSyncMode_enum = 0;
#[doc = "< The execution thread will spin wait until new host tasks are ready to run"]
pub const CUhostTaskSyncMode_enum_CU_HOST_TASK_SPINWAIT: CUhostTaskSyncMode_enum = 1;
pub type CUhostTaskSyncMode_enum = ::std::os::raw::c_uint;
pub use self::CUhostTaskSyncMode_enum as CUhostTaskSyncMode;
#[doc = "< Default stream flag"]
pub const CUstream_flags_enum_CU_STREAM_DEFAULT: CUstream_flags_enum = 0;
#[doc = "< Stream does not synchronize with stream 0 (the NULL stream)"]
pub const CUstream_flags_enum_CU_STREAM_NON_BLOCKING: CUstream_flags_enum = 1;
#[doc = " Stream creation flags"]
pub type CUstream_flags_enum = ::std::os::raw::c_uint;
#[doc = " Stream creation flags"]
pub use self::CUstream_flags_enum as CUstream_flags;
#[doc = "< Default event flag"]
pub const CUevent_flags_enum_CU_EVENT_DEFAULT: CUevent_flags_enum = 0;
#[doc = "< Event uses blocking synchronization"]
pub const CUevent_flags_enum_CU_EVENT_BLOCKING_SYNC: CUevent_flags_enum = 1;
#[doc = "< Event will not record timing data"]
pub const CUevent_flags_enum_CU_EVENT_DISABLE_TIMING: CUevent_flags_enum = 2;
#[doc = "< Event is suitable for interprocess use. CU_EVENT_DISABLE_TIMING must be set"]
pub const CUevent_flags_enum_CU_EVENT_INTERPROCESS: CUevent_flags_enum = 4;
#[doc = " Event creation flags"]
pub type CUevent_flags_enum = ::std::os::raw::c_uint;
#[doc = " Event creation flags"]
pub use self::CUevent_flags_enum as CUevent_flags;
#[doc = "< Default event record flag"]
pub const CUevent_record_flags_enum_CU_EVENT_RECORD_DEFAULT: CUevent_record_flags_enum = 0;
#[doc = "< When using stream capture, create an event record node\n  instead of the default behavior.  This flag is invalid\n  when used outside of capture."]
pub const CUevent_record_flags_enum_CU_EVENT_RECORD_EXTERNAL: CUevent_record_flags_enum = 1;
#[doc = " Event record flags"]
pub type CUevent_record_flags_enum = ::std::os::raw::c_uint;
#[doc = " Event record flags"]
pub use self::CUevent_record_flags_enum as CUevent_record_flags;
#[doc = "< Default event wait flag"]
pub const CUevent_wait_flags_enum_CU_EVENT_WAIT_DEFAULT: CUevent_wait_flags_enum = 0;
#[doc = "< When using stream capture, create an event wait node\n  instead of the default behavior.  This flag is invalid\n  when used outside of capture."]
pub const CUevent_wait_flags_enum_CU_EVENT_WAIT_EXTERNAL: CUevent_wait_flags_enum = 1;
#[doc = " Event wait flags"]
pub type CUevent_wait_flags_enum = ::std::os::raw::c_uint;
#[doc = " Event wait flags"]
pub use self::CUevent_wait_flags_enum as CUevent_wait_flags;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_INTEGER_ADD: CUatomicOperation_enum = 0;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_INTEGER_MIN: CUatomicOperation_enum = 1;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_INTEGER_MAX: CUatomicOperation_enum = 2;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_INTEGER_INCREMENT: CUatomicOperation_enum = 3;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_INTEGER_DECREMENT: CUatomicOperation_enum = 4;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_AND: CUatomicOperation_enum = 5;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_OR: CUatomicOperation_enum = 6;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_XOR: CUatomicOperation_enum = 7;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_EXCHANGE: CUatomicOperation_enum = 8;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_CAS: CUatomicOperation_enum = 9;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_FLOAT_ADD: CUatomicOperation_enum = 10;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_FLOAT_MIN: CUatomicOperation_enum = 11;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_FLOAT_MAX: CUatomicOperation_enum = 12;
pub const CUatomicOperation_enum_CU_ATOMIC_OPERATION_MAX: CUatomicOperation_enum = 13;
#[doc = " CUDA-valid Atomic Operations"]
pub type CUatomicOperation_enum = ::std::os::raw::c_uint;
#[doc = " CUDA-valid Atomic Operations"]
pub use self::CUatomicOperation_enum as CUatomicOperation;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_SIGNED:
    CUatomicOperationCapability_enum = 1;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_UNSIGNED:
    CUatomicOperationCapability_enum = 2;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_REDUCTION:
    CUatomicOperationCapability_enum = 4;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_SCALAR_32:
    CUatomicOperationCapability_enum = 8;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_SCALAR_64:
    CUatomicOperationCapability_enum = 16;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_SCALAR_128:
    CUatomicOperationCapability_enum = 32;
pub const CUatomicOperationCapability_enum_CU_ATOMIC_CAPABILITY_VECTOR_32x4:
    CUatomicOperationCapability_enum = 64;
#[doc = " CUDA-valid Atomic Operation capabilities"]
pub type CUatomicOperationCapability_enum = ::std::os::raw::c_uint;
#[doc = " CUDA-valid Atomic Operation capabilities"]
pub use self::CUatomicOperationCapability_enum as CUatomicOperationCapability;
#[doc = "< Wait until (int32_t)(*addr - value) >= 0 (or int64_t for 64 bit\nvalues). Note this is a cyclic comparison which ignores wraparound.\n(Default behavior.)"]
pub const CUstreamWaitValue_flags_enum_CU_STREAM_WAIT_VALUE_GEQ: CUstreamWaitValue_flags_enum = 0;
#[doc = "< Wait until *addr == value."]
pub const CUstreamWaitValue_flags_enum_CU_STREAM_WAIT_VALUE_EQ: CUstreamWaitValue_flags_enum = 1;
#[doc = "< Wait until (*addr & value) != 0."]
pub const CUstreamWaitValue_flags_enum_CU_STREAM_WAIT_VALUE_AND: CUstreamWaitValue_flags_enum = 2;
#[doc = "< Wait until ~(*addr | value) != 0. Support for this operation can be\nqueried with ::cuDeviceGetAttribute() and\n::CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR."]
pub const CUstreamWaitValue_flags_enum_CU_STREAM_WAIT_VALUE_NOR: CUstreamWaitValue_flags_enum = 3;
#[doc = "< Follow the wait operation with a flush of outstanding remote writes. This\nmeans that, if a remote write operation is guaranteed to have reached the\ndevice before the wait can be satisfied, that write is guaranteed to be\nvisible to downstream device work. The device is permitted to reorder\nremote writes internally. For example, this flag would be required if\ntwo remote writes arrive in a defined order, the wait is satisfied by the\nsecond write, and downstream work needs to observe the first write.\nSupport for this operation is restricted to selected platforms and can be\nqueried with ::CU_DEVICE_ATTRIBUTE_CAN_FLUSH_REMOTE_WRITES."]
pub const CUstreamWaitValue_flags_enum_CU_STREAM_WAIT_VALUE_FLUSH: CUstreamWaitValue_flags_enum =
    1073741824;
#[doc = " Flags for ::cuStreamWaitValue32 and ::cuStreamWaitValue64"]
pub type CUstreamWaitValue_flags_enum = ::std::os::raw::c_uint;
#[doc = " Flags for ::cuStreamWaitValue32 and ::cuStreamWaitValue64"]
pub use self::CUstreamWaitValue_flags_enum as CUstreamWaitValue_flags;
#[doc = "< Default behavior"]
pub const CUstreamWriteValue_flags_enum_CU_STREAM_WRITE_VALUE_DEFAULT:
    CUstreamWriteValue_flags_enum = 0;
#[doc = "< Permits the write to be reordered with writes which were issued\nbefore it, as a performance optimization. Normally,\n::cuStreamWriteValue32 will provide a memory fence before the\nwrite, which has similar semantics to\n__threadfence_system() but is scoped to the stream\nrather than a CUDA thread.\nThis flag is not supported in the v2 API."]
pub const CUstreamWriteValue_flags_enum_CU_STREAM_WRITE_VALUE_NO_MEMORY_BARRIER:
    CUstreamWriteValue_flags_enum = 1;
#[doc = " Flags for ::cuStreamWriteValue32"]
pub type CUstreamWriteValue_flags_enum = ::std::os::raw::c_uint;
#[doc = " Flags for ::cuStreamWriteValue32"]
pub use self::CUstreamWriteValue_flags_enum as CUstreamWriteValue_flags;
#[doc = "< Represents a ::cuStreamWaitValue32 operation"]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_WAIT_VALUE_32: CUstreamBatchMemOpType_enum =
    1;
#[doc = "< Represents a ::cuStreamWriteValue32 operation"]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_WRITE_VALUE_32: CUstreamBatchMemOpType_enum =
    2;
#[doc = "< Represents a ::cuStreamWaitValue64 operation"]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_WAIT_VALUE_64: CUstreamBatchMemOpType_enum =
    4;
#[doc = "< Represents a ::cuStreamWriteValue64 operation"]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_WRITE_VALUE_64: CUstreamBatchMemOpType_enum =
    5;
#[doc = "< Insert a memory barrier of the specified type"]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_BARRIER: CUstreamBatchMemOpType_enum = 6;
#[doc = "< Perform a atomic reduction. See ::CUstreamBatchMemOpParams::atomicReduction"]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_ATOMIC_REDUCTION:
    CUstreamBatchMemOpType_enum = 8;
#[doc = "< This has the same effect as ::CU_STREAM_WAIT_VALUE_FLUSH, but as a\nstandalone operation."]
pub const CUstreamBatchMemOpType_enum_CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES:
    CUstreamBatchMemOpType_enum = 3;
#[doc = " Operations for ::cuStreamBatchMemOp"]
pub type CUstreamBatchMemOpType_enum = ::std::os::raw::c_uint;
#[doc = " Operations for ::cuStreamBatchMemOp"]
pub use self::CUstreamBatchMemOpType_enum as CUstreamBatchMemOpType;
#[doc = "< System-wide memory barrier."]
pub const CUstreamMemoryBarrier_flags_enum_CU_STREAM_MEMORY_BARRIER_TYPE_SYS:
    CUstreamMemoryBarrier_flags_enum = 0;
#[doc = "< Limit memory barrier scope to the GPU."]
pub const CUstreamMemoryBarrier_flags_enum_CU_STREAM_MEMORY_BARRIER_TYPE_GPU:
    CUstreamMemoryBarrier_flags_enum = 1;
#[doc = " Flags for ::CUstreamBatchMemOpParams::memoryBarrier"]
pub type CUstreamMemoryBarrier_flags_enum = ::std::os::raw::c_uint;
#[doc = " Flags for ::CUstreamBatchMemOpParams::memoryBarrier"]
pub use self::CUstreamMemoryBarrier_flags_enum as CUstreamMemoryBarrier_flags;
#[doc = "< Performs an atomic OR: *(address) = *(address) | value"]
pub const CUstreamAtomicReductionOpType_enum_CU_STREAM_ATOMIC_REDUCTION_OP_OR:
    CUstreamAtomicReductionOpType_enum = 6;
#[doc = "< Performs an atomic AND: *(address) = *(address) & value"]
pub const CUstreamAtomicReductionOpType_enum_CU_STREAM_ATOMIC_REDUCTION_OP_AND:
    CUstreamAtomicReductionOpType_enum = 5;
#[doc = "< Performs an atomic ADD: *(address) = *(address) + value"]
pub const CUstreamAtomicReductionOpType_enum_CU_STREAM_ATOMIC_REDUCTION_OP_ADD:
    CUstreamAtomicReductionOpType_enum = 0;
#[doc = " Atomic reduction operation types for ::CUstreamBatchMemOpParams::atomicReduction::reductionOp"]
pub type CUstreamAtomicReductionOpType_enum = ::std::os::raw::c_uint;
#[doc = " Atomic reduction operation types for ::CUstreamBatchMemOpParams::atomicReduction::reductionOp"]
pub use self::CUstreamAtomicReductionOpType_enum as CUstreamAtomicReductionOpType;
pub const CUstreamAtomicReductionDataType_enum_CU_STREAM_ATOMIC_REDUCTION_UNSIGNED_32:
    CUstreamAtomicReductionDataType_enum = 14;
pub const CUstreamAtomicReductionDataType_enum_CU_STREAM_ATOMIC_REDUCTION_UNSIGNED_64:
    CUstreamAtomicReductionDataType_enum = 22;
#[doc = " Atomic reduction data types for ::CUstreamBatchMemOpParams::atomicReduction::dataType"]
pub type CUstreamAtomicReductionDataType_enum = ::std::os::raw::c_uint;
#[doc = " Atomic reduction data types for ::CUstreamBatchMemOpParams::atomicReduction::dataType"]
pub use self::CUstreamAtomicReductionDataType_enum as CUstreamAtomicReductionDataType;
#[doc = " Per-operation parameters for ::cuStreamBatchMemOp"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUstreamBatchMemOpParams_union {
    #[doc = "< Operation. This is the first field of all the union elemets and acts as a TAG to determine which union member is valid."]
    pub operation: CUstreamBatchMemOpType,
    #[doc = "< Params for ::CU_STREAM_MEM_OP_WAIT_VALUE_32 and ::CU_STREAM_MEM_OP_WAIT_VALUE_64 operations."]
    pub waitValue: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
    #[doc = "< Params for ::CU_STREAM_MEM_OP_WRITE_VALUE_32 and ::CU_STREAM_MEM_OP_WRITE_VALUE_64 operations."]
    pub writeValue: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
    #[doc = "< Params for ::CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES operations."]
    pub flushRemoteWrites: CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
    #[doc = "< Params for ::CU_STREAM_MEM_OP_BARRIER operations."]
    pub memoryBarrier: CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st,
    pub atomicReduction: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
    pub pad: [cuuint64_t; 6usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st {
    pub operation: CUstreamBatchMemOpType,
    pub address: CUdeviceptr,
    pub __bindgen_anon_1:
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
    #[doc = "< See ::CUstreamWaitValue_flags."]
    pub flags: ::std::os::raw::c_uint,
    #[doc = "< For driver internal use. Initial value is unimportant."]
    pub alias: CUdeviceptr,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1 {
    pub value: cuuint32_t,
    pub value64: cuuint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1"]
        [::std::mem::size_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        >() - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        value
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1::value64",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st__bindgen_ty_1,
        value64
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st"][::std::mem::size_of::<
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
    >() - 40usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st>()
            - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::operation"]
        [::std::mem::offset_of!(
            CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
            operation
        ) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::address"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
        address
    )
        - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::flags"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
        flags
    )
        - 24usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st::alias"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWaitValueParams_st,
        alias
    )
        - 32usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st {
    pub operation: CUstreamBatchMemOpType,
    pub address: CUdeviceptr,
    pub __bindgen_anon_1:
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
    #[doc = "< See ::CUstreamWriteValue_flags."]
    pub flags: ::std::os::raw::c_uint,
    #[doc = "< For driver internal use. Initial value is unimportant."]
    pub alias: CUdeviceptr,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1 {
    pub value: cuuint32_t,
    pub value64: cuuint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1"]
        [::std::mem::size_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        >() - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        >() - 8usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1::value",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        value
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1::value64",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st__bindgen_ty_1,
        value64
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st"][::std::mem::size_of::<
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
    >() - 40usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st>()
            - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::operation"]
        [::std::mem::offset_of!(
            CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
            operation
        ) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::address"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
        address
    )
        - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::flags"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
        flags
    )
        - 24usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st::alias"][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpWriteValueParams_st,
        alias
    )
        - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st {
    pub operation: CUstreamBatchMemOpType,
    #[doc = "< Must be 0."]
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st"]
        [::std::mem::size_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        >() - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        >() - 4usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st::operation",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        operation
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st::flags",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpFlushRemoteWritesParams_st,
        flags
    ) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st {
    pub operation: CUstreamBatchMemOpType,
    #[doc = "< See ::CUstreamMemoryBarrier_flags"]
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st"]
        [::std::mem::size_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st>(
        ) - 8usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st>(
        ) - 4usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st::operation",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st,
        operation
    ) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st::flags"]
        [::std::mem::offset_of!(
            CUstreamBatchMemOpParams_union_CUstreamMemOpMemoryBarrierParams_st,
            flags
        ) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st {
    pub operation: CUstreamBatchMemOpType,
    #[doc = "< Must be 0"]
    pub flags: ::std::os::raw::c_uint,
    #[doc = "< See ::CUstreamAtomicReductionOpType"]
    pub reductionOp: CUstreamAtomicReductionOpType,
    #[doc = "< See ::CUstreamAtomicReductionDataType"]
    pub dataType: CUstreamAtomicReductionDataType,
    #[doc = "< The address the atomic operation will be operated on"]
    pub address: CUdeviceptr,
    #[doc = "< The operand value the atomic operation will operate with"]
    pub value: cuuint64_t,
    #[doc = "< For driver internal use. Initial value is unimportant."]
    pub alias: CUdeviceptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st"]
        [::std::mem::size_of::<CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st>(
        ) - 40usize];
    ["Alignment of CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st"]
        [::std::mem::align_of::<
            CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        >() - 8usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::operation",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        operation
    ) - 0usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::flags",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        flags
    ) - 4usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::reductionOp",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        reductionOp
    ) - 8usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::dataType",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        dataType
    ) - 12usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::address",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        address
    ) - 16usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::value",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        value
    ) - 24usize];
    [
        "Offset of field: CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st::alias",
    ][::std::mem::offset_of!(
        CUstreamBatchMemOpParams_union_CUstreamMemOpAtomicReductionParams_st,
        alias
    ) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamBatchMemOpParams_union"]
        [::std::mem::size_of::<CUstreamBatchMemOpParams_union>() - 48usize];
    ["Alignment of CUstreamBatchMemOpParams_union"]
        [::std::mem::align_of::<CUstreamBatchMemOpParams_union>() - 8usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::operation"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, operation) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::waitValue"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, waitValue) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::writeValue"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, writeValue) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::flushRemoteWrites"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, flushRemoteWrites) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::memoryBarrier"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, memoryBarrier) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::atomicReduction"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, atomicReduction) - 0usize];
    ["Offset of field: CUstreamBatchMemOpParams_union::pad"]
        [::std::mem::offset_of!(CUstreamBatchMemOpParams_union, pad) - 0usize];
};
#[doc = " Per-operation parameters for ::cuStreamBatchMemOp"]
pub type CUstreamBatchMemOpParams_v1 = CUstreamBatchMemOpParams_union;
#[doc = " Per-operation parameters for ::cuStreamBatchMemOp"]
pub type CUstreamBatchMemOpParams = CUstreamBatchMemOpParams_v1;
#[doc = " Batch memory operation node parameters\n\n Used in the legacy ::cuGraphAddBatchMemOpNode api.\n New code should use ::cuGraphAddNode()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st {
    pub ctx: CUcontext,
    pub count: ::std::os::raw::c_uint,
    pub paramArray: *mut CUstreamBatchMemOpParams,
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st"]
        [::std::mem::size_of::<CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st>() - 32usize];
    ["Alignment of CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st"]
        [::std::mem::align_of::<CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st>() - 8usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st::ctx"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st, ctx) - 0usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st::count"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st, count) - 8usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st::paramArray"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st, paramArray) - 16usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st::flags"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st, flags) - 24usize];
};
#[doc = " Batch memory operation node parameters\n\n Used in the legacy ::cuGraphAddBatchMemOpNode api.\n New code should use ::cuGraphAddNode()"]
pub type CUDA_BATCH_MEM_OP_NODE_PARAMS_v1 = CUDA_BATCH_MEM_OP_NODE_PARAMS_v1_st;
#[doc = " Batch memory operation node parameters\n\n Used in the legacy ::cuGraphAddBatchMemOpNode api.\n New code should use ::cuGraphAddNode()"]
pub type CUDA_BATCH_MEM_OP_NODE_PARAMS = CUDA_BATCH_MEM_OP_NODE_PARAMS_v1;
#[doc = " Batch memory operation node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st {
    #[doc = "< Context to use for the operations."]
    pub ctx: CUcontext,
    #[doc = "< Number of operations in paramArray."]
    pub count: ::std::os::raw::c_uint,
    #[doc = "< Array of batch memory operations."]
    pub paramArray: *mut CUstreamBatchMemOpParams,
    #[doc = "< Flags to control the node."]
    pub flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st"]
        [::std::mem::size_of::<CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st>() - 32usize];
    ["Alignment of CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st"]
        [::std::mem::align_of::<CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st>() - 8usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st::ctx"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st, ctx) - 0usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st::count"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st, count) - 8usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st::paramArray"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st, paramArray) - 16usize];
    ["Offset of field: CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st::flags"]
        [::std::mem::offset_of!(CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st, flags) - 24usize];
};
#[doc = " Batch memory operation node parameters"]
pub type CUDA_BATCH_MEM_OP_NODE_PARAMS_v2 = CUDA_BATCH_MEM_OP_NODE_PARAMS_v2_st;
#[doc = "< Default behavior"]
pub const CUoccupancy_flags_enum_CU_OCCUPANCY_DEFAULT: CUoccupancy_flags_enum = 0;
#[doc = "< Assume global caching is enabled and cannot be automatically turned off"]
pub const CUoccupancy_flags_enum_CU_OCCUPANCY_DISABLE_CACHING_OVERRIDE: CUoccupancy_flags_enum = 1;
#[doc = " Occupancy calculator flag"]
pub type CUoccupancy_flags_enum = ::std::os::raw::c_uint;
#[doc = " Occupancy calculator flag"]
pub use self::CUoccupancy_flags_enum as CUoccupancy_flags;
#[doc = "< Add new nodes to the dependency set"]
pub const CUstreamUpdateCaptureDependencies_flags_enum_CU_STREAM_ADD_CAPTURE_DEPENDENCIES:
    CUstreamUpdateCaptureDependencies_flags_enum = 0;
#[doc = "< Replace the dependency set with the new nodes"]
pub const CUstreamUpdateCaptureDependencies_flags_enum_CU_STREAM_SET_CAPTURE_DEPENDENCIES:
    CUstreamUpdateCaptureDependencies_flags_enum = 1;
#[doc = " Flags for ::cuStreamUpdateCaptureDependencies"]
pub type CUstreamUpdateCaptureDependencies_flags_enum = ::std::os::raw::c_uint;
#[doc = " Flags for ::cuStreamUpdateCaptureDependencies"]
pub use self::CUstreamUpdateCaptureDependencies_flags_enum as CUstreamUpdateCaptureDependencies_flags;
#[doc = "< Sent when the process has exceeded its device memory budget"]
pub const CUasyncNotificationType_enum_CU_ASYNC_NOTIFICATION_TYPE_OVER_BUDGET:
    CUasyncNotificationType_enum = 1;
#[doc = " Types of async notification that can be sent"]
pub type CUasyncNotificationType_enum = ::std::os::raw::c_uint;
#[doc = " Types of async notification that can be sent"]
pub use self::CUasyncNotificationType_enum as CUasyncNotificationType;
#[doc = " Information passed to the user via the async notification callback"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUasyncNotificationInfo_st {
    #[doc = "< The type of notification being sent"]
    pub type_: CUasyncNotificationType,
    #[doc = "< Information about the notification. \\p type must be checked in order to interpret this field."]
    pub info: CUasyncNotificationInfo_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUasyncNotificationInfo_st__bindgen_ty_1 {
    #[doc = "< Information about notifications of type \\p CU_ASYNC_NOTIFICATION_TYPE_OVER_BUDGET"]
    pub overBudget: CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< The number of bytes that the process has allocated above its device memory budget"]
    pub bytesOverBudget: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1::bytesOverBudget"][::std::mem::offset_of!(
        CUasyncNotificationInfo_st__bindgen_ty_1__bindgen_ty_1,
        bytesOverBudget
    )
        - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUasyncNotificationInfo_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUasyncNotificationInfo_st__bindgen_ty_1>() - 8usize];
    ["Alignment of CUasyncNotificationInfo_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUasyncNotificationInfo_st__bindgen_ty_1>() - 8usize];
    ["Offset of field: CUasyncNotificationInfo_st__bindgen_ty_1::overBudget"]
        [::std::mem::offset_of!(CUasyncNotificationInfo_st__bindgen_ty_1, overBudget) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUasyncNotificationInfo_st"]
        [::std::mem::size_of::<CUasyncNotificationInfo_st>() - 16usize];
    ["Alignment of CUasyncNotificationInfo_st"]
        [::std::mem::align_of::<CUasyncNotificationInfo_st>() - 8usize];
    ["Offset of field: CUasyncNotificationInfo_st::type_"]
        [::std::mem::offset_of!(CUasyncNotificationInfo_st, type_) - 0usize];
    ["Offset of field: CUasyncNotificationInfo_st::info"]
        [::std::mem::offset_of!(CUasyncNotificationInfo_st, info) - 8usize];
};
#[doc = " Information passed to the user via the async notification callback"]
pub type CUasyncNotificationInfo = CUasyncNotificationInfo_st;
#[doc = " CUDA async notification callback\n \\param info Information describing what actions to take as a result of this notification.\n \\param userData Pointer to user defined data provided at callback registration.\n \\param callback The callback handle associated with this specific callback."]
pub type CUasyncCallback = ::std::option::Option<
    unsafe extern "C" fn(
        info: *mut CUasyncNotificationInfo,
        userData: *mut ::std::os::raw::c_void,
        callback: CUasyncCallbackHandle,
    ),
>;
#[doc = "< Unsigned 8-bit integers"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNSIGNED_INT8: CUarray_format_enum = 1;
#[doc = "< Unsigned 16-bit integers"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNSIGNED_INT16: CUarray_format_enum = 2;
#[doc = "< Unsigned 32-bit integers"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNSIGNED_INT32: CUarray_format_enum = 3;
#[doc = "< Signed 8-bit integers"]
pub const CUarray_format_enum_CU_AD_FORMAT_SIGNED_INT8: CUarray_format_enum = 8;
#[doc = "< Signed 16-bit integers"]
pub const CUarray_format_enum_CU_AD_FORMAT_SIGNED_INT16: CUarray_format_enum = 9;
#[doc = "< Signed 32-bit integers"]
pub const CUarray_format_enum_CU_AD_FORMAT_SIGNED_INT32: CUarray_format_enum = 10;
#[doc = "< 16-bit floating point"]
pub const CUarray_format_enum_CU_AD_FORMAT_HALF: CUarray_format_enum = 16;
#[doc = "< 32-bit floating point"]
pub const CUarray_format_enum_CU_AD_FORMAT_FLOAT: CUarray_format_enum = 32;
#[doc = "< 8-bit YUV planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_NV12: CUarray_format_enum = 176;
#[doc = "< 1 channel unsigned 8-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT8X1: CUarray_format_enum = 192;
#[doc = "< 2 channel unsigned 8-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT8X2: CUarray_format_enum = 193;
#[doc = "< 4 channel unsigned 8-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT8X4: CUarray_format_enum = 194;
#[doc = "< 1 channel unsigned 16-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT16X1: CUarray_format_enum = 195;
#[doc = "< 2 channel unsigned 16-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT16X2: CUarray_format_enum = 196;
#[doc = "< 4 channel unsigned 16-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT16X4: CUarray_format_enum = 197;
#[doc = "< 1 channel signed 8-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_SNORM_INT8X1: CUarray_format_enum = 198;
#[doc = "< 2 channel signed 8-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_SNORM_INT8X2: CUarray_format_enum = 199;
#[doc = "< 4 channel signed 8-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_SNORM_INT8X4: CUarray_format_enum = 200;
#[doc = "< 1 channel signed 16-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_SNORM_INT16X1: CUarray_format_enum = 201;
#[doc = "< 2 channel signed 16-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_SNORM_INT16X2: CUarray_format_enum = 202;
#[doc = "< 4 channel signed 16-bit normalized integer"]
pub const CUarray_format_enum_CU_AD_FORMAT_SNORM_INT16X4: CUarray_format_enum = 203;
#[doc = "< 4 channel unsigned normalized block-compressed (BC1 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC1_UNORM: CUarray_format_enum = 145;
#[doc = "< 4 channel unsigned normalized block-compressed (BC1 compression) format with sRGB encoding"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC1_UNORM_SRGB: CUarray_format_enum = 146;
#[doc = "< 4 channel unsigned normalized block-compressed (BC2 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC2_UNORM: CUarray_format_enum = 147;
#[doc = "< 4 channel unsigned normalized block-compressed (BC2 compression) format with sRGB encoding"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC2_UNORM_SRGB: CUarray_format_enum = 148;
#[doc = "< 4 channel unsigned normalized block-compressed (BC3 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC3_UNORM: CUarray_format_enum = 149;
#[doc = "< 4 channel unsigned normalized block-compressed (BC3 compression) format with sRGB encoding"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC3_UNORM_SRGB: CUarray_format_enum = 150;
#[doc = "< 1 channel unsigned normalized block-compressed (BC4 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC4_UNORM: CUarray_format_enum = 151;
#[doc = "< 1 channel signed normalized block-compressed (BC4 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC4_SNORM: CUarray_format_enum = 152;
#[doc = "< 2 channel unsigned normalized block-compressed (BC5 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC5_UNORM: CUarray_format_enum = 153;
#[doc = "< 2 channel signed normalized block-compressed (BC5 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC5_SNORM: CUarray_format_enum = 154;
#[doc = "< 3 channel unsigned half-float block-compressed (BC6H compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC6H_UF16: CUarray_format_enum = 155;
#[doc = "< 3 channel signed half-float block-compressed (BC6H compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC6H_SF16: CUarray_format_enum = 156;
#[doc = "< 4 channel unsigned normalized block-compressed (BC7 compression) format"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC7_UNORM: CUarray_format_enum = 157;
#[doc = "< 4 channel unsigned normalized block-compressed (BC7 compression) format with sRGB encoding"]
pub const CUarray_format_enum_CU_AD_FORMAT_BC7_UNORM_SRGB: CUarray_format_enum = 158;
#[doc = "< 10-bit YUV planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_P010: CUarray_format_enum = 159;
#[doc = "< 16-bit YUV planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_P016: CUarray_format_enum = 161;
#[doc = "< 8-bit YUV planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_NV16: CUarray_format_enum = 162;
#[doc = "< 10-bit YUV planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_P210: CUarray_format_enum = 163;
#[doc = "< 16-bit YUV planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_P216: CUarray_format_enum = 164;
#[doc = "< 2 channel, 8-bit YUV packed planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_YUY2: CUarray_format_enum = 165;
#[doc = "< 2 channel, 10-bit YUV packed planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_Y210: CUarray_format_enum = 166;
#[doc = "< 2 channel, 16-bit YUV packed planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_Y216: CUarray_format_enum = 167;
#[doc = "< 4 channel, 8-bit YUV packed planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_AYUV: CUarray_format_enum = 168;
#[doc = "< 10-bit YUV packed planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_Y410: CUarray_format_enum = 169;
#[doc = "< 4 channel, 12-bit YUV packed planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_Y416: CUarray_format_enum = 177;
#[doc = "< 3 channel 8-bit YUV planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_Y444_PLANAR8: CUarray_format_enum = 178;
#[doc = "< 3 channel 10-bit YUV planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_Y444_PLANAR10: CUarray_format_enum = 179;
#[doc = "< 3 channel 8-bit YUV semi-planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_YUV444_8bit_SemiPlanar: CUarray_format_enum = 180;
#[doc = "< 3 channel 16-bit YUV semi-planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_YUV444_16bit_SemiPlanar: CUarray_format_enum = 181;
#[doc = "< 4 channel unorm R10G10B10A2 RGB format"]
pub const CUarray_format_enum_CU_AD_FORMAT_UNORM_INT_101010_2: CUarray_format_enum = 80;
#[doc = "< 4 channel unsigned 8-bit YUV packed format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_PACKED_422: CUarray_format_enum = 81;
#[doc = "< 4 channel unsigned 8-bit YUV packed format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_PACKED_444: CUarray_format_enum = 82;
#[doc = "< 3 channel unsigned 8-bit YUV semi-planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_SEMIPLANAR_420: CUarray_format_enum = 83;
#[doc = "< 3 channel unsigned 16-bit YUV semi-planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT16_SEMIPLANAR_420: CUarray_format_enum = 84;
#[doc = "< 3 channel unsigned 8-bit YUV semi-planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_SEMIPLANAR_422: CUarray_format_enum = 85;
#[doc = "< 3 channel unsigned 16-bit YUV semi-planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT16_SEMIPLANAR_422: CUarray_format_enum = 86;
#[doc = "< 3 channel unsigned 8-bit YUV semi-planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_SEMIPLANAR_444: CUarray_format_enum = 87;
#[doc = "< 3 channel unsigned 16-bit YUV semi-planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT16_SEMIPLANAR_444: CUarray_format_enum = 88;
#[doc = "< 3 channel unsigned 8-bit YUV planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_PLANAR_420: CUarray_format_enum = 89;
#[doc = "< 3 channel unsigned 16-bit YUV planar format, with 4:2:0 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT16_PLANAR_420: CUarray_format_enum = 90;
#[doc = "< 3 channel unsigned 8-bit YUV planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_PLANAR_422: CUarray_format_enum = 91;
#[doc = "< 3 channel unsigned 16-bit YUV planar format, with 4:2:2 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT16_PLANAR_422: CUarray_format_enum = 92;
#[doc = "< 3 channel unsigned 8-bit YUV planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT8_PLANAR_444: CUarray_format_enum = 93;
#[doc = "< 3 channel unsigned 16-bit YUV planar format, with 4:4:4 sampling"]
pub const CUarray_format_enum_CU_AD_FORMAT_UINT16_PLANAR_444: CUarray_format_enum = 94;
pub const CUarray_format_enum_CU_AD_FORMAT_MAX: CUarray_format_enum = 2147483647;
#[doc = " Array formats"]
pub type CUarray_format_enum = ::std::os::raw::c_uint;
#[doc = " Array formats"]
pub use self::CUarray_format_enum as CUarray_format;
#[doc = "< Wrapping address mode"]
pub const CUaddress_mode_enum_CU_TR_ADDRESS_MODE_WRAP: CUaddress_mode_enum = 0;
#[doc = "< Clamp to edge address mode"]
pub const CUaddress_mode_enum_CU_TR_ADDRESS_MODE_CLAMP: CUaddress_mode_enum = 1;
#[doc = "< Mirror address mode"]
pub const CUaddress_mode_enum_CU_TR_ADDRESS_MODE_MIRROR: CUaddress_mode_enum = 2;
#[doc = "< Border address mode"]
pub const CUaddress_mode_enum_CU_TR_ADDRESS_MODE_BORDER: CUaddress_mode_enum = 3;
#[doc = " Texture reference addressing modes"]
pub type CUaddress_mode_enum = ::std::os::raw::c_uint;
#[doc = " Texture reference addressing modes"]
pub use self::CUaddress_mode_enum as CUaddress_mode;
#[doc = "< Point filter mode"]
pub const CUfilter_mode_enum_CU_TR_FILTER_MODE_POINT: CUfilter_mode_enum = 0;
#[doc = "< Linear filter mode"]
pub const CUfilter_mode_enum_CU_TR_FILTER_MODE_LINEAR: CUfilter_mode_enum = 1;
#[doc = " Texture reference filtering modes"]
pub type CUfilter_mode_enum = ::std::os::raw::c_uint;
#[doc = " Texture reference filtering modes"]
pub use self::CUfilter_mode_enum as CUfilter_mode;
#[doc = "< Maximum number of threads per block"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_BLOCK:
    CUdevice_attribute_enum = 1;
#[doc = "< Maximum block dimension X"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_X: CUdevice_attribute_enum = 2;
#[doc = "< Maximum block dimension Y"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Y: CUdevice_attribute_enum = 3;
#[doc = "< Maximum block dimension Z"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_BLOCK_DIM_Z: CUdevice_attribute_enum = 4;
#[doc = "< Maximum grid dimension X"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_X: CUdevice_attribute_enum = 5;
#[doc = "< Maximum grid dimension Y"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Y: CUdevice_attribute_enum = 6;
#[doc = "< Maximum grid dimension Z"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_GRID_DIM_Z: CUdevice_attribute_enum = 7;
#[doc = "< Maximum shared memory available per block in bytes"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK:
    CUdevice_attribute_enum = 8;
#[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_SHARED_MEMORY_PER_BLOCK:
    CUdevice_attribute_enum = 8;
#[doc = "< Memory available on device for __constant__ variables in a CUDA C kernel in bytes"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_TOTAL_CONSTANT_MEMORY:
    CUdevice_attribute_enum = 9;
#[doc = "< Warp size in threads"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_WARP_SIZE: CUdevice_attribute_enum = 10;
#[doc = "< Maximum pitch in bytes allowed by memory copies"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_PITCH: CUdevice_attribute_enum = 11;
#[doc = "< Maximum number of 32-bit registers available per block"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_BLOCK:
    CUdevice_attribute_enum = 12;
#[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_BLOCK"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_REGISTERS_PER_BLOCK: CUdevice_attribute_enum =
    12;
#[doc = "< Typical clock frequency in kilohertz"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CLOCK_RATE: CUdevice_attribute_enum = 13;
#[doc = "< Alignment requirement for textures"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_TEXTURE_ALIGNMENT: CUdevice_attribute_enum =
    14;
#[doc = "< Device can possibly copy memory and execute a kernel concurrently. Deprecated. Use instead CU_DEVICE_ATTRIBUTE_ASYNC_ENGINE_COUNT."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_OVERLAP: CUdevice_attribute_enum = 15;
#[doc = "< Number of multiprocessors on device"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT:
    CUdevice_attribute_enum = 16;
#[doc = "< Specifies whether there is a run time limit on kernels"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_KERNEL_EXEC_TIMEOUT: CUdevice_attribute_enum =
    17;
#[doc = "< Device is integrated with host memory"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_INTEGRATED: CUdevice_attribute_enum = 18;
#[doc = "< Device can map host memory into CUDA address space"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_MAP_HOST_MEMORY: CUdevice_attribute_enum =
    19;
#[doc = "< Compute mode (See ::CUcomputemode for details)"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_COMPUTE_MODE: CUdevice_attribute_enum = 20;
#[doc = "< Maximum 1D texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_WIDTH:
    CUdevice_attribute_enum = 21;
#[doc = "< Maximum 2D texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_WIDTH:
    CUdevice_attribute_enum = 22;
#[doc = "< Maximum 2D texture height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_HEIGHT:
    CUdevice_attribute_enum = 23;
#[doc = "< Maximum 3D texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_WIDTH:
    CUdevice_attribute_enum = 24;
#[doc = "< Maximum 3D texture height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_HEIGHT:
    CUdevice_attribute_enum = 25;
#[doc = "< Maximum 3D texture depth"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_DEPTH:
    CUdevice_attribute_enum = 26;
#[doc = "< Maximum 2D layered texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_WIDTH:
    CUdevice_attribute_enum = 27;
#[doc = "< Maximum 2D layered texture height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_HEIGHT:
    CUdevice_attribute_enum = 28;
#[doc = "< Maximum layers in a 2D layered texture"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_LAYERS:
    CUdevice_attribute_enum = 29;
#[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_WIDTH"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_WIDTH:
    CUdevice_attribute_enum = 27;
#[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_HEIGHT"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_HEIGHT:
    CUdevice_attribute_enum = 28;
#[doc = "< Deprecated, use CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LAYERED_LAYERS"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_ARRAY_NUMSLICES:
    CUdevice_attribute_enum = 29;
#[doc = "< Alignment requirement for surfaces"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_SURFACE_ALIGNMENT: CUdevice_attribute_enum =
    30;
#[doc = "< Device can possibly execute multiple kernels concurrently"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CONCURRENT_KERNELS: CUdevice_attribute_enum =
    31;
#[doc = "< Device has ECC support enabled"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_ECC_ENABLED: CUdevice_attribute_enum = 32;
#[doc = "< PCI bus ID of the device"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_PCI_BUS_ID: CUdevice_attribute_enum = 33;
#[doc = "< PCI device ID of the device"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_PCI_DEVICE_ID: CUdevice_attribute_enum = 34;
#[doc = "< Device is using TCC driver model"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_TCC_DRIVER: CUdevice_attribute_enum = 35;
#[doc = "< Peak memory clock frequency in kilohertz"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MEMORY_CLOCK_RATE: CUdevice_attribute_enum =
    36;
#[doc = "< Global memory bus width in bits"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GLOBAL_MEMORY_BUS_WIDTH:
    CUdevice_attribute_enum = 37;
#[doc = "< Size of L2 cache in bytes"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_L2_CACHE_SIZE: CUdevice_attribute_enum = 38;
#[doc = "< Maximum resident threads per multiprocessor"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_THREADS_PER_MULTIPROCESSOR:
    CUdevice_attribute_enum = 39;
#[doc = "< Number of asynchronous engines"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_ASYNC_ENGINE_COUNT: CUdevice_attribute_enum =
    40;
#[doc = "< Device shares a unified address space with the host"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_UNIFIED_ADDRESSING: CUdevice_attribute_enum =
    41;
#[doc = "< Maximum 1D layered texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LAYERED_WIDTH:
    CUdevice_attribute_enum = 42;
#[doc = "< Maximum layers in a 1D layered texture"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LAYERED_LAYERS:
    CUdevice_attribute_enum = 43;
#[doc = "< Deprecated, do not use."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_TEX2D_GATHER: CUdevice_attribute_enum =
    44;
#[doc = "< Maximum 2D texture width if CUDA_ARRAY3D_TEXTURE_GATHER is set"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_GATHER_WIDTH:
    CUdevice_attribute_enum = 45;
#[doc = "< Maximum 2D texture height if CUDA_ARRAY3D_TEXTURE_GATHER is set"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_GATHER_HEIGHT:
    CUdevice_attribute_enum = 46;
#[doc = "< Alternate maximum 3D texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_WIDTH_ALTERNATE:
    CUdevice_attribute_enum = 47;
#[doc = "< Alternate maximum 3D texture height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_HEIGHT_ALTERNATE:
    CUdevice_attribute_enum = 48;
#[doc = "< Alternate maximum 3D texture depth"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE3D_DEPTH_ALTERNATE:
    CUdevice_attribute_enum = 49;
#[doc = "< PCI domain ID of the device"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_PCI_DOMAIN_ID: CUdevice_attribute_enum = 50;
#[doc = "< Pitch alignment requirement for textures"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_TEXTURE_PITCH_ALIGNMENT:
    CUdevice_attribute_enum = 51;
#[doc = "< Maximum cubemap texture width/height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_WIDTH:
    CUdevice_attribute_enum = 52;
#[doc = "< Maximum cubemap layered texture width/height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_LAYERED_WIDTH:
    CUdevice_attribute_enum = 53;
#[doc = "< Maximum layers in a cubemap layered texture"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURECUBEMAP_LAYERED_LAYERS:
    CUdevice_attribute_enum = 54;
#[doc = "< Maximum 1D surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_WIDTH:
    CUdevice_attribute_enum = 55;
#[doc = "< Maximum 2D surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_WIDTH:
    CUdevice_attribute_enum = 56;
#[doc = "< Maximum 2D surface height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_HEIGHT:
    CUdevice_attribute_enum = 57;
#[doc = "< Maximum 3D surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_WIDTH:
    CUdevice_attribute_enum = 58;
#[doc = "< Maximum 3D surface height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_HEIGHT:
    CUdevice_attribute_enum = 59;
#[doc = "< Maximum 3D surface depth"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE3D_DEPTH:
    CUdevice_attribute_enum = 60;
#[doc = "< Maximum 1D layered surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_LAYERED_WIDTH:
    CUdevice_attribute_enum = 61;
#[doc = "< Maximum layers in a 1D layered surface"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE1D_LAYERED_LAYERS:
    CUdevice_attribute_enum = 62;
#[doc = "< Maximum 2D layered surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_WIDTH:
    CUdevice_attribute_enum = 63;
#[doc = "< Maximum 2D layered surface height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_HEIGHT:
    CUdevice_attribute_enum = 64;
#[doc = "< Maximum layers in a 2D layered surface"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACE2D_LAYERED_LAYERS:
    CUdevice_attribute_enum = 65;
#[doc = "< Maximum cubemap surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_WIDTH:
    CUdevice_attribute_enum = 66;
#[doc = "< Maximum cubemap layered surface width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_LAYERED_WIDTH:
    CUdevice_attribute_enum = 67;
#[doc = "< Maximum layers in a cubemap layered surface"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_SURFACECUBEMAP_LAYERED_LAYERS:
    CUdevice_attribute_enum = 68;
#[doc = "< Deprecated, do not use. Use cudaDeviceGetTexture1DLinearMaxWidth() or cuDeviceGetTexture1DLinearMaxWidth() instead."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_LINEAR_WIDTH:
    CUdevice_attribute_enum = 69;
#[doc = "< Maximum 2D linear texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_WIDTH:
    CUdevice_attribute_enum = 70;
#[doc = "< Maximum 2D linear texture height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_HEIGHT:
    CUdevice_attribute_enum = 71;
#[doc = "< Maximum 2D linear texture pitch in bytes"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_LINEAR_PITCH:
    CUdevice_attribute_enum = 72;
#[doc = "< Maximum mipmapped 2D texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_MIPMAPPED_WIDTH:
    CUdevice_attribute_enum = 73;
#[doc = "< Maximum mipmapped 2D texture height"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE2D_MIPMAPPED_HEIGHT:
    CUdevice_attribute_enum = 74;
#[doc = "< Major compute capability version number"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MAJOR:
    CUdevice_attribute_enum = 75;
#[doc = "< Minor compute capability version number"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_COMPUTE_CAPABILITY_MINOR:
    CUdevice_attribute_enum = 76;
#[doc = "< Maximum mipmapped 1D texture width"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAXIMUM_TEXTURE1D_MIPMAPPED_WIDTH:
    CUdevice_attribute_enum = 77;
#[doc = "< Device supports stream priorities"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_STREAM_PRIORITIES_SUPPORTED:
    CUdevice_attribute_enum = 78;
#[doc = "< Device supports caching globals in L1"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GLOBAL_L1_CACHE_SUPPORTED:
    CUdevice_attribute_enum = 79;
#[doc = "< Device supports caching locals in L1"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_LOCAL_L1_CACHE_SUPPORTED:
    CUdevice_attribute_enum = 80;
#[doc = "< Maximum shared memory available per multiprocessor in bytes"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_MULTIPROCESSOR:
    CUdevice_attribute_enum = 81;
#[doc = "< Maximum number of 32-bit registers available per multiprocessor"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_REGISTERS_PER_MULTIPROCESSOR:
    CUdevice_attribute_enum = 82;
#[doc = "< Device can allocate managed memory on this system"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MANAGED_MEMORY: CUdevice_attribute_enum = 83;
#[doc = "< Device is on a multi-GPU board"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MULTI_GPU_BOARD: CUdevice_attribute_enum = 84;
#[doc = "< Unique id for a group of devices on the same multi-GPU board"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MULTI_GPU_BOARD_GROUP_ID:
    CUdevice_attribute_enum = 85;
#[doc = "< Link between the device and the host supports all native atomic operations"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_NATIVE_ATOMIC_SUPPORTED:
    CUdevice_attribute_enum = 86;
#[doc = "< Ratio of single precision performance (in floating-point operations per second) to double precision performance"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_SINGLE_TO_DOUBLE_PRECISION_PERF_RATIO:
    CUdevice_attribute_enum = 87;
#[doc = "< Device supports coherently accessing pageable memory without calling cudaHostRegister on it"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_PAGEABLE_MEMORY_ACCESS:
    CUdevice_attribute_enum = 88;
#[doc = "< Device can coherently access managed memory concurrently with the CPU"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CONCURRENT_MANAGED_ACCESS:
    CUdevice_attribute_enum = 89;
#[doc = "< Device supports compute preemption."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_COMPUTE_PREEMPTION_SUPPORTED:
    CUdevice_attribute_enum = 90;
#[doc = "< Device can access host registered memory at the same virtual address as the CPU"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_USE_HOST_POINTER_FOR_REGISTERED_MEM:
    CUdevice_attribute_enum = 91;
#[doc = "< Deprecated, along with v1 MemOps API, ::cuStreamBatchMemOp and related APIs are supported."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_MEM_OPS_V1:
    CUdevice_attribute_enum = 92;
#[doc = "< Deprecated, along with v1 MemOps API, 64-bit operations are supported in ::cuStreamBatchMemOp and related APIs."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_USE_64_BIT_STREAM_MEM_OPS_V1:
    CUdevice_attribute_enum = 93;
#[doc = "< Deprecated, along with v1 MemOps API, ::CU_STREAM_WAIT_VALUE_NOR is supported."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR_V1:
    CUdevice_attribute_enum = 94;
#[doc = "< Device supports launching cooperative kernels via ::cuLaunchCooperativeKernel"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_COOPERATIVE_LAUNCH: CUdevice_attribute_enum =
    95;
#[doc = "< Deprecated, ::cuLaunchCooperativeKernelMultiDevice is deprecated."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_COOPERATIVE_MULTI_DEVICE_LAUNCH:
    CUdevice_attribute_enum = 96;
#[doc = "< Maximum optin shared memory per block"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK_OPTIN:
    CUdevice_attribute_enum = 97;
#[doc = "< The ::CU_STREAM_WAIT_VALUE_FLUSH flag and the ::CU_STREAM_MEM_OP_FLUSH_REMOTE_WRITES MemOp are supported on the device. See \\ref CUDA_MEMOP for additional details."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_FLUSH_REMOTE_WRITES:
    CUdevice_attribute_enum = 98;
#[doc = "< Device supports host memory registration via ::cudaHostRegister."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_REGISTER_SUPPORTED:
    CUdevice_attribute_enum = 99;
#[doc = "< Device accesses pageable memory via the host's page tables."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_PAGEABLE_MEMORY_ACCESS_USES_HOST_PAGE_TABLES : CUdevice_attribute_enum = 100 ;
#[doc = "< The host can directly access managed memory on the device without migration."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_DIRECT_MANAGED_MEM_ACCESS_FROM_HOST:
    CUdevice_attribute_enum = 101;
#[doc = "< Deprecated, Use CU_DEVICE_ATTRIBUTE_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_VIRTUAL_ADDRESS_MANAGEMENT_SUPPORTED:
    CUdevice_attribute_enum = 102;
#[doc = "< Device supports virtual memory management APIs like ::cuMemAddressReserve, ::cuMemCreate, ::cuMemMap and related APIs"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED:
    CUdevice_attribute_enum = 102;
#[doc = "< Device supports exporting memory to a posix file descriptor with ::cuMemExportToShareableHandle, if requested via ::cuMemCreate"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_POSIX_FILE_DESCRIPTOR_SUPPORTED : CUdevice_attribute_enum = 103 ;
#[doc = "< Device supports exporting memory to a Win32 NT handle with ::cuMemExportToShareableHandle, if requested via ::cuMemCreate"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_WIN32_HANDLE_SUPPORTED:
    CUdevice_attribute_enum = 104;
#[doc = "< Device supports exporting memory to a Win32 KMT handle with ::cuMemExportToShareableHandle, if requested via ::cuMemCreate"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_WIN32_KMT_HANDLE_SUPPORTED:
    CUdevice_attribute_enum = 105;
#[doc = "< Maximum number of blocks per multiprocessor"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_BLOCKS_PER_MULTIPROCESSOR:
    CUdevice_attribute_enum = 106;
#[doc = "< Device supports compression of memory"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GENERIC_COMPRESSION_SUPPORTED:
    CUdevice_attribute_enum = 107;
#[doc = "< Maximum L2 persisting lines capacity setting in bytes."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_PERSISTING_L2_CACHE_SIZE:
    CUdevice_attribute_enum = 108;
#[doc = "< Maximum value of CUaccessPolicyWindow::num_bytes."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX_ACCESS_POLICY_WINDOW_SIZE:
    CUdevice_attribute_enum = 109;
#[doc = "< Device supports specifying the GPUDirect RDMA flag with ::cuMemCreate"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_WITH_CUDA_VMM_SUPPORTED:
    CUdevice_attribute_enum = 110;
#[doc = "< Shared memory reserved by CUDA driver per block in bytes"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_RESERVED_SHARED_MEMORY_PER_BLOCK:
    CUdevice_attribute_enum = 111;
#[doc = "< Device supports sparse CUDA arrays and sparse CUDA mipmapped arrays"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_SPARSE_CUDA_ARRAY_SUPPORTED:
    CUdevice_attribute_enum = 112;
#[doc = "< Device supports using the ::cuMemHostRegister flag ::CU_MEMHOSTERGISTER_READ_ONLY to register memory that must be mapped as read-only to the GPU"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_READ_ONLY_HOST_REGISTER_SUPPORTED:
    CUdevice_attribute_enum = 113;
#[doc = "< External timeline semaphore interop is supported on the device"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_TIMELINE_SEMAPHORE_INTEROP_SUPPORTED:
    CUdevice_attribute_enum = 114;
#[doc = "< Device supports using the ::cuMemAllocAsync and ::cuMemPool family of APIs"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MEMORY_POOLS_SUPPORTED:
    CUdevice_attribute_enum = 115;
#[doc = "< Device supports GPUDirect RDMA APIs, like nvidia_p2p_get_pages (see https://docs.nvidia.com/cuda/gpudirect-rdma for more information)"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_SUPPORTED:
    CUdevice_attribute_enum = 116;
#[doc = "< The returned attribute shall be interpreted as a bitmask, where the individual bits are described by the ::CUflushGPUDirectRDMAWritesOptions enum"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_FLUSH_WRITES_OPTIONS:
    CUdevice_attribute_enum = 117;
#[doc = "< GPUDirect RDMA writes to the device do not need to be flushed for consumers within the scope indicated by the returned attribute. See ::CUGPUDirectRDMAWritesOrdering for the numerical values returned here."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_DIRECT_RDMA_WRITES_ORDERING:
    CUdevice_attribute_enum = 118;
#[doc = "< Handle types supported with mempool based IPC"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MEMPOOL_SUPPORTED_HANDLE_TYPES:
    CUdevice_attribute_enum = 119;
#[doc = "< Indicates device supports cluster launch"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CLUSTER_LAUNCH: CUdevice_attribute_enum = 120;
#[doc = "< Device supports deferred mapping CUDA arrays and CUDA mipmapped arrays"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_DEFERRED_MAPPING_CUDA_ARRAY_SUPPORTED:
    CUdevice_attribute_enum = 121;
#[doc = "< 64-bit operations are supported in ::cuStreamBatchMemOp and related MemOp APIs."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_USE_64_BIT_STREAM_MEM_OPS:
    CUdevice_attribute_enum = 122;
#[doc = "< ::CU_STREAM_WAIT_VALUE_NOR is supported by MemOp APIs."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_CAN_USE_STREAM_WAIT_VALUE_NOR:
    CUdevice_attribute_enum = 123;
#[doc = "< Device supports buffer sharing with dma_buf mechanism."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_DMA_BUF_SUPPORTED: CUdevice_attribute_enum =
    124;
#[doc = "< Device supports IPC Events."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_IPC_EVENT_SUPPORTED: CUdevice_attribute_enum =
    125;
#[doc = "< Number of memory domains the device supports."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MEM_SYNC_DOMAIN_COUNT:
    CUdevice_attribute_enum = 126;
#[doc = "< Device supports accessing memory using Tensor Map."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_TENSOR_MAP_ACCESS_SUPPORTED:
    CUdevice_attribute_enum = 127;
#[doc = "< Device supports exporting memory to a fabric handle with cuMemExportToShareableHandle() or requested with cuMemCreate()"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HANDLE_TYPE_FABRIC_SUPPORTED:
    CUdevice_attribute_enum = 128;
#[doc = "< Device supports unified function pointers."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_UNIFIED_FUNCTION_POINTERS:
    CUdevice_attribute_enum = 129;
#[doc = "< NUMA configuration of a device: value is of type ::CUdeviceNumaConfig enum"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_NUMA_CONFIG: CUdevice_attribute_enum = 130;
#[doc = "< NUMA node ID of the GPU memory"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_NUMA_ID: CUdevice_attribute_enum = 131;
#[doc = "< Device supports switch multicast and reduction operations."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MULTICAST_SUPPORTED: CUdevice_attribute_enum =
    132;
#[doc = "< Indicates if contexts created on this device will be shared via MPS"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MPS_ENABLED: CUdevice_attribute_enum = 133;
#[doc = "< NUMA ID of the host node closest to the device. Returns -1 when system does not support NUMA."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_NUMA_ID: CUdevice_attribute_enum = 134;
#[doc = "< Device supports CIG with D3D12."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_D3D12_CIG_SUPPORTED: CUdevice_attribute_enum =
    135;
#[doc = "< The returned valued shall be interpreted as a bitmask, where the individual bits are described by the ::CUmemDecompressAlgorithm enum."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MEM_DECOMPRESS_ALGORITHM_MASK:
    CUdevice_attribute_enum = 136;
#[doc = "< The returned valued is the maximum length in bytes of a single decompress operation that is allowed."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MEM_DECOMPRESS_MAXIMUM_LENGTH:
    CUdevice_attribute_enum = 137;
#[doc = "< Device supports CIG with Vulkan."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_VULKAN_CIG_SUPPORTED:
    CUdevice_attribute_enum = 138;
#[doc = "< The combined 16-bit PCI device ID and 16-bit PCI vendor ID."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_PCI_DEVICE_ID: CUdevice_attribute_enum =
    139;
#[doc = "< The combined 16-bit PCI subsystem ID and 16-bit PCI subsystem vendor ID."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_GPU_PCI_SUBSYSTEM_ID:
    CUdevice_attribute_enum = 140;
#[doc = "< Device supports HOST_NUMA location with the virtual memory management APIs like ::cuMemCreate, ::cuMemMap and related APIs"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_NUMA_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED : CUdevice_attribute_enum = 141 ;
#[doc = "< Device supports HOST_NUMA location with the ::cuMemAllocAsync and ::cuMemPool family of APIs"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_NUMA_MEMORY_POOLS_SUPPORTED:
    CUdevice_attribute_enum = 142;
#[doc = "< Device supports HOST_NUMA location IPC between nodes in a multi-node system."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_NUMA_MULTINODE_IPC_SUPPORTED:
    CUdevice_attribute_enum = 143;
#[doc = "< Device suports HOST location with the ::cuMemAllocAsync and ::cuMemPool family of APIs"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_MEMORY_POOLS_SUPPORTED:
    CUdevice_attribute_enum = 144;
#[doc = "< Device supports HOST location with the virtual memory management APIs like ::cuMemCreate, ::cuMemMap and related APIs"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_VIRTUAL_MEMORY_MANAGEMENT_SUPPORTED:
    CUdevice_attribute_enum = 145;
#[doc = "< Device supports page-locked host memory buffer sharing with dma_buf mechanism."]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_HOST_ALLOC_DMA_BUF_SUPPORTED:
    CUdevice_attribute_enum = 146;
#[doc = "< Link between the device and the host supports only some native atomic operations"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_ONLY_PARTIAL_HOST_NATIVE_ATOMIC_SUPPORTED:
    CUdevice_attribute_enum = 147;
#[doc = "< Device supports atomic reduction operations in stream batch memory operations"]
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_ATOMIC_REDUCTION_SUPPORTED:
    CUdevice_attribute_enum = 148;
pub const CUdevice_attribute_enum_CU_DEVICE_ATTRIBUTE_MAX: CUdevice_attribute_enum = 149;
#[doc = " Device properties"]
pub type CUdevice_attribute_enum = ::std::os::raw::c_uint;
#[doc = " Device properties"]
pub use self::CUdevice_attribute_enum as CUdevice_attribute;
#[doc = " Legacy device properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUdevprop_st {
    #[doc = "< Maximum number of threads per block"]
    pub maxThreadsPerBlock: ::std::os::raw::c_int,
    #[doc = "< Maximum size of each dimension of a block"]
    pub maxThreadsDim: [::std::os::raw::c_int; 3usize],
    #[doc = "< Maximum size of each dimension of a grid"]
    pub maxGridSize: [::std::os::raw::c_int; 3usize],
    #[doc = "< Shared memory available per block in bytes"]
    pub sharedMemPerBlock: ::std::os::raw::c_int,
    #[doc = "< Constant memory available on device in bytes"]
    pub totalConstantMemory: ::std::os::raw::c_int,
    #[doc = "< Warp size in threads"]
    pub SIMDWidth: ::std::os::raw::c_int,
    #[doc = "< Maximum pitch in bytes allowed by memory copies"]
    pub memPitch: ::std::os::raw::c_int,
    #[doc = "< 32-bit registers available per block"]
    pub regsPerBlock: ::std::os::raw::c_int,
    #[doc = "< Clock frequency in kilohertz"]
    pub clockRate: ::std::os::raw::c_int,
    #[doc = "< Alignment requirement for textures"]
    pub textureAlign: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUdevprop_st"][::std::mem::size_of::<CUdevprop_st>() - 56usize];
    ["Alignment of CUdevprop_st"][::std::mem::align_of::<CUdevprop_st>() - 4usize];
    ["Offset of field: CUdevprop_st::maxThreadsPerBlock"]
        [::std::mem::offset_of!(CUdevprop_st, maxThreadsPerBlock) - 0usize];
    ["Offset of field: CUdevprop_st::maxThreadsDim"]
        [::std::mem::offset_of!(CUdevprop_st, maxThreadsDim) - 4usize];
    ["Offset of field: CUdevprop_st::maxGridSize"]
        [::std::mem::offset_of!(CUdevprop_st, maxGridSize) - 16usize];
    ["Offset of field: CUdevprop_st::sharedMemPerBlock"]
        [::std::mem::offset_of!(CUdevprop_st, sharedMemPerBlock) - 28usize];
    ["Offset of field: CUdevprop_st::totalConstantMemory"]
        [::std::mem::offset_of!(CUdevprop_st, totalConstantMemory) - 32usize];
    ["Offset of field: CUdevprop_st::SIMDWidth"]
        [::std::mem::offset_of!(CUdevprop_st, SIMDWidth) - 36usize];
    ["Offset of field: CUdevprop_st::memPitch"]
        [::std::mem::offset_of!(CUdevprop_st, memPitch) - 40usize];
    ["Offset of field: CUdevprop_st::regsPerBlock"]
        [::std::mem::offset_of!(CUdevprop_st, regsPerBlock) - 44usize];
    ["Offset of field: CUdevprop_st::clockRate"]
        [::std::mem::offset_of!(CUdevprop_st, clockRate) - 48usize];
    ["Offset of field: CUdevprop_st::textureAlign"]
        [::std::mem::offset_of!(CUdevprop_st, textureAlign) - 52usize];
};
#[doc = " Legacy device properties"]
pub type CUdevprop_v1 = CUdevprop_st;
#[doc = " Legacy device properties"]
pub type CUdevprop = CUdevprop_v1;
#[doc = "< The ::CUcontext on which a pointer was allocated or registered"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_CONTEXT: CUpointer_attribute_enum = 1;
#[doc = "< The ::CUmemorytype describing the physical location of a pointer"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_MEMORY_TYPE: CUpointer_attribute_enum = 2;
#[doc = "< The address at which a pointer's memory may be accessed on the device"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_DEVICE_POINTER: CUpointer_attribute_enum =
    3;
#[doc = "< The address at which a pointer's memory may be accessed on the host"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_HOST_POINTER: CUpointer_attribute_enum = 4;
#[doc = "< A pair of tokens for use with the nv-p2p.h Linux kernel interface"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_P2P_TOKENS: CUpointer_attribute_enum = 5;
#[doc = "< Synchronize every synchronous memory operation initiated on this region"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_SYNC_MEMOPS: CUpointer_attribute_enum = 6;
#[doc = "< A process-wide unique ID for an allocated memory region"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_BUFFER_ID: CUpointer_attribute_enum = 7;
#[doc = "< Indicates if the pointer points to managed memory"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_IS_MANAGED: CUpointer_attribute_enum = 8;
#[doc = "< A device ordinal of a device on which a pointer was allocated or registered"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_DEVICE_ORDINAL: CUpointer_attribute_enum =
    9;
#[doc = "< 1 if this pointer maps to an allocation that is suitable for ::cudaIpcGetMemHandle, 0 otherwise"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_IS_LEGACY_CUDA_IPC_CAPABLE:
    CUpointer_attribute_enum = 10;
#[doc = "< Starting address for this requested pointer"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_RANGE_START_ADDR: CUpointer_attribute_enum =
    11;
#[doc = "< Size of the address range for this requested pointer"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_RANGE_SIZE: CUpointer_attribute_enum = 12;
#[doc = "< 1 if this pointer is in a valid address range that is mapped to a backing allocation, 0 otherwise"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_MAPPED: CUpointer_attribute_enum = 13;
#[doc = "< Bitmask of allowed ::CUmemAllocationHandleType for this allocation"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_ALLOWED_HANDLE_TYPES:
    CUpointer_attribute_enum = 14;
#[doc = "< 1 if the memory this pointer is referencing can be used with the GPUDirect RDMA API"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_IS_GPU_DIRECT_RDMA_CAPABLE:
    CUpointer_attribute_enum = 15;
#[doc = "< Returns the access flags the device associated with the current context has on the corresponding memory referenced by the pointer given"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_ACCESS_FLAGS: CUpointer_attribute_enum = 16;
#[doc = "< Returns the mempool handle for the allocation if it was allocated from a mempool. Otherwise returns NULL."]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_MEMPOOL_HANDLE: CUpointer_attribute_enum =
    17;
#[doc = "< Size of the actual underlying mapping that the pointer belongs to"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_MAPPING_SIZE: CUpointer_attribute_enum = 18;
#[doc = "< The start address of the mapping that the pointer belongs to"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_MAPPING_BASE_ADDR:
    CUpointer_attribute_enum = 19;
#[doc = "< A process-wide unique id corresponding to the physical allocation the pointer belongs to"]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_MEMORY_BLOCK_ID: CUpointer_attribute_enum =
    20;
#[doc = "< Returns in \\p *data a boolean that indicates whether the pointer points to memory that is capable to be used for hardware accelerated decompression."]
pub const CUpointer_attribute_enum_CU_POINTER_ATTRIBUTE_IS_HW_DECOMPRESS_CAPABLE:
    CUpointer_attribute_enum = 21;
#[doc = " Pointer information"]
pub type CUpointer_attribute_enum = ::std::os::raw::c_uint;
#[doc = " Pointer information"]
pub use self::CUpointer_attribute_enum as CUpointer_attribute;
#[doc = " The maximum number of threads per block, beyond which a launch of the\n function would fail. This number depends on both the function and the\n device on which the function is currently loaded."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_MAX_THREADS_PER_BLOCK:
    CUfunction_attribute_enum = 0;
#[doc = " The size in bytes of statically-allocated shared memory required by\n this function. This does not include dynamically-allocated shared\n memory requested by the user at runtime."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_SHARED_SIZE_BYTES: CUfunction_attribute_enum =
    1;
#[doc = " The size in bytes of user-allocated constant memory required by this\n function."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_CONST_SIZE_BYTES: CUfunction_attribute_enum =
    2;
#[doc = " The size in bytes of local memory used by each thread of this function."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_LOCAL_SIZE_BYTES: CUfunction_attribute_enum =
    3;
#[doc = " The number of registers used by each thread of this function."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_NUM_REGS: CUfunction_attribute_enum = 4;
#[doc = " The PTX virtual architecture version for which the function was\n compiled. This value is the major PTX version * 10 + the minor PTX\n version, so a PTX version 1.3 function would return the value 13.\n Note that this may return the undefined value of 0 for cubins\n compiled prior to CUDA 3.0."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_PTX_VERSION: CUfunction_attribute_enum = 5;
#[doc = " The binary architecture version for which the function was compiled.\n This value is the major binary version * 10 + the minor binary version,\n so a binary version 1.3 function would return the value 13. Note that\n this will return a value of 10 for legacy cubins that do not have a\n properly-encoded binary architecture version."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_BINARY_VERSION: CUfunction_attribute_enum = 6;
#[doc = " The attribute to indicate whether the function has been compiled with\n user specified option \"-Xptxas --dlcm=ca\" set ."]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_CACHE_MODE_CA: CUfunction_attribute_enum = 7;
#[doc = " The maximum size in bytes of dynamically-allocated shared memory that can be used by\n this function. If the user-specified dynamic shared memory size is larger than this\n value, the launch will fail.\n The default value of this attribute is\n ::CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK - ::CU_FUNC_ATTRIBUTE_SHARED_SIZE_BYTES,\n except when ::CU_FUNC_ATTRIBUTE_SHARED_SIZE_BYTES is greater than\n ::CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK, then the default value of this attribute is 0.\n The value can be increased to ::CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK_OPTIN -\n ::CU_FUNC_ATTRIBUTE_SHARED_SIZE_BYTES.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_MAX_DYNAMIC_SHARED_SIZE_BYTES:
    CUfunction_attribute_enum = 8;
#[doc = " On devices where the L1 cache and shared memory use the same hardware resources,\n this sets the shared memory carveout preference, in percent of the total shared memory.\n Refer to ::CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_MULTIPROCESSOR.\n This is only a hint, and the driver can choose a different ratio if required to execute the function.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT:
    CUfunction_attribute_enum = 9;
#[doc = " If this attribute is set, the kernel must launch with a valid cluster\n size specified.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_CLUSTER_SIZE_MUST_BE_SET:
    CUfunction_attribute_enum = 10;
#[doc = " The required cluster width in blocks. The values must either all be 0 or\n all be positive. The validity of the cluster dimensions is otherwise\n checked at launch time.\n\n If the value is set during compile time, it cannot be set at runtime.\n Setting it at runtime will return CUDA_ERROR_NOT_PERMITTED.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_REQUIRED_CLUSTER_WIDTH:
    CUfunction_attribute_enum = 11;
#[doc = " The required cluster height in blocks. The values must either all be 0 or\n all be positive. The validity of the cluster dimensions is otherwise\n checked at launch time.\n\n If the value is set during compile time, it cannot be set at runtime.\n Setting it at runtime should return CUDA_ERROR_NOT_PERMITTED.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_REQUIRED_CLUSTER_HEIGHT:
    CUfunction_attribute_enum = 12;
#[doc = " The required cluster depth in blocks. The values must either all be 0 or\n all be positive. The validity of the cluster dimensions is otherwise\n checked at launch time.\n\n If the value is set during compile time, it cannot be set at runtime.\n Setting it at runtime should return CUDA_ERROR_NOT_PERMITTED.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_REQUIRED_CLUSTER_DEPTH:
    CUfunction_attribute_enum = 13;
#[doc = " Whether the function can be launched with non-portable cluster size. 1 is\n allowed, 0 is disallowed. A non-portable cluster size may only function\n on the specific SKUs the program is tested on. The launch might fail if\n the program is run on a different hardware platform.\n\n CUDA API provides cudaOccupancyMaxActiveClusters to assist with checking\n whether the desired size can be launched on the current device.\n\n Portable Cluster Size\n\n A portable cluster size is guaranteed to be functional on all compute\n capabilities higher than the target compute capability. The portable\n cluster size for sm_90 is 8 blocks per cluster. This value may increase\n for future compute capabilities.\n\n The specific hardware unit may support higher cluster sizes that’s not\n guaranteed to be portable.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_NON_PORTABLE_CLUSTER_SIZE_ALLOWED:
    CUfunction_attribute_enum = 14;
#[doc = " The block scheduling policy of a function. The value type is\n CUclusterSchedulingPolicy / cudaClusterSchedulingPolicy.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_CLUSTER_SCHEDULING_POLICY_PREFERENCE:
    CUfunction_attribute_enum = 15;
#[doc = " The block scheduling policy of a function. The value type is\n CUclusterSchedulingPolicy / cudaClusterSchedulingPolicy.\n See ::cuFuncSetAttribute, ::cuKernelSetAttribute"]
pub const CUfunction_attribute_enum_CU_FUNC_ATTRIBUTE_MAX: CUfunction_attribute_enum = 16;
#[doc = " Function properties"]
pub type CUfunction_attribute_enum = ::std::os::raw::c_uint;
#[doc = " Function properties"]
pub use self::CUfunction_attribute_enum as CUfunction_attribute;
#[doc = "< no preference for shared memory or L1 (default)"]
pub const CUfunc_cache_enum_CU_FUNC_CACHE_PREFER_NONE: CUfunc_cache_enum = 0;
#[doc = "< prefer larger shared memory and smaller L1 cache"]
pub const CUfunc_cache_enum_CU_FUNC_CACHE_PREFER_SHARED: CUfunc_cache_enum = 1;
#[doc = "< prefer larger L1 cache and smaller shared memory"]
pub const CUfunc_cache_enum_CU_FUNC_CACHE_PREFER_L1: CUfunc_cache_enum = 2;
#[doc = "< prefer equal sized L1 cache and shared memory"]
pub const CUfunc_cache_enum_CU_FUNC_CACHE_PREFER_EQUAL: CUfunc_cache_enum = 3;
#[doc = " Function cache configurations"]
pub type CUfunc_cache_enum = ::std::os::raw::c_uint;
#[doc = " Function cache configurations"]
pub use self::CUfunc_cache_enum as CUfunc_cache;
#[doc = "< set default shared memory bank size"]
pub const CUsharedconfig_enum_CU_SHARED_MEM_CONFIG_DEFAULT_BANK_SIZE: CUsharedconfig_enum = 0;
#[doc = "< set shared memory bank width to four bytes"]
pub const CUsharedconfig_enum_CU_SHARED_MEM_CONFIG_FOUR_BYTE_BANK_SIZE: CUsharedconfig_enum = 1;
#[doc = "< set shared memory bank width to eight bytes"]
pub const CUsharedconfig_enum_CU_SHARED_MEM_CONFIG_EIGHT_BYTE_BANK_SIZE: CUsharedconfig_enum = 2;
#[doc = " \\deprecated\n\n Shared memory configurations"]
pub type CUsharedconfig_enum = ::std::os::raw::c_uint;
#[doc = " \\deprecated\n\n Shared memory configurations"]
pub use self::CUsharedconfig_enum as CUsharedconfig;
#[doc = "< No preference for shared memory or L1 (default)"]
pub const CUshared_carveout_enum_CU_SHAREDMEM_CARVEOUT_DEFAULT: CUshared_carveout_enum = -1;
#[doc = "< Prefer maximum available shared memory, minimum L1 cache"]
pub const CUshared_carveout_enum_CU_SHAREDMEM_CARVEOUT_MAX_SHARED: CUshared_carveout_enum = 100;
#[doc = "< Prefer maximum available L1 cache, minimum shared memory"]
pub const CUshared_carveout_enum_CU_SHAREDMEM_CARVEOUT_MAX_L1: CUshared_carveout_enum = 0;
#[doc = " Shared memory carveout configurations. These may be passed to ::cuFuncSetAttribute or ::cuKernelSetAttribute"]
pub type CUshared_carveout_enum = ::std::os::raw::c_int;
#[doc = " Shared memory carveout configurations. These may be passed to ::cuFuncSetAttribute or ::cuKernelSetAttribute"]
pub use self::CUshared_carveout_enum as CUshared_carveout;
#[doc = "< Host memory"]
pub const CUmemorytype_enum_CU_MEMORYTYPE_HOST: CUmemorytype_enum = 1;
#[doc = "< Device memory"]
pub const CUmemorytype_enum_CU_MEMORYTYPE_DEVICE: CUmemorytype_enum = 2;
#[doc = "< Array memory"]
pub const CUmemorytype_enum_CU_MEMORYTYPE_ARRAY: CUmemorytype_enum = 3;
#[doc = "< Unified device or host memory"]
pub const CUmemorytype_enum_CU_MEMORYTYPE_UNIFIED: CUmemorytype_enum = 4;
#[doc = " Memory types"]
pub type CUmemorytype_enum = ::std::os::raw::c_uint;
#[doc = " Memory types"]
pub use self::CUmemorytype_enum as CUmemorytype;
#[doc = "< Default compute mode (Multiple contexts allowed per device)"]
pub const CUcomputemode_enum_CU_COMPUTEMODE_DEFAULT: CUcomputemode_enum = 0;
#[doc = "< Compute-prohibited mode (No contexts can be created on this device at this time)"]
pub const CUcomputemode_enum_CU_COMPUTEMODE_PROHIBITED: CUcomputemode_enum = 2;
#[doc = "< Compute-exclusive-process mode (Only one context used by a single process can be present on this device at a time)"]
pub const CUcomputemode_enum_CU_COMPUTEMODE_EXCLUSIVE_PROCESS: CUcomputemode_enum = 3;
#[doc = " Compute Modes"]
pub type CUcomputemode_enum = ::std::os::raw::c_uint;
#[doc = " Compute Modes"]
pub use self::CUcomputemode_enum as CUcomputemode;
#[doc = "< Data will mostly be read and only occasionally be written to"]
pub const CUmem_advise_enum_CU_MEM_ADVISE_SET_READ_MOSTLY: CUmem_advise_enum = 1;
#[doc = "< Undo the effect of ::CU_MEM_ADVISE_SET_READ_MOSTLY"]
pub const CUmem_advise_enum_CU_MEM_ADVISE_UNSET_READ_MOSTLY: CUmem_advise_enum = 2;
#[doc = "< Set the preferred location for the data as the specified device"]
pub const CUmem_advise_enum_CU_MEM_ADVISE_SET_PREFERRED_LOCATION: CUmem_advise_enum = 3;
#[doc = "< Clear the preferred location for the data"]
pub const CUmem_advise_enum_CU_MEM_ADVISE_UNSET_PREFERRED_LOCATION: CUmem_advise_enum = 4;
#[doc = "< Data will be accessed by the specified device, so prevent page faults as much as possible"]
pub const CUmem_advise_enum_CU_MEM_ADVISE_SET_ACCESSED_BY: CUmem_advise_enum = 5;
#[doc = "< Let the Unified Memory subsystem decide on the page faulting policy for the specified device"]
pub const CUmem_advise_enum_CU_MEM_ADVISE_UNSET_ACCESSED_BY: CUmem_advise_enum = 6;
#[doc = " Memory advise values"]
pub type CUmem_advise_enum = ::std::os::raw::c_uint;
#[doc = " Memory advise values"]
pub use self::CUmem_advise_enum as CUmem_advise;
#[doc = "< Whether the range will mostly be read and only occasionally be written to"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_READ_MOSTLY:
    CUmem_range_attribute_enum = 1;
#[doc = "< The preferred location of the range"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_PREFERRED_LOCATION:
    CUmem_range_attribute_enum = 2;
#[doc = "< Memory range has ::CU_MEM_ADVISE_SET_ACCESSED_BY set for specified device"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_ACCESSED_BY:
    CUmem_range_attribute_enum = 3;
#[doc = "< The last location to which the range was prefetched"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_LAST_PREFETCH_LOCATION:
    CUmem_range_attribute_enum = 4;
#[doc = "< The preferred location type of the range"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_PREFERRED_LOCATION_TYPE:
    CUmem_range_attribute_enum = 5;
#[doc = "< The preferred location id of the range"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_PREFERRED_LOCATION_ID:
    CUmem_range_attribute_enum = 6;
#[doc = "< The last location type to which the range was prefetched"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_LAST_PREFETCH_LOCATION_TYPE:
    CUmem_range_attribute_enum = 7;
#[doc = "< The last location id to which the range was prefetched"]
pub const CUmem_range_attribute_enum_CU_MEM_RANGE_ATTRIBUTE_LAST_PREFETCH_LOCATION_ID:
    CUmem_range_attribute_enum = 8;
pub type CUmem_range_attribute_enum = ::std::os::raw::c_uint;
pub use self::CUmem_range_attribute_enum as CUmem_range_attribute;
#[doc = " Max number of registers that a thread may use.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_MAX_REGISTERS: CUjit_option_enum = 0;
#[doc = " IN: Specifies minimum number of threads per block to target compilation\n for\\n\n OUT: Returns the number of threads the compiler actually targeted.\n This restricts the resource utilization of the compiler (e.g. max\n registers) such that a block with the given number of threads should be\n able to launch based on register limitations. Note, this option does not\n currently take into account any other resource limitations, such as\n shared memory utilization.\\n\n Cannot be combined with ::CU_JIT_TARGET.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_THREADS_PER_BLOCK: CUjit_option_enum = 1;
#[doc = " Overwrites the option value with the total wall clock time, in\n milliseconds, spent in the compiler and linker\\n\n Option type: float\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_WALL_TIME: CUjit_option_enum = 2;
#[doc = " Pointer to a buffer in which to print any log messages\n that are informational in nature (the buffer size is specified via\n option ::CU_JIT_INFO_LOG_BUFFER_SIZE_BYTES)\\n\n Option type: char *\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_INFO_LOG_BUFFER: CUjit_option_enum = 3;
#[doc = " IN: Log buffer size in bytes.  Log messages will be capped at this size\n (including null terminator)\\n\n OUT: Amount of log buffer filled with messages\\n\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_INFO_LOG_BUFFER_SIZE_BYTES: CUjit_option_enum = 4;
#[doc = " Pointer to a buffer in which to print any log messages that\n reflect errors (the buffer size is specified via option\n ::CU_JIT_ERROR_LOG_BUFFER_SIZE_BYTES)\\n\n Option type: char *\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_ERROR_LOG_BUFFER: CUjit_option_enum = 5;
#[doc = " IN: Log buffer size in bytes.  Log messages will be capped at this size\n (including null terminator)\\n\n OUT: Amount of log buffer filled with messages\\n\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_ERROR_LOG_BUFFER_SIZE_BYTES: CUjit_option_enum = 6;
#[doc = " Level of optimizations to apply to generated code (0 - 4), with 4\n being the default and highest level of optimizations.\\n\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_OPTIMIZATION_LEVEL: CUjit_option_enum = 7;
#[doc = " No option value required. Determines the target based on the current\n attached context (default)\\n\n Option type: No option value needed\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_TARGET_FROM_CUCONTEXT: CUjit_option_enum = 8;
#[doc = " Target is chosen based on supplied ::CUjit_target.  Cannot be\n combined with ::CU_JIT_THREADS_PER_BLOCK.\\n\n Option type: unsigned int for enumerated type ::CUjit_target\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_TARGET: CUjit_option_enum = 9;
#[doc = " Specifies choice of fallback strategy if matching cubin is not found.\n Choice is based on supplied ::CUjit_fallback.  This option cannot be\n used with cuLink* APIs as the linker requires exact matches.\\n\n Option type: unsigned int for enumerated type ::CUjit_fallback\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_FALLBACK_STRATEGY: CUjit_option_enum = 10;
#[doc = " Specifies whether to create debug information in output (-g)\n (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_GENERATE_DEBUG_INFO: CUjit_option_enum = 11;
#[doc = " Generate verbose log messages (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_LOG_VERBOSE: CUjit_option_enum = 12;
#[doc = " Generate line number information (-lineinfo) (0: false, default)\\n\n Option type: int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_GENERATE_LINE_INFO: CUjit_option_enum = 13;
#[doc = " Specifies whether to enable caching explicitly (-dlcm) \\n\n Choice is based on supplied ::CUjit_cacheMode_enum.\\n\n Option type: unsigned int for enumerated type ::CUjit_cacheMode_enum\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_CACHE_MODE: CUjit_option_enum = 14;
#[doc = " \\deprecated\n This jit option is deprecated and should not be used."]
pub const CUjit_option_enum_CU_JIT_NEW_SM3X_OPT: CUjit_option_enum = 15;
#[doc = " This jit option is used for internal purpose only."]
pub const CUjit_option_enum_CU_JIT_FAST_COMPILE: CUjit_option_enum = 16;
#[doc = " Array of device symbol names that will be relocated to the corresponding\n host addresses stored in ::CU_JIT_GLOBAL_SYMBOL_ADDRESSES.\\n\n Must contain ::CU_JIT_GLOBAL_SYMBOL_COUNT entries.\\n\n When loading a device module, driver will relocate all encountered\n unresolved symbols to the host addresses.\\n\n It is only allowed to register symbols that correspond to unresolved\n global variables.\\n\n It is illegal to register the same device symbol at multiple addresses.\\n\n Option type: const char **\\n\n Applies to: dynamic linker only"]
pub const CUjit_option_enum_CU_JIT_GLOBAL_SYMBOL_NAMES: CUjit_option_enum = 17;
#[doc = " Array of host addresses that will be used to relocate corresponding\n device symbols stored in ::CU_JIT_GLOBAL_SYMBOL_NAMES.\\n\n Must contain ::CU_JIT_GLOBAL_SYMBOL_COUNT entries.\\n\n Option type: void **\\n\n Applies to: dynamic linker only"]
pub const CUjit_option_enum_CU_JIT_GLOBAL_SYMBOL_ADDRESSES: CUjit_option_enum = 18;
#[doc = " Number of entries in ::CU_JIT_GLOBAL_SYMBOL_NAMES and\n ::CU_JIT_GLOBAL_SYMBOL_ADDRESSES arrays.\\n\n Option type: unsigned int\\n\n Applies to: dynamic linker only"]
pub const CUjit_option_enum_CU_JIT_GLOBAL_SYMBOL_COUNT: CUjit_option_enum = 19;
#[doc = " \\deprecated\n Enable link-time optimization (-dlto) for device code (Disabled by default).\\n\n This option is not supported on 32-bit platforms.\\n\n Option type: int\\n\n Applies to: compiler and linker\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_LTO: CUjit_option_enum = 20;
#[doc = " \\deprecated\n Control single-precision denormals (-ftz) support (0: false, default).\n 1 : flushes denormal values to zero\n 0 : preserves denormal values\n Option type: int\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_FTZ: CUjit_option_enum = 21;
#[doc = " \\deprecated\n Control single-precision floating-point division and reciprocals\n (-prec-div) support (1: true, default).\n 1 : Enables the IEEE round-to-nearest mode\n 0 : Enables the fast approximation mode\n Option type: int\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_PREC_DIV: CUjit_option_enum = 22;
#[doc = " \\deprecated\n Control single-precision floating-point square root\n (-prec-sqrt) support (1: true, default).\n 1 : Enables the IEEE round-to-nearest mode\n 0 : Enables the fast approximation mode\n Option type: int\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_PREC_SQRT: CUjit_option_enum = 23;
#[doc = " \\deprecated\n Enable/Disable the contraction of floating-point multiplies\n and adds/subtracts into floating-point multiply-add (-fma)\n operations (1: Enable, default; 0: Disable).\n Option type: int\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_FMA: CUjit_option_enum = 24;
#[doc = " \\deprecated\n Array of kernel names that should be preserved at link time while others\n can be removed.\\n\n Must contain ::CU_JIT_REFERENCED_KERNEL_COUNT entries.\\n\n Note that kernel names can be mangled by the compiler in which case the\n mangled name needs to be specified.\\n\n Wildcard \"*\" can be used to represent zero or more characters instead of\n specifying the full or mangled name.\\n\n It is important to note that the wildcard \"*\" is also added implicitly.\n For example, specifying \"foo\" will match \"foobaz\", \"barfoo\", \"barfoobaz\" and\n thus preserve all kernels with those names. This can be avoided by providing\n a more specific name like \"barfoobaz\".\\n\n Option type: const char **\\n\n Applies to: dynamic linker only\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_REFERENCED_KERNEL_NAMES: CUjit_option_enum = 25;
#[doc = " \\deprecated\n Number of entries in ::CU_JIT_REFERENCED_KERNEL_NAMES array.\\n\n Option type: unsigned int\\n\n Applies to: dynamic linker only\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_REFERENCED_KERNEL_COUNT: CUjit_option_enum = 26;
#[doc = " \\deprecated\n Array of variable names (__device__ and/or __constant__) that should be\n preserved at link time while others can be removed.\\n\n Must contain ::CU_JIT_REFERENCED_VARIABLE_COUNT entries.\\n\n Note that variable names can be mangled by the compiler in which case the\n mangled name needs to be specified.\\n\n Wildcard \"*\" can be used to represent zero or more characters instead of\n specifying the full or mangled name.\\n\n It is important to note that the wildcard \"*\" is also added implicitly.\n For example, specifying \"foo\" will match \"foobaz\", \"barfoo\", \"barfoobaz\" and\n thus preserve all variables with those names. This can be avoided by providing\n a more specific name like \"barfoobaz\".\\n\n Option type: const char **\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_REFERENCED_VARIABLE_NAMES: CUjit_option_enum = 27;
#[doc = " \\deprecated\n Number of entries in ::CU_JIT_REFERENCED_VARIABLE_NAMES array.\\n\n Option type: unsigned int\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_REFERENCED_VARIABLE_COUNT: CUjit_option_enum = 28;
#[doc = " \\deprecated\n This option serves as a hint to enable the JIT compiler/linker\n to remove constant (__constant__) and device (__device__) variables\n unreferenced in device code (Disabled by default).\\n\n Note that host references to constant and device variables using APIs like\n ::cuModuleGetGlobal() with this option specified may result in undefined behavior unless\n the variables are explicitly specified using ::CU_JIT_REFERENCED_VARIABLE_NAMES.\\n\n Option type: int\\n\n Applies to: link-time optimization specified with CU_JIT_LTO\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjit_option_enum_CU_JIT_OPTIMIZE_UNUSED_DEVICE_VARIABLES: CUjit_option_enum = 29;
#[doc = " Generate position independent code (0: false)\\n\n Option type: int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_POSITION_INDEPENDENT_CODE: CUjit_option_enum = 30;
#[doc = " This option hints to the JIT compiler the minimum number of CTAs from the\n kernel’s grid to be mapped to a SM. This option is ignored when used together\n with ::CU_JIT_MAX_REGISTERS or ::CU_JIT_THREADS_PER_BLOCK.\n Optimizations based on this option need ::CU_JIT_MAX_THREADS_PER_BLOCK to\n be specified as well. For kernels already using PTX directive .minnctapersm,\n this option will be ignored by default. Use ::CU_JIT_OVERRIDE_DIRECTIVE_VALUES\n to let this option take precedence over the PTX directive.\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_MIN_CTA_PER_SM: CUjit_option_enum = 31;
#[doc = " Maximum number threads in a thread block, computed as the product of\n the maximum extent specifed for each dimension of the block. This limit\n is guaranteed not to be exeeded in any invocation of the kernel. Exceeding\n the the maximum number of threads results in runtime error or kernel launch\n failure. For kernels already using PTX directive .maxntid, this option will\n be ignored by default. Use ::CU_JIT_OVERRIDE_DIRECTIVE_VALUES to let this\n option take precedence over the PTX directive.\n Option type: int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_MAX_THREADS_PER_BLOCK: CUjit_option_enum = 32;
#[doc = " This option lets the values specified using ::CU_JIT_MAX_REGISTERS,\n ::CU_JIT_THREADS_PER_BLOCK, ::CU_JIT_MAX_THREADS_PER_BLOCK and\n ::CU_JIT_MIN_CTA_PER_SM take precedence over any PTX directives.\n (0: Disable, default; 1: Enable)\n Option type: int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_OVERRIDE_DIRECTIVE_VALUES: CUjit_option_enum = 33;
#[doc = " This option specifies the maximum number of concurrent threads to use\n when running compiler optimizations. If the specified value is 1, the\n option will be ignored. If the specified value is 0, the number of\n threads will match the number of CPUs on the underlying machine.\n Otherwise, if the option is N, then up to N threads will be used.\n Option type: unsigned int\\n\n Applies to: compiler only"]
pub const CUjit_option_enum_CU_JIT_SPLIT_COMPILE: CUjit_option_enum = 34;
#[doc = " This option specifies the maximum number of concurrent threads to use\n when compiling device code. If the specified value is 1, the option will\n be ignored. If the specified value is 0, the number of threads will match\n the number of CPUs on the underlying machine. Otherwise, if the option is\n N, then up to N threads will be used.\n This option is ignored if the env var CUDA_BINARY_LOADER_THREAD_COUNT is set.\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_BINARY_LOADER_THREAD_COUNT: CUjit_option_enum = 35;
#[doc = " This option specifies the maximum number of concurrent threads to use\n when compiling device code. If the specified value is 1, the option will\n be ignored. If the specified value is 0, the number of threads will match\n the number of CPUs on the underlying machine. Otherwise, if the option is\n N, then up to N threads will be used.\n This option is ignored if the env var CUDA_BINARY_LOADER_THREAD_COUNT is set.\n Option type: unsigned int\\n\n Applies to: compiler and linker"]
pub const CUjit_option_enum_CU_JIT_NUM_OPTIONS: CUjit_option_enum = 36;
#[doc = " Online compiler and linker options"]
pub type CUjit_option_enum = ::std::os::raw::c_uint;
#[doc = " Online compiler and linker options"]
pub use self::CUjit_option_enum as CUjit_option;
#[doc = "< Compute device class 3.0"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_30: CUjit_target_enum = 30;
#[doc = "< Compute device class 3.2"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_32: CUjit_target_enum = 32;
#[doc = "< Compute device class 3.5"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_35: CUjit_target_enum = 35;
#[doc = "< Compute device class 3.7"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_37: CUjit_target_enum = 37;
#[doc = "< Compute device class 5.0"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_50: CUjit_target_enum = 50;
#[doc = "< Compute device class 5.2"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_52: CUjit_target_enum = 52;
#[doc = "< Compute device class 5.3"]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_53: CUjit_target_enum = 53;
#[doc = "< Compute device class 6.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_60: CUjit_target_enum = 60;
#[doc = "< Compute device class 6.1."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_61: CUjit_target_enum = 61;
#[doc = "< Compute device class 6.2."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_62: CUjit_target_enum = 62;
#[doc = "< Compute device class 7.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_70: CUjit_target_enum = 70;
#[doc = "< Compute device class 7.2."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_72: CUjit_target_enum = 72;
#[doc = "< Compute device class 7.5."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_75: CUjit_target_enum = 75;
#[doc = "< Compute device class 8.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_80: CUjit_target_enum = 80;
#[doc = "< Compute device class 8.6."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_86: CUjit_target_enum = 86;
#[doc = "< Compute device class 8.7."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_87: CUjit_target_enum = 87;
#[doc = "< Compute device class 8.9."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_89: CUjit_target_enum = 89;
#[doc = "< Compute device class 9.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_90: CUjit_target_enum = 90;
#[doc = "< Compute device class 10.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_100: CUjit_target_enum = 100;
#[doc = "< Compute device class 11.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_110: CUjit_target_enum = 110;
#[doc = "< Compute device class 10.3."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_103: CUjit_target_enum = 103;
#[doc = "< Compute device class 12.0."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_120: CUjit_target_enum = 120;
#[doc = "< Compute device class 12.1."]
pub const CUjit_target_enum_CU_TARGET_COMPUTE_121: CUjit_target_enum = 121;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_90A: CUjit_target_enum = 65626;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_100A: CUjit_target_enum = 65636;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_110A: CUjit_target_enum = 65646;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_103A: CUjit_target_enum = 65639;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_120A: CUjit_target_enum = 65656;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_121A: CUjit_target_enum = 65657;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_100F: CUjit_target_enum = 131172;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_110F: CUjit_target_enum = 131182;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_103F: CUjit_target_enum = 131175;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_120F: CUjit_target_enum = 131192;
pub const CUjit_target_enum_CU_TARGET_COMPUTE_121F: CUjit_target_enum = 131193;
#[doc = " Online compilation targets"]
pub type CUjit_target_enum = ::std::os::raw::c_uint;
#[doc = " Online compilation targets"]
pub use self::CUjit_target_enum as CUjit_target;
#[doc = "< Prefer to compile ptx if exact binary match not found"]
pub const CUjit_fallback_enum_CU_PREFER_PTX: CUjit_fallback_enum = 0;
#[doc = "< Prefer to fall back to compatible binary code if exact match not found"]
pub const CUjit_fallback_enum_CU_PREFER_BINARY: CUjit_fallback_enum = 1;
#[doc = " Cubin matching fallback strategies"]
pub type CUjit_fallback_enum = ::std::os::raw::c_uint;
#[doc = " Cubin matching fallback strategies"]
pub use self::CUjit_fallback_enum as CUjit_fallback;
#[doc = "< Compile with no -dlcm flag specified"]
pub const CUjit_cacheMode_enum_CU_JIT_CACHE_OPTION_NONE: CUjit_cacheMode_enum = 0;
#[doc = "< Compile with L1 cache disabled"]
pub const CUjit_cacheMode_enum_CU_JIT_CACHE_OPTION_CG: CUjit_cacheMode_enum = 1;
#[doc = "< Compile with L1 cache enabled"]
pub const CUjit_cacheMode_enum_CU_JIT_CACHE_OPTION_CA: CUjit_cacheMode_enum = 2;
#[doc = " Caching modes for dlcm"]
pub type CUjit_cacheMode_enum = ::std::os::raw::c_uint;
#[doc = " Caching modes for dlcm"]
pub use self::CUjit_cacheMode_enum as CUjit_cacheMode;
#[doc = " Compiled device-class-specific device code\\n\n Applicable options: none"]
pub const CUjitInputType_enum_CU_JIT_INPUT_CUBIN: CUjitInputType_enum = 0;
#[doc = " PTX source code\\n\n Applicable options: PTX compiler options"]
pub const CUjitInputType_enum_CU_JIT_INPUT_PTX: CUjitInputType_enum = 1;
#[doc = " Bundle of multiple cubins and/or PTX of some device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
pub const CUjitInputType_enum_CU_JIT_INPUT_FATBINARY: CUjitInputType_enum = 2;
#[doc = " Host object with embedded device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
pub const CUjitInputType_enum_CU_JIT_INPUT_OBJECT: CUjitInputType_enum = 3;
#[doc = " Archive of host objects with embedded device code\\n\n Applicable options: PTX compiler options, ::CU_JIT_FALLBACK_STRATEGY"]
pub const CUjitInputType_enum_CU_JIT_INPUT_LIBRARY: CUjitInputType_enum = 4;
#[doc = " \\deprecated\n High-level intermediate code for link-time optimization\\n\n Applicable options: NVVM compiler options, PTX compiler options\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjitInputType_enum_CU_JIT_INPUT_NVVM: CUjitInputType_enum = 5;
#[doc = " \\deprecated\n High-level intermediate code for link-time optimization\\n\n Applicable options: NVVM compiler options, PTX compiler options\n\n Only valid with LTO-IR compiled with toolkits prior to CUDA 12.0"]
pub const CUjitInputType_enum_CU_JIT_NUM_INPUT_TYPES: CUjitInputType_enum = 6;
#[doc = " Device code formats"]
pub type CUjitInputType_enum = ::std::os::raw::c_uint;
#[doc = " Device code formats"]
pub use self::CUjitInputType_enum as CUjitInputType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlinkState_st {
    _unused: [u8; 0],
}
pub type CUlinkState = *mut CUlinkState_st;
pub const CUgraphicsRegisterFlags_enum_CU_GRAPHICS_REGISTER_FLAGS_NONE:
    CUgraphicsRegisterFlags_enum = 0;
pub const CUgraphicsRegisterFlags_enum_CU_GRAPHICS_REGISTER_FLAGS_READ_ONLY:
    CUgraphicsRegisterFlags_enum = 1;
pub const CUgraphicsRegisterFlags_enum_CU_GRAPHICS_REGISTER_FLAGS_WRITE_DISCARD:
    CUgraphicsRegisterFlags_enum = 2;
pub const CUgraphicsRegisterFlags_enum_CU_GRAPHICS_REGISTER_FLAGS_SURFACE_LDST:
    CUgraphicsRegisterFlags_enum = 4;
pub const CUgraphicsRegisterFlags_enum_CU_GRAPHICS_REGISTER_FLAGS_TEXTURE_GATHER:
    CUgraphicsRegisterFlags_enum = 8;
#[doc = " Flags to register a graphics resource"]
pub type CUgraphicsRegisterFlags_enum = ::std::os::raw::c_uint;
#[doc = " Flags to register a graphics resource"]
pub use self::CUgraphicsRegisterFlags_enum as CUgraphicsRegisterFlags;
pub const CUgraphicsMapResourceFlags_enum_CU_GRAPHICS_MAP_RESOURCE_FLAGS_NONE:
    CUgraphicsMapResourceFlags_enum = 0;
pub const CUgraphicsMapResourceFlags_enum_CU_GRAPHICS_MAP_RESOURCE_FLAGS_READ_ONLY:
    CUgraphicsMapResourceFlags_enum = 1;
pub const CUgraphicsMapResourceFlags_enum_CU_GRAPHICS_MAP_RESOURCE_FLAGS_WRITE_DISCARD:
    CUgraphicsMapResourceFlags_enum = 2;
#[doc = " Flags for mapping and unmapping interop resources"]
pub type CUgraphicsMapResourceFlags_enum = ::std::os::raw::c_uint;
#[doc = " Flags for mapping and unmapping interop resources"]
pub use self::CUgraphicsMapResourceFlags_enum as CUgraphicsMapResourceFlags;
#[doc = "< Positive X face of cubemap"]
pub const CUarray_cubemap_face_enum_CU_CUBEMAP_FACE_POSITIVE_X: CUarray_cubemap_face_enum = 0;
#[doc = "< Negative X face of cubemap"]
pub const CUarray_cubemap_face_enum_CU_CUBEMAP_FACE_NEGATIVE_X: CUarray_cubemap_face_enum = 1;
#[doc = "< Positive Y face of cubemap"]
pub const CUarray_cubemap_face_enum_CU_CUBEMAP_FACE_POSITIVE_Y: CUarray_cubemap_face_enum = 2;
#[doc = "< Negative Y face of cubemap"]
pub const CUarray_cubemap_face_enum_CU_CUBEMAP_FACE_NEGATIVE_Y: CUarray_cubemap_face_enum = 3;
#[doc = "< Positive Z face of cubemap"]
pub const CUarray_cubemap_face_enum_CU_CUBEMAP_FACE_POSITIVE_Z: CUarray_cubemap_face_enum = 4;
#[doc = "< Negative Z face of cubemap"]
pub const CUarray_cubemap_face_enum_CU_CUBEMAP_FACE_NEGATIVE_Z: CUarray_cubemap_face_enum = 5;
#[doc = " Array indices for cube faces"]
pub type CUarray_cubemap_face_enum = ::std::os::raw::c_uint;
#[doc = " Array indices for cube faces"]
pub use self::CUarray_cubemap_face_enum as CUarray_cubemap_face;
#[doc = "< GPU thread stack size"]
pub const CUlimit_enum_CU_LIMIT_STACK_SIZE: CUlimit_enum = 0;
#[doc = "< GPU printf FIFO size"]
pub const CUlimit_enum_CU_LIMIT_PRINTF_FIFO_SIZE: CUlimit_enum = 1;
#[doc = "< GPU malloc heap size"]
pub const CUlimit_enum_CU_LIMIT_MALLOC_HEAP_SIZE: CUlimit_enum = 2;
#[doc = "< GPU device runtime launch synchronize depth"]
pub const CUlimit_enum_CU_LIMIT_DEV_RUNTIME_SYNC_DEPTH: CUlimit_enum = 3;
#[doc = "< GPU device runtime pending launch count"]
pub const CUlimit_enum_CU_LIMIT_DEV_RUNTIME_PENDING_LAUNCH_COUNT: CUlimit_enum = 4;
#[doc = "< A value between 0 and 128 that indicates the maximum fetch granularity of L2 (in Bytes). This is a hint"]
pub const CUlimit_enum_CU_LIMIT_MAX_L2_FETCH_GRANULARITY: CUlimit_enum = 5;
#[doc = "< A size in bytes for L2 persisting lines cache size"]
pub const CUlimit_enum_CU_LIMIT_PERSISTING_L2_CACHE_SIZE: CUlimit_enum = 6;
#[doc = "< A maximum size in bytes of shared memory available to CUDA kernels on a CIG context. Can only be queried, cannot be set"]
pub const CUlimit_enum_CU_LIMIT_SHMEM_SIZE: CUlimit_enum = 7;
#[doc = "< A non-zero value indicates this CUDA context is a CIG-enabled context. Can only be queried, cannot be set"]
pub const CUlimit_enum_CU_LIMIT_CIG_ENABLED: CUlimit_enum = 8;
#[doc = "< When set to zero, CUDA will fail to launch a kernel on a CIG context, instead of using the fallback path, if the kernel uses more shared memory than available"]
pub const CUlimit_enum_CU_LIMIT_CIG_SHMEM_FALLBACK_ENABLED: CUlimit_enum = 9;
pub const CUlimit_enum_CU_LIMIT_MAX: CUlimit_enum = 10;
#[doc = " Limits"]
pub type CUlimit_enum = ::std::os::raw::c_uint;
#[doc = " Limits"]
pub use self::CUlimit_enum as CUlimit;
#[doc = "< Array resource"]
pub const CUresourcetype_enum_CU_RESOURCE_TYPE_ARRAY: CUresourcetype_enum = 0;
#[doc = "< Mipmapped array resource"]
pub const CUresourcetype_enum_CU_RESOURCE_TYPE_MIPMAPPED_ARRAY: CUresourcetype_enum = 1;
#[doc = "< Linear resource"]
pub const CUresourcetype_enum_CU_RESOURCE_TYPE_LINEAR: CUresourcetype_enum = 2;
#[doc = "< Pitch 2D resource"]
pub const CUresourcetype_enum_CU_RESOURCE_TYPE_PITCH2D: CUresourcetype_enum = 3;
#[doc = " Resource types"]
pub type CUresourcetype_enum = ::std::os::raw::c_uint;
#[doc = " Resource types"]
pub use self::CUresourcetype_enum as CUresourcetype;
#[doc = " CUDA host function\n \\param userData Argument value passed to the function"]
pub type CUhostFn =
    ::std::option::Option<unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void)>;
#[doc = "< Normal cache persistence."]
pub const CUaccessProperty_enum_CU_ACCESS_PROPERTY_NORMAL: CUaccessProperty_enum = 0;
#[doc = "< Streaming access is less likely to persit from cache."]
pub const CUaccessProperty_enum_CU_ACCESS_PROPERTY_STREAMING: CUaccessProperty_enum = 1;
#[doc = "< Persisting access is more likely to persist in cache."]
pub const CUaccessProperty_enum_CU_ACCESS_PROPERTY_PERSISTING: CUaccessProperty_enum = 2;
#[doc = " Specifies performance hint with ::CUaccessPolicyWindow for hitProp and missProp members."]
pub type CUaccessProperty_enum = ::std::os::raw::c_uint;
#[doc = " Specifies performance hint with ::CUaccessPolicyWindow for hitProp and missProp members."]
pub use self::CUaccessProperty_enum as CUaccessProperty;
#[doc = " Specifies an access policy for a window, a contiguous extent of memory\n beginning at base_ptr and ending at base_ptr + num_bytes.\n num_bytes is limited by CU_DEVICE_ATTRIBUTE_MAX_ACCESS_POLICY_WINDOW_SIZE.\n Partition into many segments and assign segments such that:\n sum of \"hit segments\" / window == approx. ratio.\n sum of \"miss segments\" / window == approx 1-ratio.\n Segments and ratio specifications are fitted to the capabilities of\n the architecture.\n Accesses in a hit segment apply the hitProp access policy.\n Accesses in a miss segment apply the missProp access policy."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUaccessPolicyWindow_st {
    #[doc = "< Starting address of the access policy window. CUDA driver may align it."]
    pub base_ptr: *mut ::std::os::raw::c_void,
    #[doc = "< Size in bytes of the window policy. CUDA driver may restrict the maximum size and alignment."]
    pub num_bytes: usize,
    #[doc = "< hitRatio specifies percentage of lines assigned hitProp, rest are assigned missProp."]
    pub hitRatio: f32,
    #[doc = "< ::CUaccessProperty set for hit."]
    pub hitProp: CUaccessProperty,
    #[doc = "< ::CUaccessProperty set for miss. Must be either NORMAL or STREAMING"]
    pub missProp: CUaccessProperty,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUaccessPolicyWindow_st"][::std::mem::size_of::<CUaccessPolicyWindow_st>() - 32usize];
    ["Alignment of CUaccessPolicyWindow_st"]
        [::std::mem::align_of::<CUaccessPolicyWindow_st>() - 8usize];
    ["Offset of field: CUaccessPolicyWindow_st::base_ptr"]
        [::std::mem::offset_of!(CUaccessPolicyWindow_st, base_ptr) - 0usize];
    ["Offset of field: CUaccessPolicyWindow_st::num_bytes"]
        [::std::mem::offset_of!(CUaccessPolicyWindow_st, num_bytes) - 8usize];
    ["Offset of field: CUaccessPolicyWindow_st::hitRatio"]
        [::std::mem::offset_of!(CUaccessPolicyWindow_st, hitRatio) - 16usize];
    ["Offset of field: CUaccessPolicyWindow_st::hitProp"]
        [::std::mem::offset_of!(CUaccessPolicyWindow_st, hitProp) - 20usize];
    ["Offset of field: CUaccessPolicyWindow_st::missProp"]
        [::std::mem::offset_of!(CUaccessPolicyWindow_st, missProp) - 24usize];
};
#[doc = " Specifies an access policy for a window, a contiguous extent of memory\n beginning at base_ptr and ending at base_ptr + num_bytes.\n num_bytes is limited by CU_DEVICE_ATTRIBUTE_MAX_ACCESS_POLICY_WINDOW_SIZE.\n Partition into many segments and assign segments such that:\n sum of \"hit segments\" / window == approx. ratio.\n sum of \"miss segments\" / window == approx 1-ratio.\n Segments and ratio specifications are fitted to the capabilities of\n the architecture.\n Accesses in a hit segment apply the hitProp access policy.\n Accesses in a miss segment apply the missProp access policy."]
pub type CUaccessPolicyWindow_v1 = CUaccessPolicyWindow_st;
#[doc = " Access policy window"]
pub type CUaccessPolicyWindow = CUaccessPolicyWindow_v1;
#[doc = " GPU kernel node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_KERNEL_NODE_PARAMS_st {
    #[doc = "< Kernel to launch"]
    pub func: CUfunction,
    #[doc = "< Width of grid in blocks"]
    pub gridDimX: ::std::os::raw::c_uint,
    #[doc = "< Height of grid in blocks"]
    pub gridDimY: ::std::os::raw::c_uint,
    #[doc = "< Depth of grid in blocks"]
    pub gridDimZ: ::std::os::raw::c_uint,
    #[doc = "< X dimension of each thread block"]
    pub blockDimX: ::std::os::raw::c_uint,
    #[doc = "< Y dimension of each thread block"]
    pub blockDimY: ::std::os::raw::c_uint,
    #[doc = "< Z dimension of each thread block"]
    pub blockDimZ: ::std::os::raw::c_uint,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Array of pointers to kernel parameters"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Extra options"]
    pub extra: *mut *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_KERNEL_NODE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_KERNEL_NODE_PARAMS_st>() - 56usize];
    ["Alignment of CUDA_KERNEL_NODE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_KERNEL_NODE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::func"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, func) - 0usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::gridDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, gridDimX) - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::gridDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, gridDimY) - 12usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::gridDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, gridDimZ) - 16usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::blockDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, blockDimX) - 20usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::blockDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, blockDimY) - 24usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::blockDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, blockDimZ) - 28usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::sharedMemBytes"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, sharedMemBytes) - 32usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::kernelParams"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, kernelParams) - 40usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_st::extra"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_st, extra) - 48usize];
};
#[doc = " GPU kernel node parameters"]
pub type CUDA_KERNEL_NODE_PARAMS_v1 = CUDA_KERNEL_NODE_PARAMS_st;
#[doc = " GPU kernel node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_KERNEL_NODE_PARAMS_v2_st {
    #[doc = "< Kernel to launch"]
    pub func: CUfunction,
    #[doc = "< Width of grid in blocks"]
    pub gridDimX: ::std::os::raw::c_uint,
    #[doc = "< Height of grid in blocks"]
    pub gridDimY: ::std::os::raw::c_uint,
    #[doc = "< Depth of grid in blocks"]
    pub gridDimZ: ::std::os::raw::c_uint,
    #[doc = "< X dimension of each thread block"]
    pub blockDimX: ::std::os::raw::c_uint,
    #[doc = "< Y dimension of each thread block"]
    pub blockDimY: ::std::os::raw::c_uint,
    #[doc = "< Z dimension of each thread block"]
    pub blockDimZ: ::std::os::raw::c_uint,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Array of pointers to kernel parameters"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Extra options"]
    pub extra: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Kernel to launch, will only be referenced if func is NULL"]
    pub kern: CUkernel,
    #[doc = "< Context for the kernel task to run in. The value NULL will indicate the current context should be used by the api. This field is ignored if func is set."]
    pub ctx: CUcontext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_KERNEL_NODE_PARAMS_v2_st"]
        [::std::mem::size_of::<CUDA_KERNEL_NODE_PARAMS_v2_st>() - 72usize];
    ["Alignment of CUDA_KERNEL_NODE_PARAMS_v2_st"]
        [::std::mem::align_of::<CUDA_KERNEL_NODE_PARAMS_v2_st>() - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::func"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, func) - 0usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::gridDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, gridDimX) - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::gridDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, gridDimY) - 12usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::gridDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, gridDimZ) - 16usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::blockDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, blockDimX) - 20usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::blockDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, blockDimY) - 24usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::blockDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, blockDimZ) - 28usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::sharedMemBytes"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, sharedMemBytes) - 32usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::kernelParams"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, kernelParams) - 40usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::extra"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, extra) - 48usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::kern"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, kern) - 56usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v2_st::ctx"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v2_st, ctx) - 64usize];
};
#[doc = " GPU kernel node parameters"]
pub type CUDA_KERNEL_NODE_PARAMS_v2 = CUDA_KERNEL_NODE_PARAMS_v2_st;
#[doc = " GPU kernel node parameters"]
pub type CUDA_KERNEL_NODE_PARAMS = CUDA_KERNEL_NODE_PARAMS_v2;
#[doc = " GPU kernel node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_KERNEL_NODE_PARAMS_v3_st {
    #[doc = "< Kernel to launch"]
    pub func: CUfunction,
    #[doc = "< Width of grid in blocks"]
    pub gridDimX: ::std::os::raw::c_uint,
    #[doc = "< Height of grid in blocks"]
    pub gridDimY: ::std::os::raw::c_uint,
    #[doc = "< Depth of grid in blocks"]
    pub gridDimZ: ::std::os::raw::c_uint,
    #[doc = "< X dimension of each thread block"]
    pub blockDimX: ::std::os::raw::c_uint,
    #[doc = "< Y dimension of each thread block"]
    pub blockDimY: ::std::os::raw::c_uint,
    #[doc = "< Z dimension of each thread block"]
    pub blockDimZ: ::std::os::raw::c_uint,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Array of pointers to kernel parameters"]
    pub kernelParams: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Extra options"]
    pub extra: *mut *mut ::std::os::raw::c_void,
    #[doc = "< Kernel to launch, will only be referenced if func is NULL"]
    pub kern: CUkernel,
    #[doc = "< Context for the kernel task to run in. The value NULL will indicate the current context should be used by the api. This field is ignored if func is set."]
    pub ctx: CUcontext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_KERNEL_NODE_PARAMS_v3_st"]
        [::std::mem::size_of::<CUDA_KERNEL_NODE_PARAMS_v3_st>() - 72usize];
    ["Alignment of CUDA_KERNEL_NODE_PARAMS_v3_st"]
        [::std::mem::align_of::<CUDA_KERNEL_NODE_PARAMS_v3_st>() - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::func"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, func) - 0usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::gridDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, gridDimX) - 8usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::gridDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, gridDimY) - 12usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::gridDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, gridDimZ) - 16usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::blockDimX"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, blockDimX) - 20usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::blockDimY"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, blockDimY) - 24usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::blockDimZ"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, blockDimZ) - 28usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::sharedMemBytes"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, sharedMemBytes) - 32usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::kernelParams"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, kernelParams) - 40usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::extra"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, extra) - 48usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::kern"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, kern) - 56usize];
    ["Offset of field: CUDA_KERNEL_NODE_PARAMS_v3_st::ctx"]
        [::std::mem::offset_of!(CUDA_KERNEL_NODE_PARAMS_v3_st, ctx) - 64usize];
};
#[doc = " GPU kernel node parameters"]
pub type CUDA_KERNEL_NODE_PARAMS_v3 = CUDA_KERNEL_NODE_PARAMS_v3_st;
#[doc = " Memset node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMSET_NODE_PARAMS_st {
    #[doc = "< Destination device pointer"]
    pub dst: CUdeviceptr,
    #[doc = "< Pitch of destination device pointer. Unused if height is 1"]
    pub pitch: usize,
    #[doc = "< Value to be set"]
    pub value: ::std::os::raw::c_uint,
    #[doc = "< Size of each element in bytes. Must be 1, 2, or 4."]
    pub elementSize: ::std::os::raw::c_uint,
    #[doc = "< Width of the row in elements"]
    pub width: usize,
    #[doc = "< Number of rows"]
    pub height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMSET_NODE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_MEMSET_NODE_PARAMS_st>() - 40usize];
    ["Alignment of CUDA_MEMSET_NODE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_MEMSET_NODE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::dst"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, dst) - 0usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::pitch"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, pitch) - 8usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::value"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, value) - 16usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::elementSize"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, elementSize) - 20usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::width"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, width) - 24usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_st::height"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_st, height) - 32usize];
};
#[doc = " Memset node parameters"]
pub type CUDA_MEMSET_NODE_PARAMS_v1 = CUDA_MEMSET_NODE_PARAMS_st;
#[doc = " Memset node parameters"]
pub type CUDA_MEMSET_NODE_PARAMS = CUDA_MEMSET_NODE_PARAMS_v1;
#[doc = " Memset node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMSET_NODE_PARAMS_v2_st {
    #[doc = "< Destination device pointer"]
    pub dst: CUdeviceptr,
    #[doc = "< Pitch of destination device pointer. Unused if height is 1"]
    pub pitch: usize,
    #[doc = "< Value to be set"]
    pub value: ::std::os::raw::c_uint,
    #[doc = "< Size of each element in bytes. Must be 1, 2, or 4."]
    pub elementSize: ::std::os::raw::c_uint,
    #[doc = "< Width of the row in elements"]
    pub width: usize,
    #[doc = "< Number of rows"]
    pub height: usize,
    #[doc = "< Context on which to run the node"]
    pub ctx: CUcontext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMSET_NODE_PARAMS_v2_st"]
        [::std::mem::size_of::<CUDA_MEMSET_NODE_PARAMS_v2_st>() - 48usize];
    ["Alignment of CUDA_MEMSET_NODE_PARAMS_v2_st"]
        [::std::mem::align_of::<CUDA_MEMSET_NODE_PARAMS_v2_st>() - 8usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::dst"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, dst) - 0usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::pitch"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, pitch) - 8usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::value"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, value) - 16usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::elementSize"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, elementSize) - 20usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::width"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, width) - 24usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::height"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, height) - 32usize];
    ["Offset of field: CUDA_MEMSET_NODE_PARAMS_v2_st::ctx"]
        [::std::mem::offset_of!(CUDA_MEMSET_NODE_PARAMS_v2_st, ctx) - 40usize];
};
#[doc = " Memset node parameters"]
pub type CUDA_MEMSET_NODE_PARAMS_v2 = CUDA_MEMSET_NODE_PARAMS_v2_st;
#[doc = " Host node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_HOST_NODE_PARAMS_st {
    #[doc = "< The function to call when the node executes"]
    pub fn_: CUhostFn,
    #[doc = "< Argument to pass to the function"]
    pub userData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_HOST_NODE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_HOST_NODE_PARAMS_st>() - 16usize];
    ["Alignment of CUDA_HOST_NODE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_HOST_NODE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_st::fn_"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_st, fn_) - 0usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_st::userData"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_st, userData) - 8usize];
};
#[doc = " Host node parameters"]
pub type CUDA_HOST_NODE_PARAMS_v1 = CUDA_HOST_NODE_PARAMS_st;
#[doc = " Host node parameters"]
pub type CUDA_HOST_NODE_PARAMS = CUDA_HOST_NODE_PARAMS_v1;
#[doc = " Host node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_HOST_NODE_PARAMS_v2_st {
    #[doc = "< The function to call when the node executes"]
    pub fn_: CUhostFn,
    #[doc = "< Argument to pass to the function"]
    pub userData: *mut ::std::os::raw::c_void,
    #[doc = "< The sync mode to use for the host task"]
    pub syncMode: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_HOST_NODE_PARAMS_v2_st"]
        [::std::mem::size_of::<CUDA_HOST_NODE_PARAMS_v2_st>() - 24usize];
    ["Alignment of CUDA_HOST_NODE_PARAMS_v2_st"]
        [::std::mem::align_of::<CUDA_HOST_NODE_PARAMS_v2_st>() - 8usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_v2_st::fn_"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_v2_st, fn_) - 0usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_v2_st::userData"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_v2_st, userData) - 8usize];
    ["Offset of field: CUDA_HOST_NODE_PARAMS_v2_st::syncMode"]
        [::std::mem::offset_of!(CUDA_HOST_NODE_PARAMS_v2_st, syncMode) - 16usize];
};
#[doc = " Host node parameters"]
pub type CUDA_HOST_NODE_PARAMS_v2 = CUDA_HOST_NODE_PARAMS_v2_st;
#[doc = "< Conditional 'if/else' Node. Body[0] executed if condition is non-zero.  If \\p size == 2, an optional ELSE graph is created and this is executed if the condition is zero."]
pub const CUgraphConditionalNodeType_enum_CU_GRAPH_COND_TYPE_IF: CUgraphConditionalNodeType_enum =
    0;
#[doc = "< Conditional 'while' Node. Body executed repeatedly while condition value is non-zero."]
pub const CUgraphConditionalNodeType_enum_CU_GRAPH_COND_TYPE_WHILE:
    CUgraphConditionalNodeType_enum = 1;
#[doc = "< Conditional 'switch' Node. Body[n] is executed once, where 'n' is the value of the condition. If the condition does not match a body index, no body is launched."]
pub const CUgraphConditionalNodeType_enum_CU_GRAPH_COND_TYPE_SWITCH:
    CUgraphConditionalNodeType_enum = 2;
#[doc = " Conditional node types"]
pub type CUgraphConditionalNodeType_enum = ::std::os::raw::c_uint;
#[doc = " Conditional node types"]
pub use self::CUgraphConditionalNodeType_enum as CUgraphConditionalNodeType;
#[doc = " Conditional node parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_CONDITIONAL_NODE_PARAMS {
    #[doc = "< Conditional node handle.\nHandles must be created in advance of creating the node\nusing ::cuGraphConditionalHandleCreate."]
    pub handle: CUgraphConditionalHandle,
    #[doc = "< Type of conditional node."]
    pub type_: CUgraphConditionalNodeType,
    #[doc = "< Size of graph output array.  Allowed values are 1 for CU_GRAPH_COND_TYPE_WHILE, 1 or 2\nfor CU_GRAPH_COND_TYPE_IF, or any value greater than zero for CU_GRAPH_COND_TYPE_SWITCH."]
    pub size: ::std::os::raw::c_uint,
    #[doc = "< CUDA-owned array populated with conditional node child graphs during creation of the node.\nValid for the lifetime of the conditional node.\nThe contents of the graph(s) are subject to the following constraints:\n\n- Allowed node types are kernel nodes, empty nodes, child graphs, memsets,\nmemcopies, and conditionals. This applies recursively to child graphs and conditional bodies.\n- All kernels, including kernels in nested conditionals or child graphs at any level,\nmust belong to the same CUDA context.\n\nThese graphs may be populated using graph node creation APIs or ::cuStreamBeginCaptureToGraph.\n\nCU_GRAPH_COND_TYPE_IF:\nphGraph_out[0] is executed when the condition is non-zero.  If \\p size == 2, phGraph_out[1] will\nbe executed when the condition is zero.\nCU_GRAPH_COND_TYPE_WHILE:\nphGraph_out[0] is executed as long as the condition is non-zero.\nCU_GRAPH_COND_TYPE_SWITCH:\nphGraph_out[n] is executed when the condition is equal to n.  If the condition >= \\p size,\nno body graph is executed."]
    pub phGraph_out: *mut CUgraph,
    #[doc = "< Context on which to run the node.  Must match context used to create the handle and all body nodes."]
    pub ctx: CUcontext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_CONDITIONAL_NODE_PARAMS"]
        [::std::mem::size_of::<CUDA_CONDITIONAL_NODE_PARAMS>() - 32usize];
    ["Alignment of CUDA_CONDITIONAL_NODE_PARAMS"]
        [::std::mem::align_of::<CUDA_CONDITIONAL_NODE_PARAMS>() - 8usize];
    ["Offset of field: CUDA_CONDITIONAL_NODE_PARAMS::handle"]
        [::std::mem::offset_of!(CUDA_CONDITIONAL_NODE_PARAMS, handle) - 0usize];
    ["Offset of field: CUDA_CONDITIONAL_NODE_PARAMS::type_"]
        [::std::mem::offset_of!(CUDA_CONDITIONAL_NODE_PARAMS, type_) - 8usize];
    ["Offset of field: CUDA_CONDITIONAL_NODE_PARAMS::size"]
        [::std::mem::offset_of!(CUDA_CONDITIONAL_NODE_PARAMS, size) - 12usize];
    ["Offset of field: CUDA_CONDITIONAL_NODE_PARAMS::phGraph_out"]
        [::std::mem::offset_of!(CUDA_CONDITIONAL_NODE_PARAMS, phGraph_out) - 16usize];
    ["Offset of field: CUDA_CONDITIONAL_NODE_PARAMS::ctx"]
        [::std::mem::offset_of!(CUDA_CONDITIONAL_NODE_PARAMS, ctx) - 24usize];
};
#[doc = "< GPU kernel node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_KERNEL: CUgraphNodeType_enum = 0;
#[doc = "< Memcpy node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_MEMCPY: CUgraphNodeType_enum = 1;
#[doc = "< Memset node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_MEMSET: CUgraphNodeType_enum = 2;
#[doc = "< Host (executable) node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_HOST: CUgraphNodeType_enum = 3;
#[doc = "< Node which executes an embedded graph"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_GRAPH: CUgraphNodeType_enum = 4;
#[doc = "< Empty (no-op) node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_EMPTY: CUgraphNodeType_enum = 5;
#[doc = "< External event wait node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_WAIT_EVENT: CUgraphNodeType_enum = 6;
#[doc = "< External event record node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_EVENT_RECORD: CUgraphNodeType_enum = 7;
#[doc = "< External semaphore signal node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_EXT_SEMAS_SIGNAL: CUgraphNodeType_enum = 8;
#[doc = "< External semaphore wait node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_EXT_SEMAS_WAIT: CUgraphNodeType_enum = 9;
#[doc = "< Memory Allocation Node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_MEM_ALLOC: CUgraphNodeType_enum = 10;
#[doc = "< Memory Free Node"]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_MEM_FREE: CUgraphNodeType_enum = 11;
#[doc = "< Batch MemOp Node\nSee ::cuStreamBatchMemOp and ::CUstreamBatchMemOpType for what these nodes can do."]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_BATCH_MEM_OP: CUgraphNodeType_enum = 12;
#[doc = "< Conditional Node\n\nMay be used to implement a conditional execution path or loop\ninside of a graph. The graph(s) contained within the body of the conditional node\ncan be selectively executed or iterated upon based on the value of a conditional\nvariable.\n\nHandles must be created in advance of creating the node\nusing ::cuGraphConditionalHandleCreate.\n\nThe following restrictions apply to graphs which contain conditional nodes:\nThe graph cannot be used in a child node.\nOnly one instantiation of the graph may exist at any point in time.\nThe graph cannot be cloned.\n\nTo set the control value, supply a default value when creating the handle and/or\ncall ::cudaGraphSetConditional from device code."]
pub const CUgraphNodeType_enum_CU_GRAPH_NODE_TYPE_CONDITIONAL: CUgraphNodeType_enum = 13;
#[doc = " Graph node types"]
pub type CUgraphNodeType_enum = ::std::os::raw::c_uint;
#[doc = " Graph node types"]
pub use self::CUgraphNodeType_enum as CUgraphNodeType;
#[doc = "< This is an ordinary dependency."]
pub const CUgraphDependencyType_enum_CU_GRAPH_DEPENDENCY_TYPE_DEFAULT: CUgraphDependencyType_enum =
    0;
#[doc = "< This dependency type allows the downstream node to\nuse \\c cudaGridDependencySynchronize(). It may only be used\nbetween kernel nodes, and must be used with either the\n::CU_GRAPH_KERNEL_NODE_PORT_PROGRAMMATIC or\n::CU_GRAPH_KERNEL_NODE_PORT_LAUNCH_ORDER outgoing port."]
pub const CUgraphDependencyType_enum_CU_GRAPH_DEPENDENCY_TYPE_PROGRAMMATIC:
    CUgraphDependencyType_enum = 1;
#[doc = " Type annotations that can be applied to graph edges as part of ::CUgraphEdgeData."]
pub type CUgraphDependencyType_enum = ::std::os::raw::c_uint;
#[doc = " Type annotations that can be applied to graph edges as part of ::CUgraphEdgeData."]
pub use self::CUgraphDependencyType_enum as CUgraphDependencyType;
#[doc = " Optional annotation for edges in a CUDA graph. Note, all edges implicitly have annotations and\n default to a zero-initialized value if not specified. A zero-initialized struct indicates a\n standard full serialization of two nodes with memory visibility."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUgraphEdgeData_st {
    #[doc = "< This indicates when the dependency is triggered from the upstream\nnode on the edge. The meaning is specfic to the node type. A value\nof 0 in all cases means full completion of the upstream node, with\nmemory visibility to the downstream node or portion thereof\n(indicated by \\c to_port).\n<br>\nOnly kernel nodes define non-zero ports. A kernel node\ncan use the following output port types:\n::CU_GRAPH_KERNEL_NODE_PORT_DEFAULT, ::CU_GRAPH_KERNEL_NODE_PORT_PROGRAMMATIC,\nor ::CU_GRAPH_KERNEL_NODE_PORT_LAUNCH_ORDER."]
    pub from_port: ::std::os::raw::c_uchar,
    #[doc = "< This indicates what portion of the downstream node is dependent on\nthe upstream node or portion thereof (indicated by \\c from_port). The\nmeaning is specific to the node type. A value of 0 in all cases means\nthe entirety of the downstream node is dependent on the upstream work.\n<br>\nCurrently no node types define non-zero ports. Accordingly, this field\nmust be set to zero."]
    pub to_port: ::std::os::raw::c_uchar,
    #[doc = "< This should be populated with a value from ::CUgraphDependencyType. (It\nis typed as char due to compiler-specific layout of bitfields.) See\n::CUgraphDependencyType."]
    pub type_: ::std::os::raw::c_uchar,
    #[doc = "< These bytes are unused and must be zeroed. This ensures\ncompatibility if additional fields are added in the future."]
    pub reserved: [::std::os::raw::c_uchar; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUgraphEdgeData_st"][::std::mem::size_of::<CUgraphEdgeData_st>() - 8usize];
    ["Alignment of CUgraphEdgeData_st"][::std::mem::align_of::<CUgraphEdgeData_st>() - 1usize];
    ["Offset of field: CUgraphEdgeData_st::from_port"]
        [::std::mem::offset_of!(CUgraphEdgeData_st, from_port) - 0usize];
    ["Offset of field: CUgraphEdgeData_st::to_port"]
        [::std::mem::offset_of!(CUgraphEdgeData_st, to_port) - 1usize];
    ["Offset of field: CUgraphEdgeData_st::type_"]
        [::std::mem::offset_of!(CUgraphEdgeData_st, type_) - 2usize];
    ["Offset of field: CUgraphEdgeData_st::reserved"]
        [::std::mem::offset_of!(CUgraphEdgeData_st, reserved) - 3usize];
};
#[doc = " Optional annotation for edges in a CUDA graph. Note, all edges implicitly have annotations and\n default to a zero-initialized value if not specified. A zero-initialized struct indicates a\n standard full serialization of two nodes with memory visibility."]
pub type CUgraphEdgeData = CUgraphEdgeData_st;
#[doc = "< Instantiation succeeded"]
pub const CUgraphInstantiateResult_enum_CUDA_GRAPH_INSTANTIATE_SUCCESS:
    CUgraphInstantiateResult_enum = 0;
#[doc = "< Instantiation failed for an unexpected reason which is described in the return value of the function"]
pub const CUgraphInstantiateResult_enum_CUDA_GRAPH_INSTANTIATE_ERROR:
    CUgraphInstantiateResult_enum = 1;
#[doc = "< Instantiation failed due to invalid structure, such as cycles"]
pub const CUgraphInstantiateResult_enum_CUDA_GRAPH_INSTANTIATE_INVALID_STRUCTURE:
    CUgraphInstantiateResult_enum = 2;
#[doc = "< Instantiation for device launch failed because the graph contained an unsupported operation"]
pub const CUgraphInstantiateResult_enum_CUDA_GRAPH_INSTANTIATE_NODE_OPERATION_NOT_SUPPORTED:
    CUgraphInstantiateResult_enum = 3;
#[doc = "< Instantiation for device launch failed due to the nodes belonging to different contexts"]
pub const CUgraphInstantiateResult_enum_CUDA_GRAPH_INSTANTIATE_MULTIPLE_CTXS_NOT_SUPPORTED:
    CUgraphInstantiateResult_enum = 4;
#[doc = "< One or more conditional handles are not associated with conditional nodes"]
pub const CUgraphInstantiateResult_enum_CUDA_GRAPH_INSTANTIATE_CONDITIONAL_HANDLE_UNUSED:
    CUgraphInstantiateResult_enum = 5;
#[doc = " Graph instantiation results"]
pub type CUgraphInstantiateResult_enum = ::std::os::raw::c_uint;
#[doc = " Graph instantiation results"]
pub use self::CUgraphInstantiateResult_enum as CUgraphInstantiateResult;
#[doc = " Graph instantiation parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_GRAPH_INSTANTIATE_PARAMS_st {
    #[doc = "< Instantiation flags"]
    pub flags: cuuint64_t,
    #[doc = "< Upload stream"]
    pub hUploadStream: CUstream,
    #[doc = "< The node which caused instantiation to fail, if any"]
    pub hErrNode_out: CUgraphNode,
    #[doc = "< Whether instantiation was successful.  If it failed, the reason why"]
    pub result_out: CUgraphInstantiateResult,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_GRAPH_INSTANTIATE_PARAMS_st"]
        [::std::mem::size_of::<CUDA_GRAPH_INSTANTIATE_PARAMS_st>() - 32usize];
    ["Alignment of CUDA_GRAPH_INSTANTIATE_PARAMS_st"]
        [::std::mem::align_of::<CUDA_GRAPH_INSTANTIATE_PARAMS_st>() - 8usize];
    ["Offset of field: CUDA_GRAPH_INSTANTIATE_PARAMS_st::flags"]
        [::std::mem::offset_of!(CUDA_GRAPH_INSTANTIATE_PARAMS_st, flags) - 0usize];
    ["Offset of field: CUDA_GRAPH_INSTANTIATE_PARAMS_st::hUploadStream"]
        [::std::mem::offset_of!(CUDA_GRAPH_INSTANTIATE_PARAMS_st, hUploadStream) - 8usize];
    ["Offset of field: CUDA_GRAPH_INSTANTIATE_PARAMS_st::hErrNode_out"]
        [::std::mem::offset_of!(CUDA_GRAPH_INSTANTIATE_PARAMS_st, hErrNode_out) - 16usize];
    ["Offset of field: CUDA_GRAPH_INSTANTIATE_PARAMS_st::result_out"]
        [::std::mem::offset_of!(CUDA_GRAPH_INSTANTIATE_PARAMS_st, result_out) - 24usize];
};
#[doc = " Graph instantiation parameters"]
pub type CUDA_GRAPH_INSTANTIATE_PARAMS = CUDA_GRAPH_INSTANTIATE_PARAMS_st;
pub const CUsynchronizationPolicy_enum_CU_SYNC_POLICY_AUTO: CUsynchronizationPolicy_enum = 1;
pub const CUsynchronizationPolicy_enum_CU_SYNC_POLICY_SPIN: CUsynchronizationPolicy_enum = 2;
pub const CUsynchronizationPolicy_enum_CU_SYNC_POLICY_YIELD: CUsynchronizationPolicy_enum = 3;
pub const CUsynchronizationPolicy_enum_CU_SYNC_POLICY_BLOCKING_SYNC: CUsynchronizationPolicy_enum =
    4;
pub type CUsynchronizationPolicy_enum = ::std::os::raw::c_uint;
pub use self::CUsynchronizationPolicy_enum as CUsynchronizationPolicy;
#[doc = "< the default policy"]
pub const CUclusterSchedulingPolicy_enum_CU_CLUSTER_SCHEDULING_POLICY_DEFAULT:
    CUclusterSchedulingPolicy_enum = 0;
#[doc = "< spread the blocks within a cluster to the SMs"]
pub const CUclusterSchedulingPolicy_enum_CU_CLUSTER_SCHEDULING_POLICY_SPREAD:
    CUclusterSchedulingPolicy_enum = 1;
#[doc = "< allow the hardware to load-balance the blocks in a cluster to the SMs"]
pub const CUclusterSchedulingPolicy_enum_CU_CLUSTER_SCHEDULING_POLICY_LOAD_BALANCING:
    CUclusterSchedulingPolicy_enum = 2;
#[doc = " Cluster scheduling policies. These may be passed to ::cuFuncSetAttribute or ::cuKernelSetAttribute"]
pub type CUclusterSchedulingPolicy_enum = ::std::os::raw::c_uint;
#[doc = " Cluster scheduling policies. These may be passed to ::cuFuncSetAttribute or ::cuKernelSetAttribute"]
pub use self::CUclusterSchedulingPolicy_enum as CUclusterSchedulingPolicy;
#[doc = "< Launch kernels in the default domain"]
pub const CUlaunchMemSyncDomain_enum_CU_LAUNCH_MEM_SYNC_DOMAIN_DEFAULT: CUlaunchMemSyncDomain_enum =
    0;
#[doc = "< Launch kernels in the remote domain"]
pub const CUlaunchMemSyncDomain_enum_CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE: CUlaunchMemSyncDomain_enum =
    1;
#[doc = " Memory Synchronization Domain\n\n A kernel can be launched in a specified memory synchronization domain that affects all memory operations issued by\n that kernel. A memory barrier issued in one domain will only order memory operations in that domain, thus eliminating\n latency increase from memory barriers ordering unrelated traffic.\n\n By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a\n different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /\n graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN, ::cuStreamSetAttribute, ::cuLaunchKernelEx,\n ::cuGraphKernelNodeSetAttribute.\n\n Memory operations done in kernels launched in different domains are considered system-scope distanced. In other\n words, a GPU scoped memory synchronization is not sufficient for memory order to be observed by kernels in another\n memory synchronization domain even if they are on the same GPU."]
pub type CUlaunchMemSyncDomain_enum = ::std::os::raw::c_uint;
#[doc = " Memory Synchronization Domain\n\n A kernel can be launched in a specified memory synchronization domain that affects all memory operations issued by\n that kernel. A memory barrier issued in one domain will only order memory operations in that domain, thus eliminating\n latency increase from memory barriers ordering unrelated traffic.\n\n By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a\n different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /\n graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN, ::cuStreamSetAttribute, ::cuLaunchKernelEx,\n ::cuGraphKernelNodeSetAttribute.\n\n Memory operations done in kernels launched in different domains are considered system-scope distanced. In other\n words, a GPU scoped memory synchronization is not sufficient for memory order to be observed by kernels in another\n memory synchronization domain even if they are on the same GPU."]
pub use self::CUlaunchMemSyncDomain_enum as CUlaunchMemSyncDomain;
#[doc = " Memory Synchronization Domain map\n\n See ::cudaLaunchMemSyncDomain.\n\n By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a\n different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /\n graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP.\n\n Domain ID range is available through ::CU_DEVICE_ATTRIBUTE_MEM_SYNC_DOMAIN_COUNT."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchMemSyncDomainMap_st {
    #[doc = "< The default domain ID to use for designated kernels"]
    pub default_: ::std::os::raw::c_uchar,
    #[doc = "< The remote domain ID to use for designated kernels"]
    pub remote: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchMemSyncDomainMap_st"]
        [::std::mem::size_of::<CUlaunchMemSyncDomainMap_st>() - 2usize];
    ["Alignment of CUlaunchMemSyncDomainMap_st"]
        [::std::mem::align_of::<CUlaunchMemSyncDomainMap_st>() - 1usize];
    ["Offset of field: CUlaunchMemSyncDomainMap_st::default_"]
        [::std::mem::offset_of!(CUlaunchMemSyncDomainMap_st, default_) - 0usize];
    ["Offset of field: CUlaunchMemSyncDomainMap_st::remote"]
        [::std::mem::offset_of!(CUlaunchMemSyncDomainMap_st, remote) - 1usize];
};
#[doc = " Memory Synchronization Domain map\n\n See ::cudaLaunchMemSyncDomain.\n\n By default, kernels are launched in domain 0. Kernel launched with ::CU_LAUNCH_MEM_SYNC_DOMAIN_REMOTE will have a\n different domain ID. User may also alter the domain ID with ::CUlaunchMemSyncDomainMap for a specific stream /\n graph node / kernel launch. See ::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP.\n\n Domain ID range is available through ::CU_DEVICE_ATTRIBUTE_MEM_SYNC_DOMAIN_COUNT."]
pub type CUlaunchMemSyncDomainMap = CUlaunchMemSyncDomainMap_st;
#[doc = "< The default to use for allowing non-portable cluster size on launch - uses current function attribute\nfor ::CU_FUNC_ATTRIBUTE_NON_PORTABLE_CLUSTER_SIZE_ALLOWED"]
pub const CUlaunchAttributePortableClusterMode_enum_CU_LAUNCH_PORTABLE_CLUSTER_MODE_DEFAULT:
    CUlaunchAttributePortableClusterMode_enum = 0;
#[doc = "< Specifies that the cluster size requested must be a portable size"]
pub const CUlaunchAttributePortableClusterMode_enum_CU_LAUNCH_PORTABLE_CLUSTER_MODE_REQUIRE_PORTABLE : CUlaunchAttributePortableClusterMode_enum = 1 ;
#[doc = "< Specifies that the cluster size requested may be a non-portable size"]
pub const CUlaunchAttributePortableClusterMode_enum_CU_LAUNCH_PORTABLE_CLUSTER_MODE_ALLOW_NON_PORTABLE : CUlaunchAttributePortableClusterMode_enum = 2 ;
#[doc = " Enum for defining applicability of portable cluster size, used with ::cuLaunchKernelEx"]
pub type CUlaunchAttributePortableClusterMode_enum = ::std::os::raw::c_uint;
#[doc = " Enum for defining applicability of portable cluster size, used with ::cuLaunchKernelEx"]
pub use self::CUlaunchAttributePortableClusterMode_enum as CUlaunchAttributePortableClusterMode;
#[doc = "< The default to use for shared memory on launch - uses current function attribute\nfor ::CU_FUNC_ATTRIBUTE_MAX_DYNAMIC_SHARED_SIZE_BYTES"]
pub const CUsharedMemoryMode_enum_CU_SHARED_MEMORY_MODE_DEFAULT: CUsharedMemoryMode_enum = 0;
#[doc = "< Specifies that the dynamic shared size bytes requested must be a portable size within\nthe bounds of ::CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK"]
pub const CUsharedMemoryMode_enum_CU_SHARED_MEMORY_MODE_REQUIRE_PORTABLE: CUsharedMemoryMode_enum =
    1;
#[doc = "< Specifies that the dynamic shared size bytes requested may be a non-portable size but still within\nthe bounds of ::CU_DEVICE_ATTRIBUTE_MAX_SHARED_MEMORY_PER_BLOCK_OPTIN"]
pub const CUsharedMemoryMode_enum_CU_SHARED_MEMORY_MODE_ALLOW_NON_PORTABLE:
    CUsharedMemoryMode_enum = 2;
#[doc = " Shared memory related attributes for use with ::cuLaunchKernelEx"]
pub type CUsharedMemoryMode_enum = ::std::os::raw::c_uint;
#[doc = " Shared memory related attributes for use with ::cuLaunchKernelEx"]
pub use self::CUsharedMemoryMode_enum as CUsharedMemoryMode;
#[doc = "< Ignored entry, for convenient composition"]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_IGNORE: CUlaunchAttributeID_enum = 0;
#[doc = "< Valid for streams, graph nodes, launches. See\n::CUlaunchAttributeValue::accessPolicyWindow."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_ACCESS_POLICY_WINDOW:
    CUlaunchAttributeID_enum = 1;
#[doc = "< Valid for graph nodes, launches. See\n::CUlaunchAttributeValue::cooperative."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_COOPERATIVE: CUlaunchAttributeID_enum = 2;
#[doc = "< Valid for streams. See\n::CUlaunchAttributeValue::syncPolicy."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_SYNCHRONIZATION_POLICY:
    CUlaunchAttributeID_enum = 3;
#[doc = "< Valid for graph nodes, launches. See ::CUlaunchAttributeValue::clusterDim."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_CLUSTER_DIMENSION: CUlaunchAttributeID_enum =
    4;
#[doc = "< Valid for graph nodes, launches. See ::CUlaunchAttributeValue::clusterSchedulingPolicyPreference."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_CLUSTER_SCHEDULING_POLICY_PREFERENCE:
    CUlaunchAttributeID_enum = 5;
#[doc = "< Valid for launches. Setting\n::CUlaunchAttributeValue::programmaticStreamSerializationAllowed\nto non-0 signals that the kernel will use programmatic\nmeans to resolve its stream dependency, so that the\nCUDA runtime should opportunistically allow the grid's\nexecution to overlap with the previous kernel in the\nstream, if that kernel requests the overlap. The\ndependent launches can choose to wait on the\ndependency using the programmatic sync\n(cudaGridDependencySynchronize() or equivalent PTX\ninstructions)."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_STREAM_SERIALIZATION:
    CUlaunchAttributeID_enum = 6;
#[doc = "< Valid for launches. Set\n::CUlaunchAttributeValue::programmaticEvent to\nrecord the event. Event recorded through this\nlaunch attribute is guaranteed to only trigger\nafter all block in the associated kernel trigger\nthe event. A block can trigger the event through\nPTX launchdep.release or CUDA builtin function\ncudaTriggerProgrammaticLaunchCompletion(). A\ntrigger can also be inserted at the beginning of\neach block's execution if triggerAtBlockStart is\nset to non-0. The dependent launches can choose to\nwait on the dependency using the programmatic sync\n(cudaGridDependencySynchronize() or equivalent PTX\ninstructions). Note that dependents (including the\nCPU thread calling cuEventSynchronize()) are not\nguaranteed to observe the release precisely when\nit is released.  For example, cuEventSynchronize()\nmay only observe the event trigger long after the\nassociated kernel has completed. This recording\ntype is primarily meant for establishing\nprogrammatic dependency between device tasks. Note\nalso this type of dependency allows, but does not\nguarantee, concurrent execution of tasks.\n<br>\nThe event supplied must not be an interprocess or\ninterop event. The event must disable timing (i.e.\nmust be created with the ::CU_EVENT_DISABLE_TIMING\nflag set)."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_EVENT:
    CUlaunchAttributeID_enum = 7;
#[doc = "< Valid for streams, graph nodes, launches. See\n::CUlaunchAttributeValue::priority."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_PRIORITY: CUlaunchAttributeID_enum = 8;
#[doc = "< Valid for streams, graph nodes, launches. See\n::CUlaunchAttributeValue::memSyncDomainMap."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP:
    CUlaunchAttributeID_enum = 9;
#[doc = "< Valid for streams, graph nodes, launches. See\n::CUlaunchAttributeValue::memSyncDomain."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN: CUlaunchAttributeID_enum =
    10;
#[doc = "< Valid for graph nodes, launches. Set\n::CUlaunchAttributeValue::preferredClusterDim\nto allow the kernel launch to specify a preferred substitute\ncluster dimension. Blocks may be grouped according to either\nthe dimensions specified with this attribute (grouped into a\n\"preferred substitute cluster\"), or the one specified with\n::CU_LAUNCH_ATTRIBUTE_CLUSTER_DIMENSION attribute (grouped\ninto a \"regular cluster\"). The cluster dimensions of a\n\"preferred substitute cluster\" shall be an integer multiple\ngreater than zero of the regular cluster dimensions. The\ndevice will attempt - on a best-effort basis - to group\nthread blocks into preferred clusters over grouping them\ninto regular clusters. When it deems necessary (primarily\nwhen the device temporarily runs out of physical resources\nto launch the larger preferred clusters), the device may\nswitch to launch the regular clusters instead to attempt to\nutilize as much of the physical device resources as possible.\n<br>\nEach type of cluster will have its enumeration / coordinate\nsetup as if the grid consists solely of its type of cluster.\nFor example, if the preferred substitute cluster dimensions\ndouble the regular cluster dimensions, there might be\nsimultaneously a regular cluster indexed at (1,0,0), and a\npreferred cluster indexed at (1,0,0). In this example, the\npreferred substitute cluster (1,0,0) replaces regular\nclusters (2,0,0) and (3,0,0) and groups their blocks.\n<br>\nThis attribute will only take effect when a regular cluster\ndimension has been specified. The preferred substitute\ncluster dimension must be an integer multiple greater than\nzero of the regular cluster dimension and must divide the\ngrid. It must also be no more than `maxBlocksPerCluster`, if\nit is set in the kernel's `__launch_bounds__`. Otherwise it\nmust be less than the maximum value the driver can support.\nOtherwise, setting this attribute to a value physically\nunable to fit on any particular device is permitted."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_PREFERRED_CLUSTER_DIMENSION:
    CUlaunchAttributeID_enum = 11;
#[doc = "< Valid for launches. Set\n::CUlaunchAttributeValue::launchCompletionEvent to record the\nevent.\n<br>\nNominally, the event is triggered once all blocks of the kernel\nhave begun execution. Currently this is a best effort. If a kernel\nB has a launch completion dependency on a kernel A, B may wait\nuntil A is complete. Alternatively, blocks of B may begin before\nall blocks of A have begun, for example if B can claim execution\nresources unavailable to A (e.g. they run on different GPUs) or\nif B is a higher priority than A.\nExercise caution if such an ordering inversion could lead\nto deadlock.\n<br>\nA launch completion event is nominally similar to a programmatic\nevent with \\c triggerAtBlockStart set except that it is not\nvisible to \\c cudaGridDependencySynchronize() and can be used with\ncompute capability less than 9.0.\n<br>\nThe event supplied must not be an interprocess or interop\nevent. The event must disable timing (i.e. must be created\nwith the ::CU_EVENT_DISABLE_TIMING flag set)."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_LAUNCH_COMPLETION_EVENT:
    CUlaunchAttributeID_enum = 12;
#[doc = "< Valid for graph nodes, launches. This attribute is graphs-only,\nand passing it to a launch in a non-capturing stream will result\nin an error.\n<br>\n::CUlaunchAttributeValue::deviceUpdatableKernelNode::deviceUpdatable can\nonly be set to 0 or 1. Setting the field to 1 indicates that the\ncorresponding kernel node should be device-updatable. On success, a handle\nwill be returned via\n::CUlaunchAttributeValue::deviceUpdatableKernelNode::devNode which can be\npassed to the various device-side update functions to update the node's\nkernel parameters from within another kernel. For more information on the\ntypes of device updates that can be made, as well as the relevant limitations\nthereof, see ::cudaGraphKernelNodeUpdatesApply.\n<br>\nNodes which are device-updatable have additional restrictions compared to\nregular kernel nodes. Firstly, device-updatable nodes cannot be removed\nfrom their graph via ::cuGraphDestroyNode. Additionally, once opted-in\nto this functionality, a node cannot opt out, and any attempt to set the\ndeviceUpdatable attribute to 0 will result in an error. Device-updatable\nkernel nodes also cannot have their attributes copied to/from another kernel\nnode via ::cuGraphKernelNodeCopyAttributes. Graphs containing one or more\ndevice-updatable nodes also do not allow multiple instantiation, and neither\nthe graph nor its instantiated version can be passed to ::cuGraphExecUpdate.\n<br>\nIf a graph contains device-updatable nodes and updates those nodes from the device\nfrom within the graph, the graph must be uploaded with ::cuGraphUpload before it\nis launched. For such a graph, if host-side executable graph updates are made to the\ndevice-updatable nodes, the graph must be uploaded before it is launched again."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_DEVICE_UPDATABLE_KERNEL_NODE:
    CUlaunchAttributeID_enum = 13;
#[doc = "< Valid for launches. On devices where the L1 cache and shared memory use the\nsame hardware resources, setting ::CUlaunchAttributeValue::sharedMemCarveout to a\npercentage between 0-100 signals the CUDA driver to set the shared memory carveout\npreference, in percent of the total shared memory for that kernel launch.\nThis attribute takes precedence over ::CU_FUNC_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT.\nThis is only a hint, and the CUDA driver can choose a different configuration if\nrequired for the launch."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT:
    CUlaunchAttributeID_enum = 14;
#[doc = "< Valid for streams, graph nodes, launches. This attribute is a hint to the CUDA runtime that the\nlaunch should attempt to make the kernel maximize its NVLINK utilization.\n<br>\nWhen possible to honor this hint, CUDA will assume each block in the grid launch will carry out an even amount\nof NVLINK traffic, and make a best-effort attempt to adjust the kernel launch based on that assumption.\n<br>\nThis attribute is a hint only. CUDA makes no functional or performance guarantee. Its applicability can be\naffected by many different factors, including driver version (i.e. CUDA doesn't guarantee the performance\ncharacteristics will be maintained between driver versions or a driver update could alter or regress\npreviously observed perf characteristics.) It also doesn't guarantee a successful result, i.e. applying\nthe attribute may not improve the performance of either the targeted kernel or the encapsulating application.\n<br>\nValid values for ::CUlaunchAttributeValue::nvlinkUtilCentricScheduling are 0 (disabled) and 1 (enabled)."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_NVLINK_UTIL_CENTRIC_SCHEDULING:
    CUlaunchAttributeID_enum = 16;
#[doc = "< Valid for graph nodes, launches. This controls whether the kernel launch is allowed to use a non-portable cluster size.\nValid values for ::CUlaunchAttributeValue::portableClusterSizeMode are described in ::CUlaunchAttributePortableClusterMode.\nAny other value will return ::CUDA_ERROR_INVALID_VALUE"]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_PORTABLE_CLUSTER_SIZE_MODE:
    CUlaunchAttributeID_enum = 17;
#[doc = "< Valid for graph nodes, launches. This indicates if the kernel is allowed to use a non-portable dynamic shared memory mode."]
pub const CUlaunchAttributeID_enum_CU_LAUNCH_ATTRIBUTE_SHARED_MEMORY_MODE:
    CUlaunchAttributeID_enum = 18;
#[doc = " Launch attributes enum; used as id field of ::CUlaunchAttribute"]
pub type CUlaunchAttributeID_enum = ::std::os::raw::c_uint;
#[doc = " Launch attributes enum; used as id field of ::CUlaunchAttribute"]
pub use self::CUlaunchAttributeID_enum as CUlaunchAttributeID;
#[doc = " Launch attributes union; used as value field of ::CUlaunchAttribute"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUlaunchAttributeValue_union {
    pub pad: [::std::os::raw::c_char; 64usize],
    #[doc = "< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_ACCESS_POLICY_WINDOW."]
    pub accessPolicyWindow: CUaccessPolicyWindow,
    #[doc = "< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_COOPERATIVE. Nonzero indicates a cooperative\nkernel (see ::cuLaunchCooperativeKernel)."]
    pub cooperative: ::std::os::raw::c_int,
    #[doc = "< Value of launch attribute\n::CU_LAUNCH_ATTRIBUTE_SYNCHRONIZATION_POLICY. ::CUsynchronizationPolicy for\nwork queued up in this stream"]
    pub syncPolicy: CUsynchronizationPolicy,
    pub clusterDim: CUlaunchAttributeValue_union__bindgen_ty_1,
    #[doc = "< Value of launch attribute\n::CU_LAUNCH_ATTRIBUTE_CLUSTER_SCHEDULING_POLICY_PREFERENCE. Cluster\nscheduling policy preference for the kernel."]
    pub clusterSchedulingPolicyPreference: CUclusterSchedulingPolicy,
    #[doc = "< Value of launch attribute\n::CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_STREAM_SERIALIZATION."]
    pub programmaticStreamSerializationAllowed: ::std::os::raw::c_int,
    pub programmaticEvent: CUlaunchAttributeValue_union__bindgen_ty_2,
    pub launchCompletionEvent: CUlaunchAttributeValue_union__bindgen_ty_3,
    #[doc = "< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PRIORITY. Execution priority of the kernel."]
    pub priority: ::std::os::raw::c_int,
    #[doc = "< Value of launch attribute\n::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN_MAP. See\n::CUlaunchMemSyncDomainMap."]
    pub memSyncDomainMap: CUlaunchMemSyncDomainMap,
    #[doc = "< Value of launch attribute\n::CU_LAUNCH_ATTRIBUTE_MEM_SYNC_DOMAIN. See::CUlaunchMemSyncDomain"]
    pub memSyncDomain: CUlaunchMemSyncDomain,
    pub preferredClusterDim: CUlaunchAttributeValue_union__bindgen_ty_4,
    pub deviceUpdatableKernelNode: CUlaunchAttributeValue_union__bindgen_ty_5,
    #[doc = "< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PREFERRED_SHARED_MEMORY_CARVEOUT."]
    pub sharedMemCarveout: ::std::os::raw::c_uint,
    pub nvlinkUtilCentricScheduling: ::std::os::raw::c_uint,
    #[doc = "< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PORTABLE_CLUSTER_SIZE_MODE."]
    pub portableClusterSizeMode: CUlaunchAttributePortableClusterMode,
    #[doc = "< Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_SHARED_MEMORY_MODE.\nSee ::CUsharedMemoryMode for acceptable values."]
    pub sharedMemoryMode: CUsharedMemoryMode,
}
#[doc = "  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_CLUSTER_DIMENSION that\n  represents the desired cluster dimensions for the kernel. Opaque type\n  with the following fields:\n      - \\p x - The X dimension of the cluster, in blocks. Must be a divisor\n               of the grid X dimension.\n      - \\p y - The Y dimension of the cluster, in blocks. Must be a divisor\n               of the grid Y dimension.\n      - \\p z - The Z dimension of the cluster, in blocks. Must be a divisor\n               of the grid Z dimension."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_1 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttributeValue_union__bindgen_ty_1"]
        [::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_1>() - 12usize];
    ["Alignment of CUlaunchAttributeValue_union__bindgen_ty_1"]
        [::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_1>() - 4usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_1::x"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_1, x) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_1::y"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_1, y) - 4usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_1::z"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_1, z) - 8usize];
};
#[doc = "  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PROGRAMMATIC_EVENT\n  with the following fields:\n      - \\p CUevent event - Event to fire when all blocks trigger it.\n      - \\p Event record flags, see ::cuEventRecordWithFlags. Does not accept :CU_EVENT_RECORD_EXTERNAL.\n      - \\p triggerAtBlockStart - If this is set to non-0, each block launch will automatically trigger the event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_2 {
    pub event: CUevent,
    pub flags: ::std::os::raw::c_int,
    pub triggerAtBlockStart: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttributeValue_union__bindgen_ty_2"]
        [::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_2>() - 16usize];
    ["Alignment of CUlaunchAttributeValue_union__bindgen_ty_2"]
        [::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_2>() - 8usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_2::event"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_2, event) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_2::flags"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_2, flags) - 8usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_2::triggerAtBlockStart"][::std::mem::offset_of!(
        CUlaunchAttributeValue_union__bindgen_ty_2,
        triggerAtBlockStart
    )
        - 12usize];
};
#[doc = " Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_LAUNCH_COMPLETION_EVENT\n with the following fields:\n     - \\p CUevent event - Event to fire when the last block launches\n     - \\p int flags; - Event record flags, see ::cuEventRecordWithFlags. Does not accept ::CU_EVENT_RECORD_EXTERNAL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_3 {
    pub event: CUevent,
    pub flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttributeValue_union__bindgen_ty_3"]
        [::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_3>() - 16usize];
    ["Alignment of CUlaunchAttributeValue_union__bindgen_ty_3"]
        [::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_3>() - 8usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_3::event"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_3, event) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_3::flags"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_3, flags) - 8usize];
};
#[doc = "  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_PREFERRED_CLUSTER_DIMENSION\n  that represents the desired preferred cluster dimensions for the kernel.\n  Opaque type with the following fields:\n      - \\p x - The X dimension of the preferred cluster, in blocks. Must\n               be a divisor of the grid X dimension, and must be a\n               multiple of the \\p x field of ::CUlaunchAttributeValue::clusterDim.\n      - \\p y - The Y dimension of the preferred cluster, in blocks. Must\n               be a divisor of the grid Y dimension, and must be a\n               multiple of the \\p y field of ::CUlaunchAttributeValue::clusterDim.\n      - \\p z - The Z dimension of the preferred cluster, in blocks. Must be\n               equal to the \\p z field of ::CUlaunchAttributeValue::clusterDim."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_4 {
    pub x: ::std::os::raw::c_uint,
    pub y: ::std::os::raw::c_uint,
    pub z: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttributeValue_union__bindgen_ty_4"]
        [::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_4>() - 12usize];
    ["Alignment of CUlaunchAttributeValue_union__bindgen_ty_4"]
        [::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_4>() - 4usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_4::x"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_4, x) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_4::y"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_4, y) - 4usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_4::z"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_4, z) - 8usize];
};
#[doc = "  Value of launch attribute ::CU_LAUNCH_ATTRIBUTE_DEVICE_UPDATABLE_KERNEL_NODE.\n  with the following fields:\n      - \\p int deviceUpdatable - Whether or not the resulting kernel node should be device-updatable.\n      - \\p CUgraphDeviceNode devNode - Returns a handle to pass to the various device-side update functions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchAttributeValue_union__bindgen_ty_5 {
    pub deviceUpdatable: ::std::os::raw::c_int,
    pub devNode: CUgraphDeviceNode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttributeValue_union__bindgen_ty_5"]
        [::std::mem::size_of::<CUlaunchAttributeValue_union__bindgen_ty_5>() - 16usize];
    ["Alignment of CUlaunchAttributeValue_union__bindgen_ty_5"]
        [::std::mem::align_of::<CUlaunchAttributeValue_union__bindgen_ty_5>() - 8usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_5::deviceUpdatable"][::std::mem::offset_of!(
        CUlaunchAttributeValue_union__bindgen_ty_5,
        deviceUpdatable
    ) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union__bindgen_ty_5::devNode"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union__bindgen_ty_5, devNode) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttributeValue_union"]
        [::std::mem::size_of::<CUlaunchAttributeValue_union>() - 64usize];
    ["Alignment of CUlaunchAttributeValue_union"]
        [::std::mem::align_of::<CUlaunchAttributeValue_union>() - 8usize];
    ["Offset of field: CUlaunchAttributeValue_union::pad"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, pad) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::accessPolicyWindow"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, accessPolicyWindow) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::cooperative"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, cooperative) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::syncPolicy"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, syncPolicy) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::clusterDim"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, clusterDim) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::clusterSchedulingPolicyPreference"][::std::mem::offset_of!(
        CUlaunchAttributeValue_union,
        clusterSchedulingPolicyPreference
    )
        - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::programmaticStreamSerializationAllowed"][::std::mem::offset_of!(
        CUlaunchAttributeValue_union,
        programmaticStreamSerializationAllowed
    )
        - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::programmaticEvent"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, programmaticEvent) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::launchCompletionEvent"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, launchCompletionEvent) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::priority"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, priority) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::memSyncDomainMap"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, memSyncDomainMap) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::memSyncDomain"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, memSyncDomain) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::preferredClusterDim"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, preferredClusterDim) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::deviceUpdatableKernelNode"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, deviceUpdatableKernelNode) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::sharedMemCarveout"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, sharedMemCarveout) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::nvlinkUtilCentricScheduling"][::std::mem::offset_of!(
        CUlaunchAttributeValue_union,
        nvlinkUtilCentricScheduling
    ) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::portableClusterSizeMode"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, portableClusterSizeMode) - 0usize];
    ["Offset of field: CUlaunchAttributeValue_union::sharedMemoryMode"]
        [::std::mem::offset_of!(CUlaunchAttributeValue_union, sharedMemoryMode) - 0usize];
};
#[doc = " Launch attributes union; used as value field of ::CUlaunchAttribute"]
pub type CUlaunchAttributeValue = CUlaunchAttributeValue_union;
#[doc = " Launch attribute"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUlaunchAttribute_st {
    #[doc = "< Attribute to set"]
    pub id: CUlaunchAttributeID,
    pub pad: [::std::os::raw::c_char; 4usize],
    #[doc = "< Value of the attribute"]
    pub value: CUlaunchAttributeValue,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchAttribute_st"][::std::mem::size_of::<CUlaunchAttribute_st>() - 72usize];
    ["Alignment of CUlaunchAttribute_st"][::std::mem::align_of::<CUlaunchAttribute_st>() - 8usize];
    ["Offset of field: CUlaunchAttribute_st::id"]
        [::std::mem::offset_of!(CUlaunchAttribute_st, id) - 0usize];
    ["Offset of field: CUlaunchAttribute_st::pad"]
        [::std::mem::offset_of!(CUlaunchAttribute_st, pad) - 4usize];
    ["Offset of field: CUlaunchAttribute_st::value"]
        [::std::mem::offset_of!(CUlaunchAttribute_st, value) - 8usize];
};
#[doc = " Launch attribute"]
pub type CUlaunchAttribute = CUlaunchAttribute_st;
#[doc = " CUDA extensible launch configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlaunchConfig_st {
    #[doc = "< Width of grid in blocks"]
    pub gridDimX: ::std::os::raw::c_uint,
    #[doc = "< Height of grid in blocks"]
    pub gridDimY: ::std::os::raw::c_uint,
    #[doc = "< Depth of grid in blocks"]
    pub gridDimZ: ::std::os::raw::c_uint,
    #[doc = "< X dimension of each thread block"]
    pub blockDimX: ::std::os::raw::c_uint,
    #[doc = "< Y dimension of each thread block"]
    pub blockDimY: ::std::os::raw::c_uint,
    #[doc = "< Z dimension of each thread block"]
    pub blockDimZ: ::std::os::raw::c_uint,
    #[doc = "< Dynamic shared-memory size per thread block in bytes"]
    pub sharedMemBytes: ::std::os::raw::c_uint,
    #[doc = "< Stream identifier"]
    pub hStream: CUstream,
    #[doc = "< List of attributes; nullable if ::CUlaunchConfig::numAttrs == 0"]
    pub attrs: *mut CUlaunchAttribute,
    #[doc = "< Number of attributes populated in ::CUlaunchConfig::attrs"]
    pub numAttrs: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlaunchConfig_st"][::std::mem::size_of::<CUlaunchConfig_st>() - 56usize];
    ["Alignment of CUlaunchConfig_st"][::std::mem::align_of::<CUlaunchConfig_st>() - 8usize];
    ["Offset of field: CUlaunchConfig_st::gridDimX"]
        [::std::mem::offset_of!(CUlaunchConfig_st, gridDimX) - 0usize];
    ["Offset of field: CUlaunchConfig_st::gridDimY"]
        [::std::mem::offset_of!(CUlaunchConfig_st, gridDimY) - 4usize];
    ["Offset of field: CUlaunchConfig_st::gridDimZ"]
        [::std::mem::offset_of!(CUlaunchConfig_st, gridDimZ) - 8usize];
    ["Offset of field: CUlaunchConfig_st::blockDimX"]
        [::std::mem::offset_of!(CUlaunchConfig_st, blockDimX) - 12usize];
    ["Offset of field: CUlaunchConfig_st::blockDimY"]
        [::std::mem::offset_of!(CUlaunchConfig_st, blockDimY) - 16usize];
    ["Offset of field: CUlaunchConfig_st::blockDimZ"]
        [::std::mem::offset_of!(CUlaunchConfig_st, blockDimZ) - 20usize];
    ["Offset of field: CUlaunchConfig_st::sharedMemBytes"]
        [::std::mem::offset_of!(CUlaunchConfig_st, sharedMemBytes) - 24usize];
    ["Offset of field: CUlaunchConfig_st::hStream"]
        [::std::mem::offset_of!(CUlaunchConfig_st, hStream) - 32usize];
    ["Offset of field: CUlaunchConfig_st::attrs"]
        [::std::mem::offset_of!(CUlaunchConfig_st, attrs) - 40usize];
    ["Offset of field: CUlaunchConfig_st::numAttrs"]
        [::std::mem::offset_of!(CUlaunchConfig_st, numAttrs) - 48usize];
};
#[doc = " CUDA extensible launch configuration"]
pub type CUlaunchConfig = CUlaunchConfig_st;
#[doc = " Launch attributes enum; used as id field of ::CUlaunchAttribute"]
pub use self::CUlaunchAttributeID as CUkernelNodeAttrID;
#[doc = " Launch attributes union; used as value field of ::CUlaunchAttribute"]
pub type CUkernelNodeAttrValue_v1 = CUlaunchAttributeValue;
#[doc = " Launch attributes union; used as value field of ::CUlaunchAttribute"]
pub type CUkernelNodeAttrValue = CUkernelNodeAttrValue_v1;
#[doc = "< Stream is not capturing"]
pub const CUstreamCaptureStatus_enum_CU_STREAM_CAPTURE_STATUS_NONE: CUstreamCaptureStatus_enum = 0;
#[doc = "< Stream is actively capturing"]
pub const CUstreamCaptureStatus_enum_CU_STREAM_CAPTURE_STATUS_ACTIVE: CUstreamCaptureStatus_enum =
    1;
#[doc = "< Stream is part of a capture sequence that\nhas been invalidated, but not terminated"]
pub const CUstreamCaptureStatus_enum_CU_STREAM_CAPTURE_STATUS_INVALIDATED:
    CUstreamCaptureStatus_enum = 2;
#[doc = " Possible stream capture statuses returned by ::cuStreamIsCapturing"]
pub type CUstreamCaptureStatus_enum = ::std::os::raw::c_uint;
#[doc = " Possible stream capture statuses returned by ::cuStreamIsCapturing"]
pub use self::CUstreamCaptureStatus_enum as CUstreamCaptureStatus;
pub const CUstreamCaptureMode_enum_CU_STREAM_CAPTURE_MODE_GLOBAL: CUstreamCaptureMode_enum = 0;
pub const CUstreamCaptureMode_enum_CU_STREAM_CAPTURE_MODE_THREAD_LOCAL: CUstreamCaptureMode_enum =
    1;
pub const CUstreamCaptureMode_enum_CU_STREAM_CAPTURE_MODE_RELAXED: CUstreamCaptureMode_enum = 2;
#[doc = " Possible modes for stream capture thread interactions. For more details see\n ::cuStreamBeginCapture and ::cuThreadExchangeStreamCaptureMode"]
pub type CUstreamCaptureMode_enum = ::std::os::raw::c_uint;
#[doc = " Launch attributes enum; used as id field of ::CUlaunchAttribute"]
pub use self::CUlaunchAttributeID as CUstreamAttrID;
#[doc = " Possible modes for stream capture thread interactions. For more details see\n ::cuStreamBeginCapture and ::cuThreadExchangeStreamCaptureMode"]
pub use self::CUstreamCaptureMode_enum as CUstreamCaptureMode;
#[doc = " Launch attributes union; used as value field of ::CUlaunchAttribute"]
pub type CUstreamAttrValue_v1 = CUlaunchAttributeValue;
#[doc = " Launch attributes union; used as value field of ::CUlaunchAttribute"]
pub type CUstreamAttrValue = CUstreamAttrValue_v1;
#[doc = "< Default search mode for driver symbols."]
pub const CUdriverProcAddress_flags_enum_CU_GET_PROC_ADDRESS_DEFAULT:
    CUdriverProcAddress_flags_enum = 0;
#[doc = "< Search for legacy versions of driver symbols."]
pub const CUdriverProcAddress_flags_enum_CU_GET_PROC_ADDRESS_LEGACY_STREAM:
    CUdriverProcAddress_flags_enum = 1;
#[doc = "< Search for per-thread versions of driver symbols."]
pub const CUdriverProcAddress_flags_enum_CU_GET_PROC_ADDRESS_PER_THREAD_DEFAULT_STREAM:
    CUdriverProcAddress_flags_enum = 2;
#[doc = " Flags to specify search options. For more details see ::cuGetProcAddress"]
pub type CUdriverProcAddress_flags_enum = ::std::os::raw::c_uint;
#[doc = " Flags to specify search options. For more details see ::cuGetProcAddress"]
pub use self::CUdriverProcAddress_flags_enum as CUdriverProcAddress_flags;
#[doc = "< Symbol was succesfully found"]
pub const CUdriverProcAddressQueryResult_enum_CU_GET_PROC_ADDRESS_SUCCESS:
    CUdriverProcAddressQueryResult_enum = 0;
#[doc = "< Symbol was not found in search"]
pub const CUdriverProcAddressQueryResult_enum_CU_GET_PROC_ADDRESS_SYMBOL_NOT_FOUND:
    CUdriverProcAddressQueryResult_enum = 1;
#[doc = "< Symbol was found but version supplied was not sufficient"]
pub const CUdriverProcAddressQueryResult_enum_CU_GET_PROC_ADDRESS_VERSION_NOT_SUFFICIENT:
    CUdriverProcAddressQueryResult_enum = 2;
#[doc = " Flags to indicate search status. For more details see ::cuGetProcAddress"]
pub type CUdriverProcAddressQueryResult_enum = ::std::os::raw::c_uint;
#[doc = " Flags to indicate search status. For more details see ::cuGetProcAddress"]
pub use self::CUdriverProcAddressQueryResult_enum as CUdriverProcAddressQueryResult;
#[doc = "< Create a context with limited SMs."]
pub const CUexecAffinityType_enum_CU_EXEC_AFFINITY_TYPE_SM_COUNT: CUexecAffinityType_enum = 0;
pub const CUexecAffinityType_enum_CU_EXEC_AFFINITY_TYPE_MAX: CUexecAffinityType_enum = 1;
#[doc = " Execution Affinity Types"]
pub type CUexecAffinityType_enum = ::std::os::raw::c_uint;
#[doc = " Execution Affinity Types"]
pub use self::CUexecAffinityType_enum as CUexecAffinityType;
#[doc = " Value for ::CU_EXEC_AFFINITY_TYPE_SM_COUNT"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUexecAffinitySmCount_st {
    #[doc = "< The number of SMs the context is limited to use."]
    pub val: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUexecAffinitySmCount_st"]
        [::std::mem::size_of::<CUexecAffinitySmCount_st>() - 4usize];
    ["Alignment of CUexecAffinitySmCount_st"]
        [::std::mem::align_of::<CUexecAffinitySmCount_st>() - 4usize];
    ["Offset of field: CUexecAffinitySmCount_st::val"]
        [::std::mem::offset_of!(CUexecAffinitySmCount_st, val) - 0usize];
};
#[doc = " Value for ::CU_EXEC_AFFINITY_TYPE_SM_COUNT"]
pub type CUexecAffinitySmCount_v1 = CUexecAffinitySmCount_st;
#[doc = " Value for ::CU_EXEC_AFFINITY_TYPE_SM_COUNT"]
pub type CUexecAffinitySmCount = CUexecAffinitySmCount_v1;
#[doc = " Execution Affinity Parameters"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CUexecAffinityParam_st {
    #[doc = "< Type of execution affinity."]
    pub type_: CUexecAffinityType,
    pub param: CUexecAffinityParam_st__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union CUexecAffinityParam_st__bindgen_ty_1 {
    #[doc = "< Value for ::CU_EXEC_AFFINITY_TYPE_SM_COUNT"]
    pub smCount: CUexecAffinitySmCount,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUexecAffinityParam_st__bindgen_ty_1"]
        [::std::mem::size_of::<CUexecAffinityParam_st__bindgen_ty_1>() - 4usize];
    ["Alignment of CUexecAffinityParam_st__bindgen_ty_1"]
        [::std::mem::align_of::<CUexecAffinityParam_st__bindgen_ty_1>() - 4usize];
    ["Offset of field: CUexecAffinityParam_st__bindgen_ty_1::smCount"]
        [::std::mem::offset_of!(CUexecAffinityParam_st__bindgen_ty_1, smCount) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUexecAffinityParam_st"][::std::mem::size_of::<CUexecAffinityParam_st>() - 8usize];
    ["Alignment of CUexecAffinityParam_st"]
        [::std::mem::align_of::<CUexecAffinityParam_st>() - 4usize];
    ["Offset of field: CUexecAffinityParam_st::type_"]
        [::std::mem::offset_of!(CUexecAffinityParam_st, type_) - 0usize];
    ["Offset of field: CUexecAffinityParam_st::param"]
        [::std::mem::offset_of!(CUexecAffinityParam_st, param) - 4usize];
};
#[doc = " Execution Affinity Parameters"]
pub type CUexecAffinityParam_v1 = CUexecAffinityParam_st;
#[doc = " Execution Affinity Parameters"]
pub type CUexecAffinityParam = CUexecAffinityParam_v1;
#[doc = "< D3D12 Command Queue Handle"]
pub const CUcigDataType_enum_CIG_DATA_TYPE_D3D12_COMMAND_QUEUE: CUcigDataType_enum = 1;
#[doc = "< Nvidia specific data blob used for Vulkan and other NV clients"]
pub const CUcigDataType_enum_CIG_DATA_TYPE_NV_BLOB: CUcigDataType_enum = 2;
pub type CUcigDataType_enum = ::std::os::raw::c_uint;
pub use self::CUcigDataType_enum as CUcigDataType;
#[doc = " CIG Context Create Params"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUctxCigParam_st {
    #[doc = "< Type of shared data from graphics client (D3D12 or Vulkan)."]
    pub sharedDataType: CUcigDataType,
    #[doc = "< Graphics client data handle (ID3D12CommandQueue or Nvidia specific data blob)."]
    pub sharedData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUctxCigParam_st"][::std::mem::size_of::<CUctxCigParam_st>() - 16usize];
    ["Alignment of CUctxCigParam_st"][::std::mem::align_of::<CUctxCigParam_st>() - 8usize];
    ["Offset of field: CUctxCigParam_st::sharedDataType"]
        [::std::mem::offset_of!(CUctxCigParam_st, sharedDataType) - 0usize];
    ["Offset of field: CUctxCigParam_st::sharedData"]
        [::std::mem::offset_of!(CUctxCigParam_st, sharedData) - 8usize];
};
#[doc = " CIG Context Create Params"]
pub type CUctxCigParam = CUctxCigParam_st;
#[doc = " Params for creating CUDA context.\n Both execAffinityParams and cigParams cannot be non-NULL at the same time. If both are NULL, the context will be created as a regular CUDA context."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUctxCreateParams_st {
    #[doc = "< Array of execution affinity parameters to limit context resources (e.g., SM count). Only supported Volta+ MPS. Mutually exclusive with cigParams."]
    pub execAffinityParams: *mut CUexecAffinityParam,
    #[doc = "< Number of elements in execAffinityParams array. Must be 0 if execAffinityParams is NULL."]
    pub numExecAffinityParams: ::std::os::raw::c_int,
    #[doc = "< CIG (CUDA in Graphics) parameters for sharing data from D3D12/Vulkan graphics clients. Mutually exclusive with execAffinityParams."]
    pub cigParams: *mut CUctxCigParam,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUctxCreateParams_st"][::std::mem::size_of::<CUctxCreateParams_st>() - 24usize];
    ["Alignment of CUctxCreateParams_st"][::std::mem::align_of::<CUctxCreateParams_st>() - 8usize];
    ["Offset of field: CUctxCreateParams_st::execAffinityParams"]
        [::std::mem::offset_of!(CUctxCreateParams_st, execAffinityParams) - 0usize];
    ["Offset of field: CUctxCreateParams_st::numExecAffinityParams"]
        [::std::mem::offset_of!(CUctxCreateParams_st, numExecAffinityParams) - 8usize];
    ["Offset of field: CUctxCreateParams_st::cigParams"]
        [::std::mem::offset_of!(CUctxCreateParams_st, cigParams) - 16usize];
};
#[doc = " Params for creating CUDA context.\n Both execAffinityParams and cigParams cannot be non-NULL at the same time. If both are NULL, the context will be created as a regular CUDA context."]
pub type CUctxCreateParams = CUctxCreateParams_st;
#[doc = "< D3D12 Command List Handle"]
pub const CUstreamCigDataType_enum_STREAM_CIG_DATA_TYPE_D3D12_COMMAND_LIST:
    CUstreamCigDataType_enum = 1;
pub type CUstreamCigDataType_enum = ::std::os::raw::c_uint;
pub use self::CUstreamCigDataType_enum as CUstreamCigDataType;
#[doc = " CIG Stream Capture Params"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstreamCigParam_st {
    #[doc = "< Type of shared data from graphics client (D3D12)."]
    pub streamSharedDataType: CUstreamCigDataType,
    #[doc = "< Graphics client data handle (ID3D12CommandList/ID3D12GraphicsCommandList)."]
    pub streamSharedData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamCigParam_st"][::std::mem::size_of::<CUstreamCigParam_st>() - 16usize];
    ["Alignment of CUstreamCigParam_st"][::std::mem::align_of::<CUstreamCigParam_st>() - 8usize];
    ["Offset of field: CUstreamCigParam_st::streamSharedDataType"]
        [::std::mem::offset_of!(CUstreamCigParam_st, streamSharedDataType) - 0usize];
    ["Offset of field: CUstreamCigParam_st::streamSharedData"]
        [::std::mem::offset_of!(CUstreamCigParam_st, streamSharedData) - 8usize];
};
#[doc = " CIG Stream Capture Params"]
pub type CUstreamCigParam = CUstreamCigParam_st;
#[doc = " Params for capturing CUDA stream to CIG\n streamCigParams must be non-NULL."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUstreamCigCaptureParams_st {
    #[doc = "< CIG (CUDA in Graphics) parameters for sharing command list data from D3D12 graphics clients."]
    pub streamCigParams: *mut CUstreamCigParam,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUstreamCigCaptureParams_st"]
        [::std::mem::size_of::<CUstreamCigCaptureParams_st>() - 8usize];
    ["Alignment of CUstreamCigCaptureParams_st"]
        [::std::mem::align_of::<CUstreamCigCaptureParams_st>() - 8usize];
    ["Offset of field: CUstreamCigCaptureParams_st::streamCigParams"]
        [::std::mem::offset_of!(CUstreamCigCaptureParams_st, streamCigParams) - 0usize];
};
#[doc = " Params for capturing CUDA stream to CIG\n streamCigParams must be non-NULL."]
pub type CUstreamCigCaptureParams = CUstreamCigCaptureParams_st;
pub const CUlibraryOption_enum_CU_LIBRARY_HOST_UNIVERSAL_FUNCTION_AND_DATA_TABLE:
    CUlibraryOption_enum = 0;
#[doc = " Specifes that the argument \\p code passed to ::cuLibraryLoadData() will be preserved.\n Specifying this option will let the driver know that \\p code can be accessed at any point\n until ::cuLibraryUnload(). The default behavior is for the driver to allocate and\n maintain its own copy of \\p code. Note that this is only a memory usage optimization\n hint and the driver can choose to ignore it if required.\n Specifying this option with ::cuLibraryLoadFromFile() is invalid and\n will return ::CUDA_ERROR_INVALID_VALUE."]
pub const CUlibraryOption_enum_CU_LIBRARY_BINARY_IS_PRESERVED: CUlibraryOption_enum = 1;
#[doc = " Specifes that the argument \\p code passed to ::cuLibraryLoadData() will be preserved.\n Specifying this option will let the driver know that \\p code can be accessed at any point\n until ::cuLibraryUnload(). The default behavior is for the driver to allocate and\n maintain its own copy of \\p code. Note that this is only a memory usage optimization\n hint and the driver can choose to ignore it if required.\n Specifying this option with ::cuLibraryLoadFromFile() is invalid and\n will return ::CUDA_ERROR_INVALID_VALUE."]
pub const CUlibraryOption_enum_CU_LIBRARY_NUM_OPTIONS: CUlibraryOption_enum = 2;
#[doc = " Library options to be specified with ::cuLibraryLoadData() or ::cuLibraryLoadFromFile()"]
pub type CUlibraryOption_enum = ::std::os::raw::c_uint;
#[doc = " Library options to be specified with ::cuLibraryLoadData() or ::cuLibraryLoadFromFile()"]
pub use self::CUlibraryOption_enum as CUlibraryOption;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUlibraryHostUniversalFunctionAndDataTable_st {
    pub functionTable: *mut ::std::os::raw::c_void,
    pub functionWindowSize: usize,
    pub dataTable: *mut ::std::os::raw::c_void,
    pub dataWindowSize: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUlibraryHostUniversalFunctionAndDataTable_st"]
        [::std::mem::size_of::<CUlibraryHostUniversalFunctionAndDataTable_st>() - 32usize];
    ["Alignment of CUlibraryHostUniversalFunctionAndDataTable_st"]
        [::std::mem::align_of::<CUlibraryHostUniversalFunctionAndDataTable_st>() - 8usize];
    ["Offset of field: CUlibraryHostUniversalFunctionAndDataTable_st::functionTable"][::std::mem::offset_of!(
        CUlibraryHostUniversalFunctionAndDataTable_st,
        functionTable
    ) - 0usize];
    ["Offset of field: CUlibraryHostUniversalFunctionAndDataTable_st::functionWindowSize"][::std::mem::offset_of!(
        CUlibraryHostUniversalFunctionAndDataTable_st,
        functionWindowSize
    )
        - 8usize];
    ["Offset of field: CUlibraryHostUniversalFunctionAndDataTable_st::dataTable"][::std::mem::offset_of!(
        CUlibraryHostUniversalFunctionAndDataTable_st,
        dataTable
    ) - 16usize];
    ["Offset of field: CUlibraryHostUniversalFunctionAndDataTable_st::dataWindowSize"][::std::mem::offset_of!(
        CUlibraryHostUniversalFunctionAndDataTable_st,
        dataWindowSize
    ) - 24usize];
};
pub type CUlibraryHostUniversalFunctionAndDataTable = CUlibraryHostUniversalFunctionAndDataTable_st;
#[doc = " The API call returned with no errors. In the case of query calls, this\n also means that the operation being queried is complete (see\n ::cuEventQuery() and ::cuStreamQuery())."]
pub const cudaError_enum_CUDA_SUCCESS: cudaError_enum = 0;
#[doc = " This indicates that one or more of the parameters passed to the API call\n is not within an acceptable range of values."]
pub const cudaError_enum_CUDA_ERROR_INVALID_VALUE: cudaError_enum = 1;
#[doc = " The API call failed because it was unable to allocate enough memory or\n other resources to perform the requested operation."]
pub const cudaError_enum_CUDA_ERROR_OUT_OF_MEMORY: cudaError_enum = 2;
#[doc = " This indicates that the CUDA driver has not been initialized with\n ::cuInit() or that initialization has failed."]
pub const cudaError_enum_CUDA_ERROR_NOT_INITIALIZED: cudaError_enum = 3;
#[doc = " This indicates that the CUDA driver is in the process of shutting down."]
pub const cudaError_enum_CUDA_ERROR_DEINITIALIZED: cudaError_enum = 4;
#[doc = " This indicates profiler is not initialized for this run. This can\n happen when the application is running with external profiling tools\n like visual profiler."]
pub const cudaError_enum_CUDA_ERROR_PROFILER_DISABLED: cudaError_enum = 5;
#[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to attempt to enable/disable the profiling via ::cuProfilerStart or\n ::cuProfilerStop without initialization."]
pub const cudaError_enum_CUDA_ERROR_PROFILER_NOT_INITIALIZED: cudaError_enum = 6;
#[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to call cuProfilerStart() when profiling is already enabled."]
pub const cudaError_enum_CUDA_ERROR_PROFILER_ALREADY_STARTED: cudaError_enum = 7;
#[doc = " \\deprecated\n This error return is deprecated as of CUDA 5.0. It is no longer an error\n to call cuProfilerStop() when profiling is already disabled."]
pub const cudaError_enum_CUDA_ERROR_PROFILER_ALREADY_STOPPED: cudaError_enum = 8;
#[doc = " This indicates that the CUDA driver that the application has loaded is a\n stub library. Applications that run with the stub rather than a real\n driver loaded will result in CUDA API returning this error."]
pub const cudaError_enum_CUDA_ERROR_STUB_LIBRARY: cudaError_enum = 34;
#[doc = " This indicates that the API call requires a newer CUDA driver than the one\n currently installed. Users should install an updated NVIDIA CUDA driver\n to allow the API call to succeed."]
pub const cudaError_enum_CUDA_ERROR_CALL_REQUIRES_NEWER_DRIVER: cudaError_enum = 36;
#[doc = " This indicates that requested CUDA device is unavailable at the current\n time. Devices are often unavailable due to use of\n ::CU_COMPUTEMODE_EXCLUSIVE_PROCESS or ::CU_COMPUTEMODE_PROHIBITED."]
pub const cudaError_enum_CUDA_ERROR_DEVICE_UNAVAILABLE: cudaError_enum = 46;
#[doc = " This indicates that no CUDA-capable devices were detected by the installed\n CUDA driver."]
pub const cudaError_enum_CUDA_ERROR_NO_DEVICE: cudaError_enum = 100;
#[doc = " This indicates that the device ordinal supplied by the user does not\n correspond to a valid CUDA device or that the action requested is\n invalid for the specified device."]
pub const cudaError_enum_CUDA_ERROR_INVALID_DEVICE: cudaError_enum = 101;
#[doc = " This error indicates that the Grid license is not applied."]
pub const cudaError_enum_CUDA_ERROR_DEVICE_NOT_LICENSED: cudaError_enum = 102;
#[doc = " This indicates that the device kernel image is invalid. This can also\n indicate an invalid CUDA module."]
pub const cudaError_enum_CUDA_ERROR_INVALID_IMAGE: cudaError_enum = 200;
#[doc = " This most frequently indicates that there is no context bound to the\n current thread. This can also be returned if the context passed to an\n API call is not a valid handle (such as a context that has had\n ::cuCtxDestroy() invoked on it). This can also be returned if a user\n mixes different API versions (i.e. 3010 context with 3020 API calls).\n See ::cuCtxGetApiVersion() for more details.\n This can also be returned if the green context passed to an API call\n was not converted to a ::CUcontext using ::cuCtxFromGreenCtx API."]
pub const cudaError_enum_CUDA_ERROR_INVALID_CONTEXT: cudaError_enum = 201;
#[doc = " This indicated that the context being supplied as a parameter to the\n API call was already the active context.\n \\deprecated\n This error return is deprecated as of CUDA 3.2. It is no longer an\n error to attempt to push the active context via ::cuCtxPushCurrent()."]
pub const cudaError_enum_CUDA_ERROR_CONTEXT_ALREADY_CURRENT: cudaError_enum = 202;
#[doc = " This indicates that a map or register operation has failed."]
pub const cudaError_enum_CUDA_ERROR_MAP_FAILED: cudaError_enum = 205;
#[doc = " This indicates that an unmap or unregister operation has failed."]
pub const cudaError_enum_CUDA_ERROR_UNMAP_FAILED: cudaError_enum = 206;
#[doc = " This indicates that the specified array is currently mapped and thus\n cannot be destroyed."]
pub const cudaError_enum_CUDA_ERROR_ARRAY_IS_MAPPED: cudaError_enum = 207;
#[doc = " This indicates that the resource is already mapped."]
pub const cudaError_enum_CUDA_ERROR_ALREADY_MAPPED: cudaError_enum = 208;
#[doc = " This indicates that there is no kernel image available that is suitable\n for the device. This can occur when a user specifies code generation\n options for a particular CUDA source file that do not include the\n corresponding device configuration."]
pub const cudaError_enum_CUDA_ERROR_NO_BINARY_FOR_GPU: cudaError_enum = 209;
#[doc = " This indicates that a resource has already been acquired."]
pub const cudaError_enum_CUDA_ERROR_ALREADY_ACQUIRED: cudaError_enum = 210;
#[doc = " This indicates that a resource is not mapped."]
pub const cudaError_enum_CUDA_ERROR_NOT_MAPPED: cudaError_enum = 211;
#[doc = " This indicates that a mapped resource is not available for access as an\n array."]
pub const cudaError_enum_CUDA_ERROR_NOT_MAPPED_AS_ARRAY: cudaError_enum = 212;
#[doc = " This indicates that a mapped resource is not available for access as a\n pointer."]
pub const cudaError_enum_CUDA_ERROR_NOT_MAPPED_AS_POINTER: cudaError_enum = 213;
#[doc = " This indicates that an uncorrectable ECC error was detected during\n execution."]
pub const cudaError_enum_CUDA_ERROR_ECC_UNCORRECTABLE: cudaError_enum = 214;
#[doc = " This indicates that the ::CUlimit passed to the API call is not\n supported by the active device."]
pub const cudaError_enum_CUDA_ERROR_UNSUPPORTED_LIMIT: cudaError_enum = 215;
#[doc = " This indicates that the ::CUcontext passed to the API call can\n only be bound to a single CPU thread at a time but is already\n bound to a CPU thread."]
pub const cudaError_enum_CUDA_ERROR_CONTEXT_ALREADY_IN_USE: cudaError_enum = 216;
#[doc = " This indicates that peer access is not supported across the given\n devices."]
pub const cudaError_enum_CUDA_ERROR_PEER_ACCESS_UNSUPPORTED: cudaError_enum = 217;
#[doc = " This indicates that a PTX JIT compilation failed."]
pub const cudaError_enum_CUDA_ERROR_INVALID_PTX: cudaError_enum = 218;
#[doc = " This indicates an error with OpenGL or DirectX context."]
pub const cudaError_enum_CUDA_ERROR_INVALID_GRAPHICS_CONTEXT: cudaError_enum = 219;
#[doc = " This indicates that an uncorrectable NVLink error was detected during the\n execution."]
pub const cudaError_enum_CUDA_ERROR_NVLINK_UNCORRECTABLE: cudaError_enum = 220;
#[doc = " This indicates that the PTX JIT compiler library was not found."]
pub const cudaError_enum_CUDA_ERROR_JIT_COMPILER_NOT_FOUND: cudaError_enum = 221;
#[doc = " This indicates that the provided PTX was compiled with an unsupported toolchain."]
pub const cudaError_enum_CUDA_ERROR_UNSUPPORTED_PTX_VERSION: cudaError_enum = 222;
#[doc = " This indicates that the PTX JIT compilation was disabled."]
pub const cudaError_enum_CUDA_ERROR_JIT_COMPILATION_DISABLED: cudaError_enum = 223;
#[doc = " This indicates that the ::CUexecAffinityType passed to the API call is not\n supported by the active device."]
pub const cudaError_enum_CUDA_ERROR_UNSUPPORTED_EXEC_AFFINITY: cudaError_enum = 224;
#[doc = " This indicates that the code to be compiled by the PTX JIT contains\n unsupported call to cudaDeviceSynchronize."]
pub const cudaError_enum_CUDA_ERROR_UNSUPPORTED_DEVSIDE_SYNC: cudaError_enum = 225;
#[doc = " This indicates that an exception occurred on the device that is now\n contained by the GPU's error containment capability. Common causes are -\n a. Certain types of invalid accesses of peer GPU memory over nvlink\n b. Certain classes of hardware errors\n This leaves the process in an inconsistent state and any further CUDA\n work will return the same error. To continue using CUDA, the process must\n be terminated and relaunched."]
pub const cudaError_enum_CUDA_ERROR_CONTAINED: cudaError_enum = 226;
#[doc = " This indicates that the device kernel source is invalid. This includes\n compilation/linker errors encountered in device code or user error."]
pub const cudaError_enum_CUDA_ERROR_INVALID_SOURCE: cudaError_enum = 300;
#[doc = " This indicates that the file specified was not found."]
pub const cudaError_enum_CUDA_ERROR_FILE_NOT_FOUND: cudaError_enum = 301;
#[doc = " This indicates that a link to a shared object failed to resolve."]
pub const cudaError_enum_CUDA_ERROR_SHARED_OBJECT_SYMBOL_NOT_FOUND: cudaError_enum = 302;
#[doc = " This indicates that initialization of a shared object failed."]
pub const cudaError_enum_CUDA_ERROR_SHARED_OBJECT_INIT_FAILED: cudaError_enum = 303;
#[doc = " This indicates that an OS call failed."]
pub const cudaError_enum_CUDA_ERROR_OPERATING_SYSTEM: cudaError_enum = 304;
#[doc = " This indicates that a resource handle passed to the API call was not\n valid. Resource handles are opaque types like ::CUstream and ::CUevent."]
pub const cudaError_enum_CUDA_ERROR_INVALID_HANDLE: cudaError_enum = 400;
#[doc = " This indicates that a resource required by the API call is not in a\n valid state to perform the requested operation."]
pub const cudaError_enum_CUDA_ERROR_ILLEGAL_STATE: cudaError_enum = 401;
#[doc = " This indicates an attempt was made to introspect an object in a way that\n would discard semantically important information. This is either due to\n the object using funtionality newer than the API version used to\n introspect it or omission of optional return arguments."]
pub const cudaError_enum_CUDA_ERROR_LOSSY_QUERY: cudaError_enum = 402;
#[doc = " This indicates that a named symbol was not found. Examples of symbols\n are global/constant variable names, driver function names, texture names,\n and surface names."]
pub const cudaError_enum_CUDA_ERROR_NOT_FOUND: cudaError_enum = 500;
#[doc = " This indicates that asynchronous operations issued previously have not\n completed yet. This result is not actually an error, but must be indicated\n differently than ::CUDA_SUCCESS (which indicates completion). Calls that\n may return this value include ::cuEventQuery() and ::cuStreamQuery()."]
pub const cudaError_enum_CUDA_ERROR_NOT_READY: cudaError_enum = 600;
#[doc = " While executing a kernel, the device encountered a\n load or store instruction on an invalid memory address.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_ILLEGAL_ADDRESS: cudaError_enum = 700;
#[doc = " This indicates that a launch did not occur because it did not have\n appropriate resources. This error usually indicates that the user has\n attempted to pass too many arguments to the device kernel, or the\n kernel launch specifies too many threads for the kernel's register\n count. Passing arguments of the wrong size (i.e. a 64-bit pointer\n when a 32-bit int is expected) is equivalent to passing too many\n arguments and can also result in this error."]
pub const cudaError_enum_CUDA_ERROR_LAUNCH_OUT_OF_RESOURCES: cudaError_enum = 701;
#[doc = " This indicates that the device kernel took too long to execute. This can\n only occur if timeouts are enabled - see the device attribute\n ::CU_DEVICE_ATTRIBUTE_KERNEL_EXEC_TIMEOUT for more information.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_LAUNCH_TIMEOUT: cudaError_enum = 702;
#[doc = " This error indicates a kernel launch that uses an incompatible texturing\n mode."]
pub const cudaError_enum_CUDA_ERROR_LAUNCH_INCOMPATIBLE_TEXTURING: cudaError_enum = 703;
#[doc = " This error indicates that a call to ::cuCtxEnablePeerAccess() is\n trying to re-enable peer access to a context which has already\n had peer access to it enabled."]
pub const cudaError_enum_CUDA_ERROR_PEER_ACCESS_ALREADY_ENABLED: cudaError_enum = 704;
#[doc = " This error indicates that ::cuCtxDisablePeerAccess() is\n trying to disable peer access which has not been enabled yet\n via ::cuCtxEnablePeerAccess()."]
pub const cudaError_enum_CUDA_ERROR_PEER_ACCESS_NOT_ENABLED: cudaError_enum = 705;
#[doc = " This error indicates that the primary context for the specified device\n has already been initialized."]
pub const cudaError_enum_CUDA_ERROR_PRIMARY_CONTEXT_ACTIVE: cudaError_enum = 708;
#[doc = " This error indicates that the context current to the calling thread\n has been destroyed using ::cuCtxDestroy, or is a primary context which\n has not yet been initialized."]
pub const cudaError_enum_CUDA_ERROR_CONTEXT_IS_DESTROYED: cudaError_enum = 709;
#[doc = " A device-side assert triggered during kernel execution. The context\n cannot be used anymore, and must be destroyed. All existing device\n memory allocations from this context are invalid and must be\n reconstructed if the program is to continue using CUDA."]
pub const cudaError_enum_CUDA_ERROR_ASSERT: cudaError_enum = 710;
#[doc = " This error indicates that the hardware resources required to enable\n peer access have been exhausted for one or more of the devices\n passed to ::cuCtxEnablePeerAccess()."]
pub const cudaError_enum_CUDA_ERROR_TOO_MANY_PEERS: cudaError_enum = 711;
#[doc = " This error indicates that the memory range passed to ::cuMemHostRegister()\n has already been registered."]
pub const cudaError_enum_CUDA_ERROR_HOST_MEMORY_ALREADY_REGISTERED: cudaError_enum = 712;
#[doc = " This error indicates that the pointer passed to ::cuMemHostUnregister()\n does not correspond to any currently registered memory region."]
pub const cudaError_enum_CUDA_ERROR_HOST_MEMORY_NOT_REGISTERED: cudaError_enum = 713;
#[doc = " While executing a kernel, the device encountered a stack error.\n This can be due to stack corruption or exceeding the stack size limit.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_HARDWARE_STACK_ERROR: cudaError_enum = 714;
#[doc = " While executing a kernel, the device encountered an illegal instruction.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_ILLEGAL_INSTRUCTION: cudaError_enum = 715;
#[doc = " While executing a kernel, the device encountered a load or store instruction\n on a memory address which is not aligned.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_MISALIGNED_ADDRESS: cudaError_enum = 716;
#[doc = " While executing a kernel, the device encountered an instruction\n which can only operate on memory locations in certain address spaces\n (global, shared, or local), but was supplied a memory address not\n belonging to an allowed address space.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_INVALID_ADDRESS_SPACE: cudaError_enum = 717;
#[doc = " While executing a kernel, the device program counter wrapped its address space.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_INVALID_PC: cudaError_enum = 718;
#[doc = " An exception occurred on the device while executing a kernel. Common\n causes include dereferencing an invalid device pointer and accessing\n out of bounds shared memory. Less common cases can be system specific - more\n information about these cases can be found in the system specific user guide.\n This leaves the process in an inconsistent state and any further CUDA work\n will return the same error. To continue using CUDA, the process must be terminated\n and relaunched."]
pub const cudaError_enum_CUDA_ERROR_LAUNCH_FAILED: cudaError_enum = 719;
#[doc = " This error indicates that the number of blocks launched per grid for a kernel that was\n launched via either ::cuLaunchCooperativeKernel or ::cuLaunchCooperativeKernelMultiDevice\n exceeds the maximum number of blocks as allowed by ::cuOccupancyMaxActiveBlocksPerMultiprocessor\n or ::cuOccupancyMaxActiveBlocksPerMultiprocessorWithFlags times the number of multiprocessors\n as specified by the device attribute ::CU_DEVICE_ATTRIBUTE_MULTIPROCESSOR_COUNT."]
pub const cudaError_enum_CUDA_ERROR_COOPERATIVE_LAUNCH_TOO_LARGE: cudaError_enum = 720;
#[doc = " An exception occurred on the device while exiting a kernel using tensor memory: the\n tensor memory was not completely deallocated. This leaves the process in an inconsistent\n state and any further CUDA work will return the same error. To continue using CUDA, the\n process must be terminated and relaunched."]
pub const cudaError_enum_CUDA_ERROR_TENSOR_MEMORY_LEAK: cudaError_enum = 721;
#[doc = " This error indicates that the attempted operation is not permitted."]
pub const cudaError_enum_CUDA_ERROR_NOT_PERMITTED: cudaError_enum = 800;
#[doc = " This error indicates that the attempted operation is not supported\n on the current system or device."]
pub const cudaError_enum_CUDA_ERROR_NOT_SUPPORTED: cudaError_enum = 801;
#[doc = " This error indicates that the system is not yet ready to start any CUDA\n work.  To continue using CUDA, verify the system configuration is in a\n valid state and all required driver daemons are actively running.\n More information about this error can be found in the system specific\n user guide."]
pub const cudaError_enum_CUDA_ERROR_SYSTEM_NOT_READY: cudaError_enum = 802;
#[doc = " This error indicates that there is a mismatch between the versions of\n the display driver and the CUDA driver. Refer to the compatibility documentation\n for supported versions."]
pub const cudaError_enum_CUDA_ERROR_SYSTEM_DRIVER_MISMATCH: cudaError_enum = 803;
#[doc = " This error indicates that the system was upgraded to run with forward compatibility\n but the visible hardware detected by CUDA does not support this configuration.\n Refer to the compatibility documentation for the supported hardware matrix or ensure\n that only supported hardware is visible during initialization via the CUDA_VISIBLE_DEVICES\n environment variable."]
pub const cudaError_enum_CUDA_ERROR_COMPAT_NOT_SUPPORTED_ON_DEVICE: cudaError_enum = 804;
#[doc = " This error indicates that the MPS client failed to connect to the MPS control daemon or the MPS server."]
pub const cudaError_enum_CUDA_ERROR_MPS_CONNECTION_FAILED: cudaError_enum = 805;
#[doc = " This error indicates that the remote procedural call between the MPS server and the MPS client failed."]
pub const cudaError_enum_CUDA_ERROR_MPS_RPC_FAILURE: cudaError_enum = 806;
#[doc = " This error indicates that the MPS server is not ready to accept new MPS client requests.\n This error can be returned when the MPS server is in the process of recovering from a fatal failure."]
pub const cudaError_enum_CUDA_ERROR_MPS_SERVER_NOT_READY: cudaError_enum = 807;
#[doc = " This error indicates that the hardware resources required to create MPS client have been exhausted."]
pub const cudaError_enum_CUDA_ERROR_MPS_MAX_CLIENTS_REACHED: cudaError_enum = 808;
#[doc = " This error indicates the the hardware resources required to support device connections have been exhausted."]
pub const cudaError_enum_CUDA_ERROR_MPS_MAX_CONNECTIONS_REACHED: cudaError_enum = 809;
#[doc = " This error indicates that the MPS client has been terminated by the server. To continue using CUDA, the process must be terminated and relaunched."]
pub const cudaError_enum_CUDA_ERROR_MPS_CLIENT_TERMINATED: cudaError_enum = 810;
#[doc = " This error indicates that the module is using CUDA Dynamic Parallelism, but the current configuration, like MPS, does not support it."]
pub const cudaError_enum_CUDA_ERROR_CDP_NOT_SUPPORTED: cudaError_enum = 811;
#[doc = " This error indicates that a module contains an unsupported interaction between different versions of CUDA Dynamic Parallelism."]
pub const cudaError_enum_CUDA_ERROR_CDP_VERSION_MISMATCH: cudaError_enum = 812;
#[doc = " This error indicates that the operation is not permitted when\n the stream is capturing."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_UNSUPPORTED: cudaError_enum = 900;
#[doc = " This error indicates that the current capture sequence on the stream\n has been invalidated due to a previous error."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_INVALIDATED: cudaError_enum = 901;
#[doc = " This error indicates that the operation would have resulted in a merge\n of two independent capture sequences."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_MERGE: cudaError_enum = 902;
#[doc = " This error indicates that the capture was not initiated in this stream."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_UNMATCHED: cudaError_enum = 903;
#[doc = " This error indicates that the capture sequence contains a fork that was\n not joined to the primary stream."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_UNJOINED: cudaError_enum = 904;
#[doc = " This error indicates that a dependency would have been created which\n crosses the capture sequence boundary. Only implicit in-stream ordering\n dependencies are allowed to cross the boundary."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_ISOLATION: cudaError_enum = 905;
#[doc = " This error indicates a disallowed implicit dependency on a current capture\n sequence from cudaStreamLegacy."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_IMPLICIT: cudaError_enum = 906;
#[doc = " This error indicates that the operation is not permitted on an event which\n was last recorded in a capturing stream."]
pub const cudaError_enum_CUDA_ERROR_CAPTURED_EVENT: cudaError_enum = 907;
#[doc = " A stream capture sequence not initiated with the ::CU_STREAM_CAPTURE_MODE_RELAXED\n argument to ::cuStreamBeginCapture was passed to ::cuStreamEndCapture in a\n different thread."]
pub const cudaError_enum_CUDA_ERROR_STREAM_CAPTURE_WRONG_THREAD: cudaError_enum = 908;
#[doc = " This error indicates that the timeout specified for the wait operation has lapsed."]
pub const cudaError_enum_CUDA_ERROR_TIMEOUT: cudaError_enum = 909;
#[doc = " This error indicates that the graph update was not performed because it included\n changes which violated constraints specific to instantiated graph update."]
pub const cudaError_enum_CUDA_ERROR_GRAPH_EXEC_UPDATE_FAILURE: cudaError_enum = 910;
#[doc = " This indicates that an error has occurred in a device outside of GPU. It can be a\n synchronous error w.r.t. CUDA API or an asynchronous error from the external device.\n In case of asynchronous error, it means that if cuda was waiting for an external device's\n signal before consuming shared data, the external device signaled an error indicating that\n the data is not valid for consumption. This leaves the process in an inconsistent\n state and any further CUDA work will return the same error. To continue using CUDA,\n the process must be terminated and relaunched.\n In case of synchronous error, it means that one or more external devices\n have encountered an error and cannot complete the operation."]
pub const cudaError_enum_CUDA_ERROR_EXTERNAL_DEVICE: cudaError_enum = 911;
#[doc = " Indicates a kernel launch error due to cluster misconfiguration."]
pub const cudaError_enum_CUDA_ERROR_INVALID_CLUSTER_SIZE: cudaError_enum = 912;
#[doc = " Indiciates a function handle is not loaded when calling an API that requires\n a loaded function."]
pub const cudaError_enum_CUDA_ERROR_FUNCTION_NOT_LOADED: cudaError_enum = 913;
#[doc = " This error indicates one or more resources passed in are not valid resource\n types for the operation."]
pub const cudaError_enum_CUDA_ERROR_INVALID_RESOURCE_TYPE: cudaError_enum = 914;
#[doc = " This error indicates one or more resources are insufficient or non-applicable for\n the operation."]
pub const cudaError_enum_CUDA_ERROR_INVALID_RESOURCE_CONFIGURATION: cudaError_enum = 915;
#[doc = " This error indicates that an error happened during the key rotation\n sequence."]
pub const cudaError_enum_CUDA_ERROR_KEY_ROTATION: cudaError_enum = 916;
#[doc = " This error indicates that the requested operation is not permitted because the\n stream is in a detached state. This can occur if the green context associated\n with the stream has been destroyed, limiting the stream's operational capabilities."]
pub const cudaError_enum_CUDA_ERROR_STREAM_DETACHED: cudaError_enum = 917;
#[doc = " This indicates that an unknown internal error has occurred."]
pub const cudaError_enum_CUDA_ERROR_UNKNOWN: cudaError_enum = 999;
#[doc = " Error codes"]
pub type cudaError_enum = ::std::os::raw::c_uint;
#[doc = " Error codes"]
pub use self::cudaError_enum as CUresult;
#[doc = "< A relative value indicating the performance of the link between two devices"]
pub const CUdevice_P2PAttribute_enum_CU_DEVICE_P2P_ATTRIBUTE_PERFORMANCE_RANK:
    CUdevice_P2PAttribute_enum = 1;
#[doc = "< P2P Access is enable"]
pub const CUdevice_P2PAttribute_enum_CU_DEVICE_P2P_ATTRIBUTE_ACCESS_SUPPORTED:
    CUdevice_P2PAttribute_enum = 2;
#[doc = "< All CUDA-valid atomic operation over the link are supported"]
pub const CUdevice_P2PAttribute_enum_CU_DEVICE_P2P_ATTRIBUTE_NATIVE_ATOMIC_SUPPORTED:
    CUdevice_P2PAttribute_enum = 3;
#[doc = "< \\deprecated use CU_DEVICE_P2P_ATTRIBUTE_CUDA_ARRAY_ACCESS_SUPPORTED instead"]
pub const CUdevice_P2PAttribute_enum_CU_DEVICE_P2P_ATTRIBUTE_ACCESS_ACCESS_SUPPORTED:
    CUdevice_P2PAttribute_enum = 4;
#[doc = "< Accessing CUDA arrays over the link supported"]
pub const CUdevice_P2PAttribute_enum_CU_DEVICE_P2P_ATTRIBUTE_CUDA_ARRAY_ACCESS_SUPPORTED:
    CUdevice_P2PAttribute_enum = 4;
#[doc = "< Only some CUDA-valid atomic operations over the link are supported."]
pub const CUdevice_P2PAttribute_enum_CU_DEVICE_P2P_ATTRIBUTE_ONLY_PARTIAL_NATIVE_ATOMIC_SUPPORTED : CUdevice_P2PAttribute_enum = 5 ;
#[doc = " P2P Attributes"]
pub type CUdevice_P2PAttribute_enum = ::std::os::raw::c_uint;
#[doc = " P2P Attributes"]
pub use self::CUdevice_P2PAttribute_enum as CUdevice_P2PAttribute;
#[doc = " CUDA stream callback\n \\param hStream The stream the callback was added to, as passed to ::cuStreamAddCallback.  May be NULL.\n \\param status ::CUDA_SUCCESS or any persistent error on the stream.\n \\param userData User parameter provided at registration."]
pub type CUstreamCallback = ::std::option::Option<
    unsafe extern "C" fn(
        hStream: CUstream,
        status: CUresult,
        userData: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " Block size to per-block dynamic shared memory mapping for a certain\n kernel \\param blockSize Block size of the kernel.\n\n \\return The dynamic shared memory needed by a block."]
pub type CUoccupancyB2DSize =
    ::std::option::Option<unsafe extern "C" fn(blockSize: ::std::os::raw::c_int) -> usize>;
#[doc = " 2D memory copy parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMCPY2D_st {
    #[doc = "< Source X in bytes"]
    pub srcXInBytes: usize,
    #[doc = "< Source Y"]
    pub srcY: usize,
    #[doc = "< Source memory type (host, device, array)"]
    pub srcMemoryType: CUmemorytype,
    #[doc = "< Source host pointer"]
    pub srcHost: *const ::std::os::raw::c_void,
    #[doc = "< Source device pointer"]
    pub srcDevice: CUdeviceptr,
    #[doc = "< Source array reference"]
    pub srcArray: CUarray,
    #[doc = "< Source pitch (ignored when src is array)"]
    pub srcPitch: usize,
    #[doc = "< Destination X in bytes"]
    pub dstXInBytes: usize,
    #[doc = "< Destination Y"]
    pub dstY: usize,
    #[doc = "< Destination memory type (host, device, array)"]
    pub dstMemoryType: CUmemorytype,
    #[doc = "< Destination host pointer"]
    pub dstHost: *mut ::std::os::raw::c_void,
    #[doc = "< Destination device pointer"]
    pub dstDevice: CUdeviceptr,
    #[doc = "< Destination array reference"]
    pub dstArray: CUarray,
    #[doc = "< Destination pitch (ignored when dst is array)"]
    pub dstPitch: usize,
    #[doc = "< Width of 2D memory copy in bytes"]
    pub WidthInBytes: usize,
    #[doc = "< Height of 2D memory copy"]
    pub Height: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CUDA_MEMCPY2D_st"][::std::mem::size_of::<CUDA_MEMCPY2D_st>() - 128usize];
    ["Alignment of CUDA_MEMCPY2D_st"][::std::mem::align_of::<CUDA_MEMCPY2D_st>() - 8usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcXInBytes) - 0usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcY"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcY) - 8usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcMemoryType) - 16usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcHost) - 24usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcDevice) - 32usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcArray) - 40usize];
    ["Offset of field: CUDA_MEMCPY2D_st::srcPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, srcPitch) - 48usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstXInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstXInBytes) - 56usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstY"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstY) - 64usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstMemoryType"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstMemoryType) - 72usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstHost"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstHost) - 80usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstDevice"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstDevice) - 88usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstArray"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstArray) - 96usize];
    ["Offset of field: CUDA_MEMCPY2D_st::dstPitch"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, dstPitch) - 104usize];
    ["Offset of field: CUDA_MEMCPY2D_st::WidthInBytes"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, WidthInBytes) - 112usize];
    ["Offset of field: CUDA_MEMCPY2D_st::Height"]
        [::std::mem::offset_of!(CUDA_MEMCPY2D_st, Height) - 120usize];
};
#[doc = " 2D memory copy parameters"]
pub type CUDA_MEMCPY2D_v2 = CUDA_MEMCPY2D_st;
#[doc = " 2D memory copy parameters"]
pub type CUDA_MEMCPY2D = CUDA_MEMCPY2D_v2;
#[doc = " 3D memory copy parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CUDA_MEMCPY3D_st {
    #[doc = "< Source X in bytes"]
    pub srcXInBytes: usize,
    #[doc = "< Source Y"]
    pub srcY: usize,
    #[doc = "< Source Z"]
    pub srcZ: usize,
    #[doc = "< Source LOD"]
    pub srcLOD: usize,
    #[doc = "< Source memory type (host, device, array)"]
    pub srcMemoryType: CUmemorytype,
    #[doc = "< Source host pointer"]
    pub srcHost: *const ::std::os::raw::c_void,
    #[doc = "< Source device pointer"]
    pub srcDevice: CUdeviceptr,
    #[doc = "< Source array reference"]
    pub srcArray: CUarray,
    #[doc = "< Must be NULL"]
    pub reserved0: *mut ::std::os::raw::c_void,
    #[doc = "< Source pitch (ignored when src is array)"]
    pub srcPitch: usize,
    #[doc = "< Source height (ignored when src is array; may be 0 if Depth==1)"]
    pub srcHeight: usize,
    #[doc = "< Destination X in bytes"]
    pub dstXInBytes: usize,
    #[doc = "< Destination Y"]
    pub dstY: usize,
    #[doc = "< Destination Z"]
